; ModuleID = 'mosquitto_sub'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Aloja_container = type { i8*, i32, i32 }
%struct.mosquitto = type { i32, i32, i32, i32, i8*, i8*, i8*, i8*, i16, i16, i32, i64, i64, i64, %struct.mosquitto__packet, %struct.mosquitto__packet*, %struct.mosquitto__packet*, %struct.mosquitto_message_all*, %struct.mosquitto__alias*, %struct.will_delay_list*, i32, i32, i32, i64, i8, i8, i8, i32, i64, i8*, i8, %struct.mosquitto_msg_data, %struct.mosquitto_msg_data, void (%struct.mosquitto*, i8*, i32)*, void (%struct.mosquitto*, i8*, i32, i32)*, void (%struct.mosquitto*, i8*, i32, i32, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32)*, void (%struct.mosquitto*, i8*, i32, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32)*, void (%struct.mosquitto*, i8*, i32, i32, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, %struct.mosquitto_message*)*, void (%struct.mosquitto*, i8*, %struct.mosquitto_message*, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32, i32, i32*)*, void (%struct.mosquitto*, i8*, i32, i32, i32*, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32)*, void (%struct.mosquitto*, i8*, i32, %struct.mqtt5__property*)*, void (%struct.mosquitto*, i8*, i32, i8*)*, i8*, i32, i8*, i32, i32, i32, i8, i8, %struct.mosquitto__packet*, i8, i32 }

!27 = !DIEnumerator(name: "MQTT_RC_SERVER_BUSY", value: 137)
!28 = !DIEnumerator(name: "MQTT_RC_BANNED", value: 138)
!29 = !DIEnumerator(name: "MQTT_RC_SERVER_SHUTTING_DOWN", value: 139)
!30 = !DIEnumerator(name: "MQTT_RC_BAD_AUTHENTICATION_METHOD", value: 140)
!31 = !DIEnumerator(name: "MQTT_RC_KEEP_ALIVE_TIMEOUT", value: 141)
!32 = !DIEnumerator(name: "MQTT_RC_SESSION_TAKEN_OVER", value: 142)
!33 = !DIEnumerator(name: "MQTT_RC_TOPIC_FILTER_INVALID", value: 143)
!34 = !DIEnumerator(name: "MQTT_RC_TOPIC_NAME_INVALID", value: 144)
!35 = !DIEnumerator(name: "MQTT_RC_PACKET_ID_IN_USE", value: 145)
!36 = !DIEnumerator(name: "MQTT_RC_PACKET_ID_NOT_FOUND", value: 146)
!37 = !DIEnumerator(name: "MQTT_RC_RECEIVE_MAXIMUM_EXCEEDED", value: 147)
!38 = !DIEnumerator(name: "MQTT_RC_TOPIC_ALIAS_INVALID", value: 148)
!39 = !DIEnumerator(name: "MQTT_RC_PACKET_TOO_LARGE", value: 149)
!40 = !DIEnumerator(name: "MQTT_RC_MESSAGE_RATE_TOO_HIGH", value: 150)
!41 = !DIEnumerator(name: "MQTT_RC_QUOTA_EXCEEDED", value: 151)
!42 = !DIEnumerator(name: "MQTT_RC_ADMINISTRATIVE_ACTION", value: 152)
!43 = !DIEnumerator(name: "MQTT_RC_PAYLOAD_FORMAT_INVALID", value: 153)
!44 = !DIEnumerator(name: "MQTT_RC_RETAIN_NOT_SUPPORTED", value: 154)
!45 = !DIEnumerator(name: "MQTT_RC_QOS_NOT_SUPPORTED", value: 155)
!46 = !DIEnumerator(name: "MQTT_RC_USE_ANOTHER_SERVER", value: 156)
!47 = !DIEnumerator(name: "MQTT_RC_SERVER_MOVED", value: 157)
!48 = !DIEnumerator(name: "MQTT_RC_SHARED_SUBS_NOT_SUPPORTED", value: 158)
!49 = !DIEnumerator(name: "MQTT_RC_CONNECTION_RATE_EXCEEDED", value: 159)
!50 = !DIEnumerator(name: "MQTT_RC_MAXIMUM_CONNECT_TIME", value: 160)
!51 = !DIEnumerator(name: "MQTT_RC_SUBSCRIPTION_IDS_NOT_SUPPORTED", value: 161)
!52 = !DIEnumerator(name: "MQTT_RC_WILDCARD_SUBS_NOT_SUPPORTED", value: 162)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosq_err_t", file: !54, line: 69, size: 32, elements: !55)
!54 = !DIFile(filename: "../lib/mosquitto.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86}
!56 = !DIEnumerator(name: "MOSQ_ERR_AUTH_CONTINUE", value: -4)
!57 = !DIEnumerator(name: "MOSQ_ERR_NO_SUBSCRIBERS", value: -3)
!58 = !DIEnumerator(name: "MOSQ_ERR_SUB_EXISTS", value: -2)
!59 = !DIEnumerator(name: "MOSQ_ERR_CONN_PENDING", value: -1)
!60 = !DIEnumerator(name: "MOSQ_ERR_SUCCESS", value: 0)
!61 = !DIEnumerator(name: "MOSQ_ERR_NOMEM", value: 1)
!62 = !DIEnumerator(name: "MOSQ_ERR_PROTOCOL", value: 2)
!63 = !DIEnumerator(name: "MOSQ_ERR_INVAL", value: 3)
!64 = !DIEnumerator(name: "MOSQ_ERR_NO_CONN", value: 4)
!65 = !DIEnumerator(name: "MOSQ_ERR_CONN_REFUSED", value: 5)
!66 = !DIEnumerator(name: "MOSQ_ERR_NOT_FOUND", value: 6)
!67 = !DIEnumerator(name: "MOSQ_ERR_CONN_LOST", value: 7)
!68 = !DIEnumerator(name: "MOSQ_ERR_TLS", value: 8)
!69 = !DIEnumerator(name: "MOSQ_ERR_PAYLOAD_SIZE", value: 9)
!70 = !DIEnumerator(name: "MOSQ_ERR_NOT_SUPPORTED", value: 10)
!71 = !DIEnumerator(name: "MOSQ_ERR_AUTH", value: 11)
!72 = !DIEnumerator(name: "MOSQ_ERR_ACL_DENIED", value: 12)
!73 = !DIEnumerator(name: "MOSQ_ERR_UNKNOWN", value: 13)
!74 = !DIEnumerator(name: "MOSQ_ERR_ERRNO", value: 14)
!75 = !DIEnumerator(name: "MOSQ_ERR_EAI", value: 15)
!76 = !DIEnumerator(name: "MOSQ_ERR_PROXY", value: 16)
!77 = !DIEnumerator(name: "MOSQ_ERR_PLUGIN_DEFER", value: 17)
!78 = !DIEnumerator(name: "MOSQ_ERR_MALFORMED_UTF8", value: 18)
!79 = !DIEnumerator(name: "MOSQ_ERR_KEEPALIVE", value: 19)
!80 = !DIEnumerator(name: "MOSQ_ERR_LOOKUP", value: 20)
!81 = !DIEnumerator(name: "MOSQ_ERR_MALFORMED_PACKET", value: 21)
!82 = !DIEnumerator(name: "MOSQ_ERR_DUPLICATE_PROPERTY", value: 22)
!83 = !DIEnumerator(name: "MOSQ_ERR_TLS_HANDSHAKE", value: 23)
!84 = !DIEnumerator(name: "MOSQ_ERR_QOS_NOT_SUPPORTED", value: 24)
!85 = !DIEnumerator(name: "MOSQ_ERR_OVERSIZE_PACKET", value: 25)
!86 = !DIEnumerator(name: "MOSQ_ERR_OCSP", value: 26)
!87 = !{!0, !88, !91, !95, !97}
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "msg_count", scope: !2, file: !3, line: 40, type: !90, isLocal: false, isDefinition: true)
!90 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(name: "mosq", scope: !2, file: !3, line: 41, type: !93, isLocal: false, isDefinition: true)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto", file: !54, line: 134, flags: DIFlagFwdDecl)
!95 = !DIGlobalVariableExpression(var: !96, expr: !DIExpression())
!96 = distinct !DIGlobalVariable(name: "last_mid", scope: !2, file: !3, line: 42, type: !90, isLocal: false, isDefinition: true)
!97 = !DIGlobalVariableExpression(var: !98, expr: !DIExpression())
!98 = distinct !DIGlobalVariable(name: "cfg", scope: !2, file: !3, line: 38, type: !99, isLocal: false, isDefinition: true)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosq_config", file: !100, line: 41, size: 2432, elements: !101)
!100 = !DIFile(filename: "./client_shared.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!101 = !{!102, !105, !106, !107, !108, !109, !110, !111, !113, !114, !115, !116, !118, !119, !120, !121, !130, !131, !132, !134, !135, !136, !137, !138, !139, !140, !141, !142, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !163, !164, !165, !166, !167, !168, !169}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !99, file: !100, line: 42, baseType: !103, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "id_prefix", scope: !99, file: !100, line: 43, baseType: !103, size: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_version", scope: !99, file: !100, line: 44, baseType: !90, size: 32, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !99, file: !100, line: 45, baseType: !90, size: 32, offset: 160)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !99, file: !100, line: 46, baseType: !103, size: 64, offset: 192)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !99, file: !100, line: 47, baseType: !90, size: 32, offset: 256)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !99, file: !100, line: 48, baseType: !90, size: 32, offset: 288)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !99, file: !100, line: 49, baseType: !112, size: 8, offset: 320)
!112 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pub_mode", scope: !99, file: !100, line: 50, baseType: !90, size: 32, offset: 352)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "file_input", scope: !99, file: !100, line: 51, baseType: !103, size: 64, offset: 384)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !99, file: !100, line: 52, baseType: !103, size: 64, offset: 448)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "msglen", scope: !99, file: !100, line: 53, baseType: !117, size: 64, offset: 512)
!117 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !99, file: !100, line: 54, baseType: !103, size: 64, offset: 576)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "bind_address", scope: !99, file: !100, line: 55, baseType: !103, size: 64, offset: 640)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_count", scope: !99, file: !100, line: 56, baseType: !90, size: 32, offset: 704)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_delay", scope: !99, file: !100, line: 57, baseType: !122, size: 128, offset: 768)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !123, line: 8, size: 128, elements: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!124 = !{!125, !128}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !122, file: !123, line: 10, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !127, line: 148, baseType: !117)
!127 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!128 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !122, file: !123, line: 11, baseType: !129, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !127, line: 150, baseType: !117)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !99, file: !100, line: 61, baseType: !112, size: 8, offset: 896)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "quiet", scope: !99, file: !100, line: 62, baseType: !112, size: 8, offset: 904)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "max_inflight", scope: !99, file: !100, line: 63, baseType: !133, size: 32, offset: 928)
!133 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !99, file: !100, line: 64, baseType: !103, size: 64, offset: 960)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !99, file: !100, line: 65, baseType: !103, size: 64, offset: 1024)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "will_topic", scope: !99, file: !100, line: 66, baseType: !103, size: 64, offset: 1088)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "will_payload", scope: !99, file: !100, line: 67, baseType: !103, size: 64, offset: 1152)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "will_payloadlen", scope: !99, file: !100, line: 68, baseType: !117, size: 64, offset: 1216)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "will_qos", scope: !99, file: !100, line: 69, baseType: !90, size: 32, offset: 1280)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "will_retain", scope: !99, file: !100, line: 70, baseType: !112, size: 8, offset: 1312)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "clean_session", scope: !99, file: !100, line: 88, baseType: !112, size: 8, offset: 1320)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "topics", scope: !99, file: !100, line: 89, baseType: !143, size: 64, offset: 1344)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "topic_count", scope: !99, file: !100, line: 90, baseType: !90, size: 32, offset: 1408)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "exit_after_sub", scope: !99, file: !100, line: 91, baseType: !112, size: 8, offset: 1440)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "no_retain", scope: !99, file: !100, line: 92, baseType: !112, size: 8, offset: 1448)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "retained_only", scope: !99, file: !100, line: 93, baseType: !112, size: 8, offset: 1456)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "remove_retained", scope: !99, file: !100, line: 94, baseType: !112, size: 8, offset: 1464)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "filter_outs", scope: !99, file: !100, line: 95, baseType: !143, size: 64, offset: 1472)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "filter_out_count", scope: !99, file: !100, line: 96, baseType: !90, size: 32, offset: 1536)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "unsub_topics", scope: !99, file: !100, line: 97, baseType: !143, size: 64, offset: 1600)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "unsub_topic_count", scope: !99, file: !100, line: 98, baseType: !90, size: 32, offset: 1664)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "verbose", scope: !99, file: !100, line: 99, baseType: !112, size: 8, offset: 1696)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "eol", scope: !99, file: !100, line: 100, baseType: !112, size: 8, offset: 1704)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "msg_count", scope: !99, file: !100, line: 101, baseType: !90, size: 32, offset: 1728)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !99, file: !100, line: 102, baseType: !103, size: 64, offset: 1792)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !99, file: !100, line: 103, baseType: !90, size: 32, offset: 1856)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "sub_opts", scope: !99, file: !100, line: 104, baseType: !90, size: 32, offset: 1888)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "connect_props", scope: !99, file: !100, line: 111, baseType: !160, size: 64, offset: 1920)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosquitto_property", file: !54, line: 135, baseType: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt5__property", file: !54, line: 135, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "publish_props", scope: !99, file: !100, line: 112, baseType: !160, size: 64, offset: 1984)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "subscribe_props", scope: !99, file: !100, line: 113, baseType: !160, size: 64, offset: 2048)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "unsubscribe_props", scope: !99, file: !100, line: 114, baseType: !160, size: 64, offset: 2112)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "disconnect_props", scope: !99, file: !100, line: 115, baseType: !160, size: 64, offset: 2176)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "will_props", scope: !99, file: !100, line: 116, baseType: !160, size: 64, offset: 2240)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "have_topic_alias", scope: !99, file: !100, line: 117, baseType: !112, size: 8, offset: 2304)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "response_topic", scope: !99, file: !100, line: 118, baseType: !103, size: 64, offset: 2368)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "alphanum", scope: !172, file: !173, line: 33, type: !225, isLocal: true, isDefinition: true)
!172 = distinct !DICompileUnit(language: DW_LANG_C99, file: !173, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174, retainedTypes: !222, globals: !224)
!173 = !DIFile(filename: "connect.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!174 = !{!175, !183, !206, !220}
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosquitto__protocol", file: !176, line: 117, size: 32, elements: !177)
!176 = !DIFile(filename: "./mosquitto_internal.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!177 = !{!178, !179, !180, !181, !182}
!178 = !DIEnumerator(name: "mosq_p_invalid", value: 0)
!179 = !DIEnumerator(name: "mosq_p_mqtt31", value: 1)
!180 = !DIEnumerator(name: "mosq_p_mqtt311", value: 2)
!181 = !DIEnumerator(name: "mosq_p_mqtts", value: 3)
!182 = !DIEnumerator(name: "mosq_p_mqtt5", value: 5)
!183 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosquitto_client_state", file: !176, line: 93, size: 32, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!185 = !DIEnumerator(name: "mosq_cs_new", value: 0)
!186 = !DIEnumerator(name: "mosq_cs_connected", value: 1)
!187 = !DIEnumerator(name: "mosq_cs_disconnecting", value: 2)
!188 = !DIEnumerator(name: "mosq_cs_active", value: 3)
!189 = !DIEnumerator(name: "mosq_cs_connect_pending", value: 4)
!190 = !DIEnumerator(name: "mosq_cs_connect_srv", value: 5)
!191 = !DIEnumerator(name: "mosq_cs_disconnect_ws", value: 6)
!192 = !DIEnumerator(name: "mosq_cs_disconnected", value: 7)
!193 = !DIEnumerator(name: "mosq_cs_socks5_new", value: 8)
!194 = !DIEnumerator(name: "mosq_cs_socks5_start", value: 9)
!195 = !DIEnumerator(name: "mosq_cs_socks5_request", value: 10)
!196 = !DIEnumerator(name: "mosq_cs_socks5_reply", value: 11)
!197 = !DIEnumerator(name: "mosq_cs_socks5_auth_ok", value: 12)
!198 = !DIEnumerator(name: "mosq_cs_socks5_userpass_reply", value: 13)
!199 = !DIEnumerator(name: "mosq_cs_socks5_send_userpass", value: 14)
!200 = !DIEnumerator(name: "mosq_cs_expiring", value: 15)
!201 = !DIEnumerator(name: "mosq_cs_duplicate", value: 17)
!202 = !DIEnumerator(name: "mosq_cs_disconnect_with_will", value: 18)
!203 = !DIEnumerator(name: "mosq_cs_disused", value: 19)
!204 = !DIEnumerator(name: "mosq_cs_authenticating", value: 20)
!205 = !DIEnumerator(name: "mosq_cs_reauthenticating", value: 21)
!206 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosquitto_msg_state", file: !176, line: 78, size: 32, elements: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!208 = !DIEnumerator(name: "mosq_ms_invalid", value: 0)
!209 = !DIEnumerator(name: "mosq_ms_publish_qos0", value: 1)
!210 = !DIEnumerator(name: "mosq_ms_publish_qos1", value: 2)
!211 = !DIEnumerator(name: "mosq_ms_wait_for_puback", value: 3)
!212 = !DIEnumerator(name: "mosq_ms_publish_qos2", value: 4)
!213 = !DIEnumerator(name: "mosq_ms_wait_for_pubrec", value: 5)
!214 = !DIEnumerator(name: "mosq_ms_resend_pubrel", value: 6)
!215 = !DIEnumerator(name: "mosq_ms_wait_for_pubrel", value: 7)
!216 = !DIEnumerator(name: "mosq_ms_resend_pubcomp", value: 8)
!217 = !DIEnumerator(name: "mosq_ms_wait_for_pubcomp", value: 9)
!218 = !DIEnumerator(name: "mosq_ms_send_pubrec", value: 10)
!219 = !DIEnumerator(name: "mosq_ms_queued", value: 11)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosq_err_t", file: !221, line: 69, size: 32, elements: !55)
!221 = !DIFile(filename: "./mosquitto.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!222 = !{!223, !103}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!224 = !{!170}
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 504, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 63)
!228 = distinct !DICompileUnit(language: DW_LANG_C99, file: !229, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !230)
!229 = !DIFile(filename: "sub_client_output.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!230 = !{}
!231 = distinct !DICompileUnit(language: DW_LANG_C99, file: !232, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !233, retainedTypes: !253)
!232 = !DIFile(filename: "client_shared.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!233 = !{!53, !234, !246}
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosq_opt_t", file: !54, line: 104, size: 32, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!236 = !DIEnumerator(name: "MOSQ_OPT_PROTOCOL_VERSION", value: 1)
!237 = !DIEnumerator(name: "MOSQ_OPT_SSL_CTX", value: 2)
!238 = !DIEnumerator(name: "MOSQ_OPT_SSL_CTX_WITH_DEFAULTS", value: 3)
!239 = !DIEnumerator(name: "MOSQ_OPT_RECEIVE_MAXIMUM", value: 4)
!240 = !DIEnumerator(name: "MOSQ_OPT_SEND_MAXIMUM", value: 5)
!241 = !DIEnumerator(name: "MOSQ_OPT_TLS_KEYFORM", value: 6)
!242 = !DIEnumerator(name: "MOSQ_OPT_TLS_ENGINE", value: 7)
!243 = !DIEnumerator(name: "MOSQ_OPT_TLS_ENGINE_KPASS_SHA1", value: 8)
!244 = !DIEnumerator(name: "MOSQ_OPT_TLS_OCSP_REQUIRED", value: 9)
!245 = !DIEnumerator(name: "MOSQ_OPT_TLS_ALPN", value: 10)
!246 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt5_sub_options", file: !6, line: 148, size: 32, elements: !247)
!247 = !{!248, !249, !250, !251, !252}
!248 = !DIEnumerator(name: "MQTT_SUB_OPT_NO_LOCAL", value: 4)
!249 = !DIEnumerator(name: "MQTT_SUB_OPT_RETAIN_AS_PUBLISHED", value: 8)
!250 = !DIEnumerator(name: "MQTT_SUB_OPT_SEND_RETAIN_ALWAYS", value: 0)
!251 = !DIEnumerator(name: "MQTT_SUB_OPT_SEND_RETAIN_NEW", value: 16)
!252 = !DIEnumerator(name: "MQTT_SUB_OPT_SEND_RETAIN_NEVER", value: 32)
!253 = !{!90}
!254 = distinct !DICompileUnit(language: DW_LANG_C99, file: !255, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !256)
!255 = !DIFile(filename: "client_props.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!256 = !{!53, !257}
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt5_property", file: !6, line: 108, size: 32, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!259 = !DIEnumerator(name: "MQTT_PROP_PAYLOAD_FORMAT_INDICATOR", value: 1)
!260 = !DIEnumerator(name: "MQTT_PROP_MESSAGE_EXPIRY_INTERVAL", value: 2)
!261 = !DIEnumerator(name: "MQTT_PROP_CONTENT_TYPE", value: 3)
!262 = !DIEnumerator(name: "MQTT_PROP_RESPONSE_TOPIC", value: 8)
!263 = !DIEnumerator(name: "MQTT_PROP_CORRELATION_DATA", value: 9)
!264 = !DIEnumerator(name: "MQTT_PROP_SUBSCRIPTION_IDENTIFIER", value: 11)
!265 = !DIEnumerator(name: "MQTT_PROP_SESSION_EXPIRY_INTERVAL", value: 17)
!266 = !DIEnumerator(name: "MQTT_PROP_ASSIGNED_CLIENT_IDENTIFIER", value: 18)
!267 = !DIEnumerator(name: "MQTT_PROP_SERVER_KEEP_ALIVE", value: 19)
!268 = !DIEnumerator(name: "MQTT_PROP_AUTHENTICATION_METHOD", value: 21)
!269 = !DIEnumerator(name: "MQTT_PROP_AUTHENTICATION_DATA", value: 22)
!270 = !DIEnumerator(name: "MQTT_PROP_REQUEST_PROBLEM_INFORMATION", value: 23)
!271 = !DIEnumerator(name: "MQTT_PROP_WILL_DELAY_INTERVAL", value: 24)
!272 = !DIEnumerator(name: "MQTT_PROP_REQUEST_RESPONSE_INFORMATION", value: 25)
!273 = !DIEnumerator(name: "MQTT_PROP_RESPONSE_INFORMATION", value: 26)
!274 = !DIEnumerator(name: "MQTT_PROP_SERVER_REFERENCE", value: 28)
!275 = !DIEnumerator(name: "MQTT_PROP_REASON_STRING", value: 31)
!276 = !DIEnumerator(name: "MQTT_PROP_RECEIVE_MAXIMUM", value: 33)
!277 = !DIEnumerator(name: "MQTT_PROP_TOPIC_ALIAS_MAXIMUM", value: 34)
!278 = !DIEnumerator(name: "MQTT_PROP_TOPIC_ALIAS", value: 35)
!279 = !DIEnumerator(name: "MQTT_PROP_MAXIMUM_QOS", value: 36)
!280 = !DIEnumerator(name: "MQTT_PROP_RETAIN_AVAILABLE", value: 37)
!281 = !DIEnumerator(name: "MQTT_PROP_USER_PROPERTY", value: 38)
!282 = !DIEnumerator(name: "MQTT_PROP_MAXIMUM_PACKET_SIZE", value: 39)
!283 = !DIEnumerator(name: "MQTT_PROP_WILDCARD_SUB_AVAILABLE", value: 40)
!284 = !DIEnumerator(name: "MQTT_PROP_SUBSCRIPTION_ID_AVAILABLE", value: 41)
!285 = !DIEnumerator(name: "MQTT_PROP_SHARED_SUB_AVAILABLE", value: 42)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !288, retainedTypes: !294)
!287 = !DIFile(filename: "mosquitto.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!288 = !{!220, !175, !183, !206, !289}
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosquitto__threaded_state", file: !176, line: 125, size: 32, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "mosq_ts_none", value: 0)
!292 = !DIEnumerator(name: "mosq_ts_self", value: 1)
!293 = !DIEnumerator(name: "mosq_ts_external", value: 2)
!294 = !{!223, !295, !300}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !296, line: 72, baseType: !297)
!296 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !90}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto", file: !176, line: 207, size: 3456, elements: !302)
!302 = !{!303, !305, !306, !307, !308, !309, !310, !311, !312, !318, !319, !320, !324, !325, !326, !350, !351, !352, !375, !381, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !406, !407, !411, !415, !421, !422, !426, !427, !428, !434, !438, !444, !448, !449, !450, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !301, file: !176, line: 208, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosq_sock_t", file: !176, line: 70, baseType: !90)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "sockpairR", scope: !301, file: !176, line: 210, baseType: !304, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sockpairW", scope: !301, file: !176, line: 210, baseType: !304, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !301, file: !176, line: 215, baseType: !175, size: 32, offset: 96)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !301, file: !176, line: 216, baseType: !103, size: 64, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !301, file: !176, line: 217, baseType: !103, size: 64, offset: 192)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "username", scope: !301, file: !176, line: 218, baseType: !103, size: 64, offset: 256)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "password", scope: !301, file: !176, line: 219, baseType: !103, size: 64, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "keepalive", scope: !301, file: !176, line: 220, baseType: !313, size: 16, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !314, line: 25, baseType: !315)
!314 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !316, line: 39, baseType: !317)
!316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!317 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "last_mid", scope: !301, file: !176, line: 221, baseType: !313, size: 16, offset: 400)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !301, file: !176, line: 222, baseType: !183, size: 32, offset: 416)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "last_msg_in", scope: !301, file: !176, line: 223, baseType: !321, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !322, line: 7, baseType: !323)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !316, line: 148, baseType: !117)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next_msg_out", scope: !301, file: !176, line: 224, baseType: !321, size: 64, offset: 512)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ping_t", scope: !301, file: !176, line: 225, baseType: !321, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "in_packet", scope: !301, file: !176, line: 226, baseType: !327, size: 320, offset: 640)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__packet", file: !176, line: 150, size: 320, elements: !328)
!328 = !{!329, !334, !336, !339, !340, !341, !342, !343, !344, !345}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !327, file: !176, line: 151, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !314, line: 24, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !316, line: 37, baseType: !333)
!333 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !176, line: 152, baseType: !335, size: 64, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_mult", scope: !327, file: !176, line: 153, baseType: !337, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !314, line: 26, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !316, line: 41, baseType: !133)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_length", scope: !327, file: !176, line: 154, baseType: !337, size: 32, offset: 160)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "packet_length", scope: !327, file: !176, line: 155, baseType: !337, size: 32, offset: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "to_process", scope: !327, file: !176, line: 156, baseType: !337, size: 32, offset: 224)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !327, file: !176, line: 157, baseType: !337, size: 32, offset: 256)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !327, file: !176, line: 158, baseType: !313, size: 16, offset: 288)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !327, file: !176, line: 159, baseType: !331, size: 8, offset: 304)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_count", scope: !327, file: !176, line: 160, baseType: !346, size: 8, offset: 312)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !347, line: 24, baseType: !348)
!347 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !316, line: 36, baseType: !349)
!349 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "current_out_packet", scope: !301, file: !176, line: 227, baseType: !335, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "out_packet", scope: !301, file: !176, line: 228, baseType: !335, size: 64, offset: 1024)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "will", scope: !301, file: !176, line: 229, baseType: !353, size: 64, offset: 1088)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 64)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message_all", file: !176, line: 163, size: 704, elements: !355)
!355 = !{!356, !357, !358, !362, !363, !364, !365, !374}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !354, file: !176, line: 164, baseType: !353, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !354, file: !176, line: 165, baseType: !353, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !354, file: !176, line: 166, baseType: !359, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "mosquitto_property", file: !221, line: 135, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt5__property", file: !221, line: 135, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !354, file: !176, line: 167, baseType: !321, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !354, file: !176, line: 169, baseType: !206, size: 32, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "dup", scope: !354, file: !176, line: 170, baseType: !112, size: 8, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !354, file: !176, line: 171, baseType: !366, size: 320, offset: 320)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message", file: !221, line: 125, size: 320, elements: !367)
!367 = !{!368, !369, !370, !371, !372, !373}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !366, file: !221, line: 126, baseType: !90, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !366, file: !221, line: 127, baseType: !103, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !366, file: !221, line: 128, baseType: !223, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !366, file: !221, line: 129, baseType: !90, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !366, file: !221, line: 130, baseType: !90, size: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !366, file: !221, line: 131, baseType: !112, size: 8, offset: 256)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_interval", scope: !354, file: !176, line: 172, baseType: !337, size: 32, offset: 640)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !301, file: !176, line: 230, baseType: !376, size: 64, offset: 1152)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto__alias", file: !176, line: 139, size: 128, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !377, file: !176, line: 140, baseType: !103, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !377, file: !176, line: 141, baseType: !313, size: 16, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_entry", scope: !301, file: !176, line: 231, baseType: !382, size: 64, offset: 1216)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "will_delay_list", file: !176, line: 182, size: 192, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !383, file: !176, line: 183, baseType: !300, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !176, line: 184, baseType: !382, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !176, line: 185, baseType: !382, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_packet_size", scope: !301, file: !176, line: 232, baseType: !337, size: 32, offset: 1280)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "alias_count", scope: !301, file: !176, line: 233, baseType: !90, size: 32, offset: 1312)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_interval", scope: !301, file: !176, line: 234, baseType: !337, size: 32, offset: 1344)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "will_delay_time", scope: !301, file: !176, line: 235, baseType: !321, size: 64, offset: 1408)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "want_write", scope: !301, file: !176, line: 257, baseType: !112, size: 8, offset: 1472)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "want_connect", scope: !301, file: !176, line: 258, baseType: !112, size: 8, offset: 1480)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "clean_start", scope: !301, file: !176, line: 269, baseType: !112, size: 8, offset: 1488)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "session_expiry_interval", scope: !301, file: !176, line: 270, baseType: !337, size: 32, offset: 1504)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "session_expiry_time", scope: !301, file: !176, line: 271, baseType: !321, size: 64, offset: 1536)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !301, file: !176, line: 305, baseType: !223, size: 64, offset: 1600)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "in_callback", scope: !301, file: !176, line: 306, baseType: !112, size: 8, offset: 1664)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "msgs_in", scope: !301, file: !176, line: 307, baseType: !400, size: 192, offset: 1728)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_msg_data", file: !176, line: 188, size: 192, elements: !401)
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "inflight", scope: !400, file: !176, line: 197, baseType: !353, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "queue_len", scope: !400, file: !176, line: 198, baseType: !90, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "inflight_quota", scope: !400, file: !176, line: 203, baseType: !90, size: 32, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "inflight_maximum", scope: !400, file: !176, line: 204, baseType: !313, size: 16, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "msgs_out", scope: !301, file: !176, line: 308, baseType: !400, size: 192, offset: 1920)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "on_connect", scope: !301, file: !176, line: 309, baseType: !408, size: 64, offset: 2112)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !300, !223, !90}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "on_connect_with_flags", scope: !301, file: !176, line: 310, baseType: !412, size: 64, offset: 2176)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !300, !223, !90, !90}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "on_connect_v5", scope: !301, file: !176, line: 311, baseType: !416, size: 64, offset: 2240)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !300, !223, !90, !90, !419}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "on_disconnect", scope: !301, file: !176, line: 312, baseType: !408, size: 64, offset: 2304)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "on_disconnect_v5", scope: !301, file: !176, line: 313, baseType: !423, size: 64, offset: 2368)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !300, !223, !90, !419}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "on_publish", scope: !301, file: !176, line: 314, baseType: !408, size: 64, offset: 2432)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "on_publish_v5", scope: !301, file: !176, line: 315, baseType: !416, size: 64, offset: 2496)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "on_message", scope: !301, file: !176, line: 316, baseType: !429, size: 64, offset: 2560)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !300, !223, !432}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "on_message_v5", scope: !301, file: !176, line: 317, baseType: !435, size: 64, offset: 2624)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !300, !223, !432, !419}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "on_subscribe", scope: !301, file: !176, line: 318, baseType: !439, size: 64, offset: 2688)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !300, !223, !90, !90, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !90)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "on_subscribe_v5", scope: !301, file: !176, line: 319, baseType: !445, size: 64, offset: 2752)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !300, !223, !90, !90, !442, !419}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "on_unsubscribe", scope: !301, file: !176, line: 320, baseType: !408, size: 64, offset: 2816)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "on_unsubscribe_v5", scope: !301, file: !176, line: 321, baseType: !423, size: 64, offset: 2880)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "on_log", scope: !301, file: !176, line: 322, baseType: !451, size: 64, offset: 2944)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !300, !223, !90, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !301, file: !176, line: 324, baseType: !103, size: 64, offset: 3008)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !301, file: !176, line: 325, baseType: !90, size: 32, offset: 3072)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bind_address", scope: !301, file: !176, line: 326, baseType: !103, size: 64, offset: 3136)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "reconnects", scope: !301, file: !176, line: 327, baseType: !133, size: 32, offset: 3200)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_delay", scope: !301, file: !176, line: 328, baseType: !133, size: 32, offset: 3232)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_delay_max", scope: !301, file: !176, line: 329, baseType: !133, size: 32, offset: 3264)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_exponential_backoff", scope: !301, file: !176, line: 330, baseType: !112, size: 8, offset: 3296)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "threaded", scope: !301, file: !176, line: 331, baseType: !104, size: 8, offset: 3304)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "out_packet_last", scope: !301, file: !176, line: 332, baseType: !335, size: 64, offset: 3328)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_qos", scope: !301, file: !176, line: 337, baseType: !331, size: 8, offset: 3392)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !301, file: !176, line: 348, baseType: !90, size: 32, offset: 3424)
!467 = distinct !DICompileUnit(language: DW_LANG_C99, file: !468, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !469, retainedTypes: !476)
!468 = !DIFile(filename: "actions.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!469 = !{!175, !183, !206, !220, !470, !472}
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt5_property", file: !471, line: 108, size: 32, elements: !258)
!471 = !DIFile(filename: "./mqtt_protocol.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosquitto_msg_direction", file: !176, line: 73, size: 32, elements: !473)
!473 = !{!474, !475}
!474 = !DIEnumerator(name: "mosq_md_in", value: 0)
!475 = !DIEnumerator(name: "mosq_md_out", value: 1)
!476 = !{!223, !477}
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!479 = distinct !DICompileUnit(language: DW_LANG_C99, file: !480, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !481)
!480 = !DIFile(filename: "callbacks.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!481 = !{!175, !183, !206}
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!483 = !DIFile(filename: "handle_auth.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !486)
!485 = !DIFile(filename: "handle_connack.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!486 = !{!175, !183, !206, !220, !487, !495, !470}
!487 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt311_connack_codes", file: !471, line: 49, size: 32, elements: !488)
!488 = !{!489, !490, !491, !492, !493, !494}
!489 = !DIEnumerator(name: "CONNACK_ACCEPTED", value: 0)
!490 = !DIEnumerator(name: "CONNACK_REFUSED_PROTOCOL_VERSION", value: 1)
!491 = !DIEnumerator(name: "CONNACK_REFUSED_IDENTIFIER_REJECTED", value: 2)
!492 = !DIEnumerator(name: "CONNACK_REFUSED_SERVER_UNAVAILABLE", value: 3)
!493 = !DIEnumerator(name: "CONNACK_REFUSED_BAD_USERNAME_PASSWORD", value: 4)
!494 = !DIEnumerator(name: "CONNACK_REFUSED_NOT_AUTHORIZED", value: 5)
!495 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt5_return_codes", file: !471, line: 59, size: 32, elements: !7)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!497 = !DIFile(filename: "handle_disconnect.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!498 = distinct !DICompileUnit(language: DW_LANG_C99, file: !499, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!499 = !DIFile(filename: "handle_ping.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !502)
!501 = !DIFile(filename: "handle_pubackcomp.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!502 = !{!175, !183, !206, !220, !472}
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !502, retainedTypes: !505)
!504 = !DIFile(filename: "handle_publish.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!505 = !{!90, !117}
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !502)
!507 = !DIFile(filename: "handle_pubrec.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !502)
!509 = !DIFile(filename: "handle_pubrel.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174, retainedTypes: !253)
!511 = !DIFile(filename: "handle_suback.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!512 = distinct !DICompileUnit(language: DW_LANG_C99, file: !513, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!513 = !DIFile(filename: "handle_unsuback.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !516)
!515 = !DIFile(filename: "helpers.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!516 = !{!220, !175, !183, !206}
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!518 = !DIFile(filename: "logging_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174, retainedTypes: !521)
!520 = !DIFile(filename: "loop.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!521 = !{!522, !90}
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !523, line: 49, baseType: !117)
!523 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/select.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!524 = distinct !DICompileUnit(language: DW_LANG_C99, file: !525, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !230)
!525 = !DIFile(filename: "memory_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !528, retainedTypes: !530)
!527 = !DIFile(filename: "messages_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!528 = !{!206, !175, !183, !220, !472, !529}
!529 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mosq_opt_t", file: !221, line: 104, size: 32, elements: !235)
!530 = !{!223}
!531 = distinct !DICompileUnit(language: DW_LANG_C99, file: !532, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !230)
!532 = !DIFile(filename: "net_mosq_ocsp.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !535, retainedTypes: !548)
!534 = !DIFile(filename: "net_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!535 = !{!220, !175, !183, !206, !536}
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !537, line: 24, size: 32, elements: !538)
!537 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547}
!539 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!540 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!541 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!542 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!543 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!544 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!545 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!546 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!547 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!548 = !{!223, !549, !567}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !551, line: 237, size: 128, elements: !552)
!551 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!552 = !{!553, !556, !558, !563}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !550, file: !551, line: 239, baseType: !554, size: 16)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !555, line: 28, baseType: !317)
!555 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!556 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !550, file: !551, line: 240, baseType: !557, size: 16, offset: 16)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !551, line: 119, baseType: !313)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !550, file: !551, line: 241, baseType: !559, size: 32, offset: 32)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !551, line: 31, size: 32, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !559, file: !551, line: 33, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !551, line: 30, baseType: !337)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !550, file: !551, line: 244, baseType: !564, size: 64, offset: 64)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 64, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 8)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !551, line: 252, size: 224, elements: !569)
!569 = !{!570, !571, !572, !573, !589}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !568, file: !551, line: 254, baseType: !554, size: 16)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !568, file: !551, line: 255, baseType: !557, size: 16, offset: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !568, file: !551, line: 256, baseType: !337, size: 32, offset: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !568, file: !551, line: 257, baseType: !574, size: 128, offset: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !551, line: 211, size: 128, elements: !575)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !574, file: !551, line: 218, baseType: !577, size: 128)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !574, file: !551, line: 213, size: 128, elements: !578)
!578 = !{!579, !583, !585}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !577, file: !551, line: 215, baseType: !580, size: 128)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 128, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 16)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr16", scope: !577, file: !551, line: 216, baseType: !584, size: 128)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, size: 128, elements: !565)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr32", scope: !577, file: !551, line: 217, baseType: !586, size: 128)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 128, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 4)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !568, file: !551, line: 258, baseType: !337, size: 32, offset: 192)
!590 = distinct !DICompileUnit(language: DW_LANG_C99, file: !591, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !592, retainedTypes: !593)
!591 = !DIFile(filename: "options.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!592 = !{!175, !183, !206, !220, !529}
!593 = !{!223, !594}
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !597, retainedTypes: !598)
!596 = !DIFile(filename: "packet_datatypes.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!597 = !{!220}
!598 = !{!330, !599, !331}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!600 = distinct !DICompileUnit(language: DW_LANG_C99, file: !601, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !288)
!601 = !DIFile(filename: "packet_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !604, retainedTypes: !614)
!603 = !DIFile(filename: "property_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!604 = !{!220, !470, !605}
!605 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mqtt5_property_type", file: !471, line: 138, size: 32, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613}
!607 = !DIEnumerator(name: "MQTT_PROP_TYPE_BYTE", value: 1)
!608 = !DIEnumerator(name: "MQTT_PROP_TYPE_INT16", value: 2)
!609 = !DIEnumerator(name: "MQTT_PROP_TYPE_INT32", value: 3)
!610 = !DIEnumerator(name: "MQTT_PROP_TYPE_VARINT", value: 4)
!611 = !DIEnumerator(name: "MQTT_PROP_TYPE_BINARY", value: 5)
!612 = !DIEnumerator(name: "MQTT_PROP_TYPE_STRING", value: 6)
!613 = !DIEnumerator(name: "MQTT_PROP_TYPE_STRING_PAIR", value: 7)
!614 = !{!599}
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!616 = !DIFile(filename: "read_handle.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !619, retainedTypes: !620)
!618 = !DIFile(filename: "send_connect.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!619 = !{!175, !183, !206, !220, !470}
!620 = !{!223, !454}
!621 = distinct !DICompileUnit(language: DW_LANG_C99, file: !622, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!622 = !DIFile(filename: "send_disconnect.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!623 = distinct !DICompileUnit(language: DW_LANG_C99, file: !624, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!624 = !DIFile(filename: "send_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!625 = distinct !DICompileUnit(language: DW_LANG_C99, file: !626, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !619, retainedTypes: !627)
!626 = !DIFile(filename: "send_publish.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!627 = !{!117}
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174, retainedTypes: !253)
!629 = !DIFile(filename: "send_subscribe.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!630 = distinct !DICompileUnit(language: DW_LANG_C99, file: !631, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174, retainedTypes: !253)
!631 = !DIFile(filename: "send_unsubscribe.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!632 = distinct !DICompileUnit(language: DW_LANG_C99, file: !633, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!633 = !DIFile(filename: "socks_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!635 = !DIFile(filename: "srv_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!636 = distinct !DICompileUnit(language: DW_LANG_C99, file: !637, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !638)
!637 = !DIFile(filename: "thread_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!638 = !{!175, !183, !206, !220, !289}
!639 = distinct !DICompileUnit(language: DW_LANG_C99, file: !640, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !230)
!640 = !DIFile(filename: "time_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !230)
!642 = !DIFile(filename: "tls_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!643 = distinct !DICompileUnit(language: DW_LANG_C99, file: !644, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !597, retainedTypes: !645)
!644 = !DIFile(filename: "utf8_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!648 = distinct !DICompileUnit(language: DW_LANG_C99, file: !649, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174)
!649 = !DIFile(filename: "util_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !597)
!651 = !DIFile(filename: "util_topic.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !174, retainedTypes: !530)
!653 = !DIFile(filename: "will_mosq.c", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/lib")
!654 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!655 = !{i32 2, !"Dwarf Version", i32 4}
!656 = !{i32 2, !"Debug Info Version", i32 3}
!657 = !{i32 1, !"wchar_size", i32 4}
!658 = !{i32 7, !"PIC Level", i32 2}
!659 = distinct !DISubprogram(name: "my_signal_handler", scope: !3, file: !3, line: 45, type: !298, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !230)
!660 = !DILocalVariable(name: "signum", arg: 1, scope: !659, file: !3, line: 45, type: !90)
!661 = !DILocation(line: 45, column: 28, scope: !659)
!662 = !DILocation(line: 47, column: 5, scope: !663)
!663 = distinct !DILexicalBlock(scope: !659, file: !3, line: 47, column: 5)
!664 = !DILocation(line: 47, column: 12, scope: !663)
!665 = !DILocation(line: 47, column: 5, scope: !659)
!666 = !DILocation(line: 48, column: 20, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !3, line: 47, column: 23)
!668 = !DILocation(line: 49, column: 27, scope: !667)
!669 = !DILocation(line: 49, column: 71, scope: !667)
!670 = !DILocation(line: 49, column: 3, scope: !667)
!671 = !DILocation(line: 50, column: 2, scope: !667)
!672 = !DILocation(line: 51, column: 1, scope: !659)
!673 = distinct !DISubprogram(name: "my_publish_callback", scope: !3, file: !3, line: 57, type: !674, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !230)
!674 = !DISubroutineType(types: !675)
!675 = !{null, !93, !223, !90, !90, !676}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!678 = !DILocalVariable(name: "mosq", arg: 1, scope: !673, file: !3, line: 57, type: !93)
!679 = !DILocation(line: 57, column: 44, scope: !673)
!680 = !DILocalVariable(name: "obj", arg: 2, scope: !673, file: !3, line: 57, type: !223)
!681 = !DILocation(line: 57, column: 56, scope: !673)
!682 = !DILocalVariable(name: "mid", arg: 3, scope: !673, file: !3, line: 57, type: !90)
!683 = !DILocation(line: 57, column: 65, scope: !673)
!684 = !DILocalVariable(name: "reason_code", arg: 4, scope: !673, file: !3, line: 57, type: !90)
!685 = !DILocation(line: 57, column: 74, scope: !673)
!686 = !DILocalVariable(name: "properties", arg: 5, scope: !673, file: !3, line: 57, type: !676)
!687 = !DILocation(line: 57, column: 113, scope: !673)
!688 = !DILocation(line: 59, column: 2, scope: !673)
!689 = !DILocation(line: 60, column: 2, scope: !673)
!690 = !DILocation(line: 61, column: 2, scope: !673)
!691 = !DILocation(line: 63, column: 5, scope: !692)
!692 = distinct !DILexicalBlock(scope: !673, file: !3, line: 63, column: 5)
!693 = !DILocation(line: 63, column: 22, scope: !692)
!694 = !DILocation(line: 63, column: 31, scope: !692)
!695 = !DILocation(line: 63, column: 35, scope: !692)
!696 = !DILocation(line: 63, column: 42, scope: !692)
!697 = !DILocation(line: 63, column: 39, scope: !692)
!698 = !DILocation(line: 63, column: 51, scope: !692)
!699 = !DILocation(line: 63, column: 54, scope: !692)
!700 = !DILocation(line: 63, column: 63, scope: !692)
!701 = !DILocation(line: 63, column: 5, scope: !673)
!702 = !DILocation(line: 64, column: 27, scope: !703)
!703 = distinct !DILexicalBlock(scope: !692, file: !3, line: 63, column: 69)
!704 = !DILocation(line: 64, column: 40, scope: !703)
!705 = !DILocation(line: 64, column: 3, scope: !703)
!706 = !DILocation(line: 65, column: 2, scope: !703)
!707 = !DILocation(line: 66, column: 1, scope: !673)
!708 = distinct !DISubprogram(name: "my_message_callback", scope: !3, file: !3, line: 69, type: !709, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !230)
!709 = !DISubroutineType(types: !710)
!710 = !{null, !93, !223, !711, !676}
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mosquitto_message", file: !54, line: 125, size: 320, elements: !714)
!714 = !{!715, !716, !717, !718, !719, !720}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "mid", scope: !713, file: !54, line: 126, baseType: !90, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "topic", scope: !713, file: !54, line: 127, baseType: !103, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "payload", scope: !713, file: !54, line: 128, baseType: !223, size: 64, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "payloadlen", scope: !713, file: !54, line: 129, baseType: !90, size: 32, offset: 192)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "qos", scope: !713, file: !54, line: 130, baseType: !90, size: 32, offset: 224)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "retain", scope: !713, file: !54, line: 131, baseType: !112, size: 8, offset: 256)
!721 = !DILocalVariable(name: "mosq", arg: 1, scope: !708, file: !3, line: 69, type: !93)
!722 = !DILocation(line: 69, column: 44, scope: !708)
!723 = !DILocalVariable(name: "obj", arg: 2, scope: !708, file: !3, line: 69, type: !223)
!724 = !DILocation(line: 69, column: 56, scope: !708)
!725 = !DILocalVariable(name: "message", arg: 3, scope: !708, file: !3, line: 69, type: !711)
!726 = !DILocation(line: 69, column: 93, scope: !708)
!727 = !DILocalVariable(name: "properties", arg: 4, scope: !708, file: !3, line: 69, type: !676)
!728 = !DILocation(line: 69, column: 128, scope: !708)
!729 = !DILocalVariable(name: "i", scope: !708, file: !3, line: 71, type: !90)
!730 = !DILocation(line: 71, column: 6, scope: !708)
!731 = !DILocalVariable(name: "res", scope: !708, file: !3, line: 72, type: !112)
!732 = !DILocation(line: 72, column: 7, scope: !708)
!733 = !DILocation(line: 74, column: 2, scope: !708)
!734 = !DILocation(line: 75, column: 2, scope: !708)
!735 = !DILocation(line: 77, column: 5, scope: !736)
!736 = distinct !DILexicalBlock(scope: !708, file: !3, line: 77, column: 5)
!737 = !DILocation(line: 77, column: 22, scope: !736)
!738 = !DILocation(line: 77, column: 5, scope: !708)
!739 = !DILocation(line: 77, column: 32, scope: !736)
!740 = !DILocation(line: 79, column: 9, scope: !741)
!741 = distinct !DILexicalBlock(scope: !708, file: !3, line: 79, column: 5)
!742 = !DILocation(line: 79, column: 25, scope: !741)
!743 = !DILocation(line: 79, column: 28, scope: !741)
!744 = !DILocation(line: 79, column: 37, scope: !741)
!745 = !DILocation(line: 79, column: 5, scope: !708)
!746 = !DILocation(line: 80, column: 21, scope: !747)
!747 = distinct !DILexicalBlock(scope: !741, file: !3, line: 79, column: 44)
!748 = !DILocation(line: 80, column: 38, scope: !747)
!749 = !DILocation(line: 80, column: 47, scope: !747)
!750 = !DILocation(line: 80, column: 3, scope: !747)
!751 = !DILocation(line: 81, column: 2, scope: !747)
!752 = !DILocation(line: 83, column: 9, scope: !753)
!753 = distinct !DILexicalBlock(scope: !708, file: !3, line: 83, column: 5)
!754 = !DILocation(line: 83, column: 23, scope: !753)
!755 = !DILocation(line: 83, column: 27, scope: !753)
!756 = !DILocation(line: 83, column: 36, scope: !753)
!757 = !DILocation(line: 83, column: 43, scope: !753)
!758 = !DILocation(line: 83, column: 46, scope: !753)
!759 = !DILocation(line: 83, column: 5, scope: !708)
!760 = !DILocation(line: 84, column: 20, scope: !761)
!761 = distinct !DILexicalBlock(scope: !753, file: !3, line: 83, column: 63)
!762 = !DILocation(line: 85, column: 6, scope: !763)
!763 = distinct !DILexicalBlock(scope: !761, file: !3, line: 85, column: 6)
!764 = !DILocation(line: 85, column: 15, scope: !763)
!765 = !DILocation(line: 85, column: 6, scope: !761)
!766 = !DILocation(line: 86, column: 28, scope: !767)
!767 = distinct !DILexicalBlock(scope: !763, file: !3, line: 85, column: 20)
!768 = !DILocation(line: 86, column: 41, scope: !767)
!769 = !DILocation(line: 86, column: 4, scope: !767)
!770 = !DILocation(line: 87, column: 3, scope: !767)
!771 = !DILocation(line: 88, column: 3, scope: !761)
!772 = !DILocation(line: 91, column: 5, scope: !773)
!773 = distinct !DILexicalBlock(scope: !708, file: !3, line: 91, column: 5)
!774 = !DILocation(line: 91, column: 14, scope: !773)
!775 = !DILocation(line: 91, column: 21, scope: !773)
!776 = !DILocation(line: 91, column: 28, scope: !773)
!777 = !DILocation(line: 91, column: 5, scope: !708)
!778 = !DILocation(line: 91, column: 39, scope: !773)
!779 = !DILocation(line: 92, column: 9, scope: !780)
!780 = distinct !DILexicalBlock(scope: !708, file: !3, line: 92, column: 5)
!781 = !DILocation(line: 92, column: 5, scope: !780)
!782 = !DILocation(line: 92, column: 5, scope: !708)
!783 = !DILocation(line: 93, column: 8, scope: !784)
!784 = distinct !DILexicalBlock(scope: !785, file: !3, line: 93, column: 3)
!785 = distinct !DILexicalBlock(scope: !780, file: !3, line: 92, column: 21)
!786 = !DILocation(line: 93, column: 7, scope: !784)
!787 = !DILocation(line: 93, column: 12, scope: !788)
!788 = distinct !DILexicalBlock(scope: !784, file: !3, line: 93, column: 3)
!789 = !DILocation(line: 93, column: 18, scope: !788)
!790 = !DILocation(line: 93, column: 13, scope: !788)
!791 = !DILocation(line: 93, column: 3, scope: !784)
!792 = !DILocation(line: 94, column: 36, scope: !793)
!793 = distinct !DILexicalBlock(scope: !788, file: !3, line: 93, column: 40)
!794 = !DILocation(line: 94, column: 48, scope: !793)
!795 = !DILocation(line: 94, column: 32, scope: !793)
!796 = !DILocation(line: 94, column: 52, scope: !793)
!797 = !DILocation(line: 94, column: 61, scope: !793)
!798 = !DILocation(line: 94, column: 4, scope: !793)
!799 = !DILocation(line: 95, column: 7, scope: !800)
!800 = distinct !DILexicalBlock(scope: !793, file: !3, line: 95, column: 7)
!801 = !DILocation(line: 95, column: 7, scope: !793)
!802 = !DILocation(line: 95, column: 12, scope: !800)
!803 = !DILocation(line: 96, column: 3, scope: !793)
!804 = !DILocation(line: 93, column: 37, scope: !788)
!805 = !DILocation(line: 93, column: 3, scope: !788)
!806 = distinct !{!806, !791, !807}
!807 = !DILocation(line: 96, column: 3, scope: !784)
!808 = !DILocation(line: 97, column: 2, scope: !785)
!809 = !DILocation(line: 99, column: 22, scope: !708)
!810 = !DILocation(line: 99, column: 2, scope: !708)
!811 = !DILocation(line: 101, column: 9, scope: !812)
!812 = distinct !DILexicalBlock(scope: !708, file: !3, line: 101, column: 5)
!813 = !DILocation(line: 101, column: 18, scope: !812)
!814 = !DILocation(line: 101, column: 5, scope: !708)
!815 = !DILocation(line: 102, column: 12, scope: !816)
!816 = distinct !DILexicalBlock(scope: !812, file: !3, line: 101, column: 21)
!817 = !DILocation(line: 103, column: 10, scope: !818)
!818 = distinct !DILexicalBlock(scope: !816, file: !3, line: 103, column: 6)
!819 = !DILocation(line: 103, column: 23, scope: !818)
!820 = !DILocation(line: 103, column: 20, scope: !818)
!821 = !DILocation(line: 103, column: 6, scope: !816)
!822 = !DILocation(line: 104, column: 21, scope: !823)
!823 = distinct !DILexicalBlock(scope: !818, file: !3, line: 103, column: 33)
!824 = !DILocation(line: 105, column: 7, scope: !825)
!825 = distinct !DILexicalBlock(scope: !823, file: !3, line: 105, column: 7)
!826 = !DILocation(line: 105, column: 16, scope: !825)
!827 = !DILocation(line: 105, column: 7, scope: !823)
!828 = !DILocation(line: 106, column: 29, scope: !829)
!829 = distinct !DILexicalBlock(scope: !825, file: !3, line: 105, column: 21)
!830 = !DILocation(line: 106, column: 42, scope: !829)
!831 = !DILocation(line: 106, column: 5, scope: !829)
!832 = !DILocation(line: 107, column: 4, scope: !829)
!833 = !DILocation(line: 108, column: 3, scope: !823)
!834 = !DILocation(line: 109, column: 2, scope: !816)
!835 = !DILocation(line: 110, column: 1, scope: !708)
!836 = distinct !DISubprogram(name: "my_connect_callback", scope: !3, file: !3, line: 112, type: !674, scopeLine: 113, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !230)
!837 = !DILocalVariable(name: "mosq", arg: 1, scope: !836, file: !3, line: 112, type: !93)
!838 = !DILocation(line: 112, column: 44, scope: !836)
!839 = !DILocalVariable(name: "obj", arg: 2, scope: !836, file: !3, line: 112, type: !223)
!840 = !DILocation(line: 112, column: 56, scope: !836)
!841 = !DILocalVariable(name: "result", arg: 3, scope: !836, file: !3, line: 112, type: !90)
!842 = !DILocation(line: 112, column: 65, scope: !836)
!843 = !DILocalVariable(name: "flags", arg: 4, scope: !836, file: !3, line: 112, type: !90)
!844 = !DILocation(line: 112, column: 77, scope: !836)
!845 = !DILocalVariable(name: "properties", arg: 5, scope: !836, file: !3, line: 112, type: !676)
!846 = !DILocation(line: 112, column: 110, scope: !836)
!847 = !DILocalVariable(name: "i", scope: !836, file: !3, line: 114, type: !90)
!848 = !DILocation(line: 114, column: 6, scope: !836)
!849 = !DILocation(line: 116, column: 2, scope: !836)
!850 = !DILocation(line: 117, column: 2, scope: !836)
!851 = !DILocation(line: 118, column: 2, scope: !836)
!852 = !DILocation(line: 120, column: 6, scope: !853)
!853 = distinct !DILexicalBlock(scope: !836, file: !3, line: 120, column: 5)
!854 = !DILocation(line: 120, column: 5, scope: !836)
!855 = !DILocation(line: 121, column: 32, scope: !856)
!856 = distinct !DILexicalBlock(scope: !853, file: !3, line: 120, column: 13)
!857 = !DILocation(line: 121, column: 48, scope: !856)
!858 = !DILocation(line: 121, column: 65, scope: !856)
!859 = !DILocation(line: 121, column: 77, scope: !856)
!860 = !DILocation(line: 121, column: 86, scope: !856)
!861 = !DILocation(line: 121, column: 100, scope: !856)
!862 = !DILocation(line: 121, column: 3, scope: !856)
!863 = !DILocation(line: 123, column: 8, scope: !864)
!864 = distinct !DILexicalBlock(scope: !856, file: !3, line: 123, column: 3)
!865 = !DILocation(line: 123, column: 7, scope: !864)
!866 = !DILocation(line: 123, column: 12, scope: !867)
!867 = distinct !DILexicalBlock(scope: !864, file: !3, line: 123, column: 3)
!868 = !DILocation(line: 123, column: 18, scope: !867)
!869 = !DILocation(line: 123, column: 13, scope: !867)
!870 = !DILocation(line: 123, column: 3, scope: !864)
!871 = !DILocation(line: 124, column: 29, scope: !872)
!872 = distinct !DILexicalBlock(scope: !867, file: !3, line: 123, column: 41)
!873 = !DILocation(line: 124, column: 45, scope: !872)
!874 = !DILocation(line: 124, column: 58, scope: !872)
!875 = !DILocation(line: 124, column: 41, scope: !872)
!876 = !DILocation(line: 124, column: 66, scope: !872)
!877 = !DILocation(line: 124, column: 4, scope: !872)
!878 = !DILocation(line: 125, column: 3, scope: !872)
!879 = !DILocation(line: 123, column: 38, scope: !867)
!880 = !DILocation(line: 123, column: 3, scope: !867)
!881 = distinct !{!881, !870, !882}
!882 = !DILocation(line: 125, column: 3, scope: !864)
!883 = !DILocation(line: 126, column: 2, scope: !856)
!884 = !DILocation(line: 127, column: 6, scope: !885)
!885 = distinct !DILexicalBlock(scope: !886, file: !3, line: 127, column: 6)
!886 = distinct !DILexicalBlock(scope: !853, file: !3, line: 126, column: 7)
!887 = !DILocation(line: 127, column: 6, scope: !886)
!888 = !DILocation(line: 128, column: 11, scope: !889)
!889 = distinct !DILexicalBlock(scope: !890, file: !3, line: 128, column: 7)
!890 = distinct !DILexicalBlock(scope: !885, file: !3, line: 127, column: 13)
!891 = !DILocation(line: 128, column: 28, scope: !889)
!892 = !DILocation(line: 128, column: 7, scope: !890)
!893 = !DILocation(line: 129, column: 8, scope: !894)
!894 = distinct !DILexicalBlock(scope: !895, file: !3, line: 129, column: 8)
!895 = distinct !DILexicalBlock(scope: !889, file: !3, line: 128, column: 48)
!896 = !DILocation(line: 129, column: 15, scope: !894)
!897 = !DILocation(line: 129, column: 8, scope: !895)
!898 = !DILocation(line: 130, column: 134, scope: !899)
!899 = distinct !DILexicalBlock(scope: !894, file: !3, line: 129, column: 55)
!900 = !DILocation(line: 130, column: 110, scope: !899)
!901 = !DILocation(line: 130, column: 6, scope: !899)
!902 = !DILocation(line: 131, column: 5, scope: !899)
!903 = !DILocation(line: 132, column: 73, scope: !904)
!904 = distinct !DILexicalBlock(scope: !894, file: !3, line: 131, column: 10)
!905 = !DILocation(line: 132, column: 49, scope: !904)
!906 = !DILocation(line: 132, column: 6, scope: !904)
!907 = !DILocation(line: 134, column: 4, scope: !895)
!908 = !DILocation(line: 135, column: 73, scope: !909)
!909 = distinct !DILexicalBlock(scope: !889, file: !3, line: 134, column: 9)
!910 = !DILocation(line: 135, column: 48, scope: !909)
!911 = !DILocation(line: 135, column: 5, scope: !909)
!912 = !DILocation(line: 137, column: 3, scope: !890)
!913 = !DILocation(line: 138, column: 27, scope: !886)
!914 = !DILocation(line: 138, column: 40, scope: !886)
!915 = !DILocation(line: 138, column: 3, scope: !886)
!916 = !DILocation(line: 140, column: 1, scope: !836)
!917 = distinct !DISubprogram(name: "my_subscribe_callback", scope: !3, file: !3, line: 142, type: !918, scopeLine: 143, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !230)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !93, !223, !90, !90, !442}
!920 = !DILocalVariable(name: "mosq", arg: 1, scope: !917, file: !3, line: 142, type: !93)
!921 = !DILocation(line: 142, column: 46, scope: !917)
!922 = !DILocalVariable(name: "obj", arg: 2, scope: !917, file: !3, line: 142, type: !223)
!923 = !DILocation(line: 142, column: 58, scope: !917)
!924 = !DILocalVariable(name: "mid", arg: 3, scope: !917, file: !3, line: 142, type: !90)
!925 = !DILocation(line: 142, column: 67, scope: !917)
!926 = !DILocalVariable(name: "qos_count", arg: 4, scope: !917, file: !3, line: 142, type: !90)
!927 = !DILocation(line: 142, column: 76, scope: !917)
!928 = !DILocalVariable(name: "granted_qos", arg: 5, scope: !917, file: !3, line: 142, type: !442)
!929 = !DILocation(line: 142, column: 98, scope: !917)
!930 = !DILocalVariable(name: "i", scope: !917, file: !3, line: 144, type: !90)
!931 = !DILocation(line: 144, column: 6, scope: !917)
!932 = !DILocation(line: 146, column: 2, scope: !917)
!933 = !DILocation(line: 148, column: 9, scope: !934)
!934 = distinct !DILexicalBlock(scope: !917, file: !3, line: 148, column: 5)
!935 = !DILocation(line: 148, column: 5, scope: !917)
!936 = !DILocation(line: 149, column: 11, scope: !937)
!937 = distinct !DILexicalBlock(scope: !938, file: !3, line: 149, column: 6)
!938 = distinct !DILexicalBlock(scope: !934, file: !3, line: 148, column: 15)
!939 = !DILocation(line: 149, column: 6, scope: !938)
!940 = !DILocation(line: 149, column: 53, scope: !937)
!941 = !DILocation(line: 149, column: 58, scope: !937)
!942 = !DILocation(line: 149, column: 18, scope: !937)
!943 = !DILocation(line: 150, column: 8, scope: !944)
!944 = distinct !DILexicalBlock(scope: !938, file: !3, line: 150, column: 3)
!945 = !DILocation(line: 150, column: 7, scope: !944)
!946 = !DILocation(line: 150, column: 12, scope: !947)
!947 = distinct !DILexicalBlock(scope: !944, file: !3, line: 150, column: 3)
!948 = !DILocation(line: 150, column: 14, scope: !947)
!949 = !DILocation(line: 150, column: 13, scope: !947)
!950 = !DILocation(line: 150, column: 3, scope: !944)
!951 = !DILocation(line: 151, column: 12, scope: !952)
!952 = distinct !DILexicalBlock(scope: !953, file: !3, line: 151, column: 7)
!953 = distinct !DILexicalBlock(scope: !947, file: !3, line: 150, column: 29)
!954 = !DILocation(line: 151, column: 7, scope: !953)
!955 = !DILocation(line: 151, column: 34, scope: !952)
!956 = !DILocation(line: 151, column: 46, scope: !952)
!957 = !DILocation(line: 151, column: 19, scope: !952)
!958 = !DILocation(line: 152, column: 3, scope: !953)
!959 = !DILocation(line: 150, column: 26, scope: !947)
!960 = !DILocation(line: 150, column: 3, scope: !947)
!961 = distinct !{!961, !950, !962}
!962 = !DILocation(line: 152, column: 3, scope: !944)
!963 = !DILocation(line: 153, column: 11, scope: !964)
!964 = distinct !DILexicalBlock(scope: !938, file: !3, line: 153, column: 6)
!965 = !DILocation(line: 153, column: 6, scope: !938)
!966 = !DILocation(line: 153, column: 18, scope: !964)
!967 = !DILocation(line: 154, column: 2, scope: !938)
!968 = !DILocation(line: 156, column: 9, scope: !969)
!969 = distinct !DILexicalBlock(scope: !917, file: !3, line: 156, column: 5)
!970 = !DILocation(line: 156, column: 5, scope: !917)
!971 = !DILocation(line: 157, column: 27, scope: !972)
!972 = distinct !DILexicalBlock(scope: !969, file: !3, line: 156, column: 24)
!973 = !DILocation(line: 157, column: 40, scope: !972)
!974 = !DILocation(line: 157, column: 3, scope: !972)
!975 = !DILocation(line: 158, column: 2, scope: !972)
!976 = !DILocation(line: 159, column: 1, scope: !917)
!977 = distinct !DISubprogram(name: "my_log_callback", scope: !3, file: !3, line: 161, type: !978, scopeLine: 162, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !230)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !93, !223, !90, !454}
!980 = !DILocalVariable(name: "mosq", arg: 1, scope: !977, file: !3, line: 161, type: !93)
!981 = !DILocation(line: 161, column: 40, scope: !977)
!982 = !DILocalVariable(name: "obj", arg: 2, scope: !977, file: !3, line: 161, type: !223)
!983 = !DILocation(line: 161, column: 52, scope: !977)
!984 = !DILocalVariable(name: "level", arg: 3, scope: !977, file: !3, line: 161, type: !90)
!985 = !DILocation(line: 161, column: 61, scope: !977)
!986 = !DILocalVariable(name: "str", arg: 4, scope: !977, file: !3, line: 161, type: !454)
!987 = !DILocation(line: 161, column: 80, scope: !977)
!988 = !DILocation(line: 163, column: 2, scope: !977)
!989 = !DILocation(line: 164, column: 2, scope: !977)
!990 = !DILocation(line: 165, column: 2, scope: !977)
!991 = !DILocation(line: 167, column: 17, scope: !977)
!992 = !DILocation(line: 167, column: 2, scope: !977)
!993 = !DILocation(line: 168, column: 1, scope: !977)
!994 = distinct !DISubprogram(name: "print_usage", scope: !3, file: !3, line: 170, type: !995, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !230)
!995 = !DISubroutineType(types: !996)
!996 = !{null}
!997 = !DILocalVariable(name: "major", scope: !994, file: !3, line: 172, type: !90)
!998 = !DILocation(line: 172, column: 6, scope: !994)
!999 = !DILocalVariable(name: "minor", scope: !994, file: !3, line: 172, type: !90)
!1000 = !DILocation(line: 172, column: 13, scope: !994)
!1001 = !DILocalVariable(name: "revision", scope: !994, file: !3, line: 172, type: !90)
!1002 = !DILocation(line: 172, column: 20, scope: !994)
!1003 = !DILocation(line: 174, column: 2, scope: !994)
!1004 = !DILocation(line: 175, column: 2, scope: !994)
!1005 = !DILocation(line: 176, column: 84, scope: !994)
!1006 = !DILocation(line: 176, column: 91, scope: !994)
!1007 = !DILocation(line: 176, column: 98, scope: !994)
!1008 = !DILocation(line: 176, column: 2, scope: !994)
!1009 = !DILocation(line: 177, column: 2, scope: !994)
!1010 = !DILocation(line: 178, column: 2, scope: !994)
!1011 = !DILocation(line: 179, column: 2, scope: !994)
!1012 = !DILocation(line: 180, column: 2, scope: !994)
!1013 = !DILocation(line: 182, column: 2, scope: !994)
!1014 = !DILocation(line: 187, column: 2, scope: !994)
!1015 = !DILocation(line: 189, column: 2, scope: !994)
!1016 = !DILocation(line: 190, column: 2, scope: !994)
!1017 = !DILocation(line: 191, column: 2, scope: !994)
!1018 = !DILocation(line: 204, column: 2, scope: !994)
!1019 = !DILocation(line: 205, column: 2, scope: !994)
!1020 = !DILocation(line: 206, column: 2, scope: !994)
!1021 = !DILocation(line: 207, column: 2, scope: !994)
!1022 = !DILocation(line: 208, column: 2, scope: !994)
!1023 = !DILocation(line: 209, column: 2, scope: !994)
!1024 = !DILocation(line: 210, column: 2, scope: !994)
!1025 = !DILocation(line: 211, column: 2, scope: !994)
!1026 = !DILocation(line: 212, column: 2, scope: !994)
!1027 = !DILocation(line: 213, column: 2, scope: !994)
!1028 = !DILocation(line: 214, column: 2, scope: !994)
!1029 = !DILocation(line: 215, column: 2, scope: !994)
!1030 = !DILocation(line: 216, column: 2, scope: !994)
!1031 = !DILocation(line: 217, column: 2, scope: !994)
!1032 = !DILocation(line: 218, column: 2, scope: !994)
!1033 = !DILocation(line: 219, column: 2, scope: !994)
!1034 = !DILocation(line: 220, column: 2, scope: !994)
!1035 = !DILocation(line: 221, column: 2, scope: !994)
!1036 = !DILocation(line: 222, column: 2, scope: !994)
!1037 = !DILocation(line: 223, column: 2, scope: !994)
!1038 = !DILocation(line: 224, column: 2, scope: !994)
!1039 = !DILocation(line: 225, column: 2, scope: !994)
!1040 = !DILocation(line: 229, column: 2, scope: !994)
!1041 = !DILocation(line: 230, column: 2, scope: !994)
!1042 = !DILocation(line: 231, column: 2, scope: !994)
!1043 = !DILocation(line: 232, column: 2, scope: !994)
!1044 = !DILocation(line: 233, column: 2, scope: !994)
!1045 = !DILocation(line: 234, column: 2, scope: !994)
!1046 = !DILocation(line: 235, column: 2, scope: !994)
!1047 = !DILocation(line: 237, column: 2, scope: !994)
!1048 = !DILocation(line: 239, column: 2, scope: !994)
!1049 = !DILocation(line: 240, column: 2, scope: !994)
!1050 = !DILocation(line: 241, column: 2, scope: !994)
!1051 = !DILocation(line: 242, column: 2, scope: !994)
!1052 = !DILocation(line: 243, column: 2, scope: !994)
!1053 = !DILocation(line: 244, column: 2, scope: !994)
!1054 = !DILocation(line: 245, column: 2, scope: !994)
!1055 = !DILocation(line: 246, column: 2, scope: !994)
!1056 = !DILocation(line: 247, column: 2, scope: !994)
!1057 = !DILocation(line: 248, column: 2, scope: !994)
!1058 = !DILocation(line: 249, column: 2, scope: !994)
!1059 = !DILocation(line: 250, column: 2, scope: !994)
!1060 = !DILocation(line: 278, column: 2, scope: !994)
!1061 = !DILocation(line: 279, column: 1, scope: !994)
!1062 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 281, type: !1063, scopeLine: 282, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !230)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!90, !90, !143}
!1065 = !DILocalVariable(name: "argc", arg: 1, scope: !1062, file: !3, line: 281, type: !90)
!1066 = !DILocation(line: 281, column: 14, scope: !1062)
!1067 = !DILocalVariable(name: "argv", arg: 2, scope: !1062, file: !3, line: 281, type: !143)
!1068 = !DILocation(line: 281, column: 26, scope: !1062)
!1069 = !DILocalVariable(name: "rc", scope: !1062, file: !3, line: 283, type: !90)
!1070 = !DILocation(line: 283, column: 6, scope: !1062)
!1071 = !DILocalVariable(name: "sigact", scope: !1062, file: !3, line: 285, type: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sigaction", file: !1073, line: 24, size: 1216, elements: !1074)
!1073 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sigaction.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!1074 = !{!1075, !1162, !1170, !1171}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "__sigaction_handler", scope: !1072, file: !1073, line: 35, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1072, file: !1073, line: 28, size: 64, elements: !1077)
!1077 = !{!1078, !1081}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "sa_handler", scope: !1076, file: !1073, line: 31, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !1080, line: 72, baseType: !297)
!1080 = !DIFile(filename: "/usr/include/signal.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "sa_sigaction", scope: !1076, file: !1073, line: 33, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !90, !1085, !223}
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "siginfo_t", file: !1087, line: 124, baseType: !1088)
!1087 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/siginfo_t.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1087, line: 36, size: 1024, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "si_signo", scope: !1088, file: !1087, line: 38, baseType: !90, size: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "si_errno", scope: !1088, file: !1087, line: 40, baseType: !90, size: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "si_code", scope: !1088, file: !1087, line: 42, baseType: !90, size: 32, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1088, file: !1087, line: 48, baseType: !90, size: 32, offset: 96)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_sifields", scope: !1088, file: !1087, line: 123, baseType: !1095, size: 896, offset: 128)
!1095 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1088, file: !1087, line: 51, size: 896, elements: !1096)
!1096 = !{!1097, !1101, !1108, !1120, !1126, !1135, !1151, !1156}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !1095, file: !1087, line: 53, baseType: !1098, size: 896)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 896, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 28)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "_kill", scope: !1095, file: !1087, line: 60, baseType: !1102, size: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1095, file: !1087, line: 56, size: 64, elements: !1103)
!1103 = !{!1104, !1106}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1102, file: !1087, line: 58, baseType: !1105, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !127, line: 142, baseType: !90)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1102, file: !1087, line: 59, baseType: !1107, size: 32, offset: 32)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !127, line: 134, baseType: !133)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "_timer", scope: !1095, file: !1087, line: 68, baseType: !1109, size: 128)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1095, file: !1087, line: 63, size: 128, elements: !1110)
!1110 = !{!1111, !1112, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "si_tid", scope: !1109, file: !1087, line: 65, baseType: !90, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "si_overrun", scope: !1109, file: !1087, line: 66, baseType: !90, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1109, file: !1087, line: 67, baseType: !1114, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigval_t", file: !1115, line: 30, baseType: !1116)
!1115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/__sigval_t.h", directory: "/home/tren/Documents/Aloja/Aloja_Phase_2/Aloja_mosquitto/mosquitto_Ryan/mosquitto/client")
!1116 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "sigval", file: !1115, line: 24, size: 64, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "sival_int", scope: !1116, file: !1115, line: 26, baseType: !90, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !1116, file: !1115, line: 27, baseType: !223, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "_rt", scope: !1095, file: !1087, line: 76, baseType: !1121, size: 128)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1095, file: !1087, line: 71, size: 128, elements: !1122)
!1122 = !{!1123, !1124, !1125}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1121, file: !1087, line: 73, baseType: !1105, size: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1121, file: !1087, line: 74, baseType: !1107, size: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "si_sigval", scope: !1121, file: !1087, line: 75, baseType: !1114, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "_sigchld", scope: !1095, file: !1087, line: 86, baseType: !1127, size: 256)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1095, file: !1087, line: 79, size: 256, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1134}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "si_pid", scope: !1127, file: !1087, line: 81, baseType: !1105, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "si_uid", scope: !1127, file: !1087, line: 82, baseType: !1107, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "si_status", scope: !1127, file: !1087, line: 83, baseType: !90, size: 32, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "si_utime", scope: !1127, file: !1087, line: 84, baseType: !1133, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !127, line: 144, baseType: !117)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "si_stime", scope: !1127, file: !1087, line: 85, baseType: !1133, size: 64, offset: 192)
