; ModuleID = 'simple_publisher.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.anon.0 = type { [16 x i8], [16 x i8], [16 x i8] }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.mqtt_client = type { i32, i16, i16, i32, i64, i64, i32, i32, i32, double, void (i8**, %struct.mqtt_response_publish*)*, i8*, i32 (%struct.mqtt_client*)*, void (%struct.mqtt_client*, i8**)*, i8*, %struct.anon, %union.pthread_mutex_t, %struct.mqtt_message_queue }
%struct.mqtt_response_publish = type { i8, i8, i8, i16, i8*, i16, i8*, i64 }
%struct.anon = type { i8*, i64, i8*, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }

!35 = !DIEnumerator(name: "MQTT_ERROR_INVALID_REMAINING_LENGTH", value: -2147483622)
!36 = !DIEnumerator(name: "MQTT_ERROR_CLEAN_SESSION_IS_REQUIRED", value: -2147483621)
!37 = !DIEnumerator(name: "MQTT_ERROR_RECONNECTING", value: -2147483620)
!38 = !DIEnumerator(name: "MQTT_OK", value: 1)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTQueuedMessageState", file: !6, line: 919, baseType: !40, size: 32, elements: !41)
!40 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "MQTT_QUEUED_UNSENT", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "MQTT_QUEUED_AWAITING_ACK", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "MQTT_QUEUED_COMPLETE", value: 2, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTControlPacketType", file: !6, line: 131, baseType: !40, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!47 = !DIEnumerator(name: "MQTT_CONTROL_CONNECT", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "MQTT_CONTROL_CONNACK", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "MQTT_CONTROL_PUBLISH", value: 3, isUnsigned: true)
!50 = !DIEnumerator(name: "MQTT_CONTROL_PUBACK", value: 4, isUnsigned: true)
!51 = !DIEnumerator(name: "MQTT_CONTROL_PUBREC", value: 5, isUnsigned: true)
!52 = !DIEnumerator(name: "MQTT_CONTROL_PUBREL", value: 6, isUnsigned: true)
!53 = !DIEnumerator(name: "MQTT_CONTROL_PUBCOMP", value: 7, isUnsigned: true)
!54 = !DIEnumerator(name: "MQTT_CONTROL_SUBSCRIBE", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "MQTT_CONTROL_SUBACK", value: 9, isUnsigned: true)
!56 = !DIEnumerator(name: "MQTT_CONTROL_UNSUBSCRIBE", value: 10, isUnsigned: true)
!57 = !DIEnumerator(name: "MQTT_CONTROL_UNSUBACK", value: 11, isUnsigned: true)
!58 = !DIEnumerator(name: "MQTT_CONTROL_PINGREQ", value: 12, isUnsigned: true)
!59 = !DIEnumerator(name: "MQTT_CONTROL_PINGRESP", value: 13, isUnsigned: true)
!60 = !DIEnumerator(name: "MQTT_CONTROL_DISCONNECT", value: 14, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTPublishFlags", file: !6, line: 742, baseType: !40, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "MQTT_PUBLISH_DUP", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "MQTT_PUBLISH_QOS_0", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "MQTT_PUBLISH_QOS_1", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "MQTT_PUBLISH_QOS_2", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "MQTT_PUBLISH_QOS_MASK", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "MQTT_PUBLISH_RETAIN", value: 1, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTConnackReturnCode", file: !6, line: 298, baseType: !40, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76}
!71 = !DIEnumerator(name: "MQTT_CONNACK_ACCEPTED", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_PROTOCOL_VERSION", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_IDENTIFIER_REJECTED", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_SERVER_UNAVAILABLE", value: 3, isUnsigned: true)
!75 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_BAD_USER_NAME_OR_PASSWORD", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_NOT_AUTHORIZED", value: 5, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTSubackReturnCodes", file: !6, line: 444, baseType: !40, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "MQTT_SUBACK_SUCCESS_MAX_QOS_0", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "MQTT_SUBACK_SUCCESS_MAX_QOS_1", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "MQTT_SUBACK_SUCCESS_MAX_QOS_2", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "MQTT_SUBACK_FAILURE", value: 128, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTConnectFlags", file: !6, line: 674, baseType: !40, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93}
!85 = !DIEnumerator(name: "MQTT_CONNECT_RESERVED", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "MQTT_CONNECT_CLEAN_SESSION", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "MQTT_CONNECT_WILL_FLAG", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "MQTT_CONNECT_WILL_QOS_0", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "MQTT_CONNECT_WILL_QOS_1", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "MQTT_CONNECT_WILL_QOS_2", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "MQTT_CONNECT_WILL_RETAIN", value: 32, isUnsigned: true)
!92 = !DIEnumerator(name: "MQTT_CONNECT_PASSWORD", value: 64, isUnsigned: true)
!93 = !DIEnumerator(name: "MQTT_CONNECT_USER_NAME", value: 128, isUnsigned: true)
!94 = !{!95, !96, !123, !124, !112, !127, !128, !129, !101, !120, !69, !130, !107, !100}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_queued_message", file: !6, line: 929, size: 320, elements: !98)
!98 = !{!99, !106, !110, !111, !118, !119}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !97, file: !6, line: 931, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !102, line: 24, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !104, line: 38, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !97, file: !6, line: 934, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.0/include/stddef.h", directory: "")
!109 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !97, file: !6, line: 938, baseType: !39, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "time_sent", scope: !97, file: !6, line: 946, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mqtt_pal_time_t", file: !113, line: 85, baseType: !114)
!113 = !DIFile(filename: "include/mqtt_pal.h", directory: "/home/ryan/git/MQTT-C")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !115, line: 7, baseType: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !104, line: 160, baseType: !117)
!117 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !97, file: !6, line: 951, baseType: !45, size: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !97, file: !6, line: 959, baseType: !120, size: 16, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !102, line: 25, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !104, line: 40, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "mqtt_pal_socket_handle", file: !113, line: 118, baseType: !7)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!127 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!128 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !102, line: 26, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !104, line: 42, baseType: !40)
!132 = !{!0, !133}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "MQTT_ERRORS_STR", scope: !2, file: !135, line: 1765, type: !136, isLocal: true, isDefinition: true)
!135 = !DIFile(filename: "src/mqtt.c", directory: "/home/ryan/git/MQTT-C")
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1856, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 29)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 895, size: 384, elements: !140)
!140 = !{!141, !146, !147}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "control_type_is_valid", scope: !139, file: !135, line: 896, baseType: !142, size: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !144)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!144 = !{!145}
!145 = !DISubrange(count: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "required_flags", scope: !139, file: !135, line: 897, baseType: !142, size: 128, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mask_required_flags", scope: !139, file: !135, line: 898, baseType: !142, size: 128, offset: 256)
!148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !149, producer: "Ubuntu clang version 12.0.0-3ubuntu1~21.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!149 = !DIFile(filename: "/home/ryan/git/MQTT-C/examples/simple_publisher.c", directory: "/home/ryan/git/MQTT-C/build")
!150 = !{!151, !5, !39, !45, !83, !61}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !152, line: 24, baseType: !40, size: 32, elements: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162}
!154 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!157 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!158 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!159 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!160 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!161 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!162 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!163 = !{!95, !164}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_client", file: !6, line: 1093, size: 1664, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !195, !196, !200, !204, !205, !212, !243}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "socketfd", scope: !165, file: !6, line: 1095, baseType: !123, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pid_lfsr", scope: !165, file: !6, line: 1098, baseType: !120, size: 16, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !165, file: !6, line: 1101, baseType: !120, size: 16, offset: 48)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_keep_alives", scope: !165, file: !6, line: 1107, baseType: !7, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "send_offset", scope: !165, file: !6, line: 1114, baseType: !107, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "time_of_last_send", scope: !165, file: !6, line: 1123, baseType: !112, size: 64, offset: 192)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !165, file: !6, line: 1133, baseType: !5, size: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !165, file: !6, line: 1143, baseType: !7, size: 32, offset: 288)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_timeouts", scope: !165, file: !6, line: 1146, baseType: !7, size: 32, offset: 320)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "typical_response_time", scope: !165, file: !6, line: 1154, baseType: !128, size: 64, offset: 384)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "publish_response_callback", scope: !165, file: !6, line: 1167, baseType: !178, size: 64, offset: 448)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DISubroutineType(types: !180)
!180 = !{null, !181, !182}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_publish", file: !6, line: 341, size: 320, elements: !184)
!184 = !{!185, !186, !187, !188, !189, !192, !193, !194}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dup_flag", scope: !183, file: !6, line: 346, baseType: !101, size: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "qos_level", scope: !183, file: !6, line: 355, baseType: !101, size: 8, offset: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "retain_flag", scope: !183, file: !6, line: 358, baseType: !101, size: 8, offset: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "topic_name_size", scope: !183, file: !6, line: 361, baseType: !120, size: 16, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "topic_name", scope: !183, file: !6, line: 368, baseType: !190, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !183, file: !6, line: 371, baseType: !120, size: 16, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "application_message", scope: !183, file: !6, line: 374, baseType: !190, size: 64, offset: 192)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "application_message_size", scope: !183, file: !6, line: 377, baseType: !107, size: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "publish_response_callback_state", scope: !165, file: !6, line: 1175, baseType: !95, size: 64, offset: 512)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "inspector_callback", scope: !165, file: !6, line: 1192, baseType: !197, size: 64, offset: 576)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DISubroutineType(types: !199)
!199 = !{!5, !164}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_callback", scope: !165, file: !6, line: 1201, baseType: !201, size: 64, offset: 640)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !164, !181}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_state", scope: !165, file: !6, line: 1207, baseType: !95, size: 64, offset: 704)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !165, file: !6, line: 1224, baseType: !206, size: 256, offset: 768)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !165, file: !6, line: 1212, size: 256, elements: !207)
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !206, file: !6, line: 1214, baseType: !100, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !206, file: !6, line: 1217, baseType: !107, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !206, file: !6, line: 1220, baseType: !100, size: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "curr_sz", scope: !206, file: !6, line: 1223, baseType: !107, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !165, file: !6, line: 1232, baseType: !213, size: 320, offset: 1024)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "mqtt_pal_mutex_t", file: !113, line: 86, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !215, line: 72, baseType: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !215, line: 67, size: 320, elements: !217)
!217 = !{!218, !238, !242}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !216, file: !215, line: 69, baseType: !219, size: 320)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !220, line: 22, size: 320, elements: !221)
!220 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "")
!221 = !{!222, !223, !224, !225, !226, !227, !229, !230}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !219, file: !220, line: 24, baseType: !7, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !219, file: !220, line: 25, baseType: !40, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !219, file: !220, line: 26, baseType: !7, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !219, file: !220, line: 28, baseType: !40, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !219, file: !220, line: 32, baseType: !7, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !219, file: !220, line: 34, baseType: !228, size: 16, offset: 160)
!228 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !219, file: !220, line: 35, baseType: !228, size: 16, offset: 176)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !219, file: !220, line: 36, baseType: !231, size: 128, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !232, line: 53, baseType: !233)
!232 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !232, line: 49, size: 128, elements: !234)
!234 = !{!235, !237}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !233, file: !232, line: 51, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !233, file: !232, line: 52, baseType: !236, size: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !216, file: !215, line: 70, baseType: !239, size: 320)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 320, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 40)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !216, file: !215, line: 71, baseType: !117, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "mq", scope: !165, file: !6, line: 1235, baseType: !244, size: 320, offset: 1344)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_message_queue", file: !6, line: 969, size: 320, elements: !245)
!245 = !{!246, !247, !248, !249, !250}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !244, file: !6, line: 975, baseType: !95, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !244, file: !6, line: 978, baseType: !95, size: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !244, file: !6, line: 986, baseType: !100, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "curr_sz", scope: !244, file: !6, line: 996, baseType: !107, size: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "queue_tail", scope: !244, file: !6, line: 1003, baseType: !251, size: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_queued_message", file: !6, line: 929, size: 320, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !252, file: !6, line: 931, baseType: !100, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !252, file: !6, line: 934, baseType: !107, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !252, file: !6, line: 938, baseType: !39, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "time_sent", scope: !252, file: !6, line: 946, baseType: !112, size: 64, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !252, file: !6, line: 951, baseType: !45, size: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !252, file: !6, line: 959, baseType: !120, size: 16, offset: 288)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "Ubuntu clang version 12.0.0-3ubuntu1~21.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !262, retainedTypes: !263, splitDebugInlining: false, nameTableKind: None)
!261 = !DIFile(filename: "/home/ryan/git/MQTT-C/src/mqtt_pal.c", directory: "/home/ryan/git/MQTT-C/build")
!262 = !{!5}
!263 = !{!107}
!264 = !{!"Ubuntu clang version 12.0.0-3ubuntu1~21.04.1"}
!265 = !{i32 7, !"Dwarf Version", i32 4}
!266 = !{i32 2, !"Debug Info Version", i32 3}
!267 = !{i32 1, !"wchar_size", i32 4}
!268 = distinct !DISubprogram(name: "open_nb_socket", scope: !269, file: !269, line: 18, type: !270, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !272)
!269 = !DIFile(filename: "examples/templates/posix_sockets.h", directory: "/home/ryan/git/MQTT-C")
!270 = !DISubroutineType(types: !271)
!271 = !{!7, !124, !124}
!272 = !{}
!273 = !DILocalVariable(name: "addr", arg: 1, scope: !268, file: !269, line: 18, type: !124)
!274 = !DILocation(line: 18, column: 32, scope: !268)
!275 = !DILocalVariable(name: "port", arg: 2, scope: !268, file: !269, line: 18, type: !124)
!276 = !DILocation(line: 18, column: 50, scope: !268)
!277 = !DILocalVariable(name: "hints", scope: !268, file: !269, line: 19, type: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !279, line: 565, size: 384, elements: !280)
!279 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!280 = !{!281, !282, !283, !284, !285, !289, !301, !303}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !278, file: !279, line: 567, baseType: !7, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !278, file: !279, line: 568, baseType: !7, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !278, file: !279, line: 569, baseType: !7, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !278, file: !279, line: 570, baseType: !7, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !278, file: !279, line: 571, baseType: !286, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !287, line: 274, baseType: !288)
!287 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !104, line: 210, baseType: !40)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !278, file: !279, line: 572, baseType: !290, size: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !292, line: 178, size: 128, elements: !293)
!292 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!293 = !{!294, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !291, file: !292, line: 180, baseType: !295, size: 16)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !296, line: 28, baseType: !122)
!296 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !291, file: !292, line: 181, baseType: !298, size: 112, offset: 16)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 112, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: 14)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !278, file: !279, line: 573, baseType: !302, size: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !278, file: !279, line: 574, baseType: !304, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!305 = !DILocation(line: 19, column: 21, scope: !268)
!306 = !DILocation(line: 21, column: 11, scope: !268)
!307 = !DILocation(line: 21, column: 21, scope: !268)
!308 = !DILocation(line: 22, column: 11, scope: !268)
!309 = !DILocation(line: 22, column: 23, scope: !268)
!310 = !DILocalVariable(name: "sockfd", scope: !268, file: !269, line: 23, type: !7)
!311 = !DILocation(line: 23, column: 9, scope: !268)
!312 = !DILocalVariable(name: "rv", scope: !268, file: !269, line: 24, type: !7)
!313 = !DILocation(line: 24, column: 9, scope: !268)
!314 = !DILocalVariable(name: "p", scope: !268, file: !269, line: 25, type: !304)
!315 = !DILocation(line: 25, column: 22, scope: !268)
!316 = !DILocalVariable(name: "servinfo", scope: !268, file: !269, line: 25, type: !304)
!317 = !DILocation(line: 25, column: 26, scope: !268)
!318 = !DILocation(line: 28, column: 22, scope: !268)
!319 = !DILocation(line: 28, column: 28, scope: !268)
!320 = !DILocation(line: 28, column: 10, scope: !268)
!321 = !DILocation(line: 28, column: 8, scope: !268)
!322 = !DILocation(line: 29, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !268, file: !269, line: 29, column: 8)
!324 = !DILocation(line: 29, column: 11, scope: !323)
!325 = !DILocation(line: 29, column: 8, scope: !268)
!326 = !DILocation(line: 30, column: 17, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !269, line: 29, column: 17)
!328 = !DILocation(line: 30, column: 83, scope: !327)
!329 = !DILocation(line: 30, column: 70, scope: !327)
!330 = !DILocation(line: 30, column: 9, scope: !327)
!331 = !DILocation(line: 31, column: 9, scope: !327)
!332 = !DILocation(line: 35, column: 13, scope: !333)
!333 = distinct !DILexicalBlock(scope: !268, file: !269, line: 35, column: 5)
!334 = !DILocation(line: 35, column: 11, scope: !333)
!335 = !DILocation(line: 35, column: 9, scope: !333)
!336 = !DILocation(line: 35, column: 23, scope: !337)
!337 = distinct !DILexicalBlock(scope: !333, file: !269, line: 35, column: 5)
!338 = !DILocation(line: 35, column: 25, scope: !337)
!339 = !DILocation(line: 35, column: 5, scope: !333)
!340 = !DILocation(line: 36, column: 25, scope: !341)
!341 = distinct !DILexicalBlock(scope: !337, file: !269, line: 35, column: 50)
!342 = !DILocation(line: 36, column: 28, scope: !341)
!343 = !DILocation(line: 36, column: 39, scope: !341)
!344 = !DILocation(line: 36, column: 42, scope: !341)
!345 = !DILocation(line: 36, column: 55, scope: !341)
!346 = !DILocation(line: 36, column: 58, scope: !341)
!347 = !DILocation(line: 36, column: 18, scope: !341)
!348 = !DILocation(line: 36, column: 16, scope: !341)
!349 = !DILocation(line: 37, column: 13, scope: !350)
!350 = distinct !DILexicalBlock(scope: !341, file: !269, line: 37, column: 13)
!351 = !DILocation(line: 37, column: 20, scope: !350)
!352 = !DILocation(line: 37, column: 13, scope: !341)
!353 = !DILocation(line: 37, column: 27, scope: !350)
!354 = !DILocation(line: 40, column: 22, scope: !341)
!355 = !DILocation(line: 40, column: 30, scope: !341)
!356 = !DILocation(line: 40, column: 33, scope: !341)
!357 = !DILocation(line: 40, column: 42, scope: !341)
!358 = !DILocation(line: 40, column: 45, scope: !341)
!359 = !DILocation(line: 40, column: 14, scope: !341)
!360 = !DILocation(line: 40, column: 12, scope: !341)
!361 = !DILocation(line: 41, column: 12, scope: !362)
!362 = distinct !DILexicalBlock(scope: !341, file: !269, line: 41, column: 12)
!363 = !DILocation(line: 41, column: 15, scope: !362)
!364 = !DILocation(line: 41, column: 12, scope: !341)
!365 = !DILocation(line: 42, column: 17, scope: !366)
!366 = distinct !DILexicalBlock(scope: !362, file: !269, line: 41, column: 22)
!367 = !DILocation(line: 42, column: 11, scope: !366)
!368 = !DILocation(line: 43, column: 18, scope: !366)
!369 = !DILocation(line: 44, column: 11, scope: !366)
!370 = !DILocation(line: 46, column: 9, scope: !341)
!371 = !DILocation(line: 35, column: 38, scope: !337)
!372 = !DILocation(line: 35, column: 41, scope: !337)
!373 = !DILocation(line: 35, column: 36, scope: !337)
!374 = !DILocation(line: 35, column: 5, scope: !337)
!375 = distinct !{!375, !339, !376, !377}
!376 = !DILocation(line: 47, column: 5, scope: !333)
!377 = !{!"llvm.loop.mustprogress"}
!378 = !DILocation(line: 50, column: 18, scope: !268)
!379 = !DILocation(line: 50, column: 5, scope: !268)
!380 = !DILocation(line: 54, column: 9, scope: !381)
!381 = distinct !DILexicalBlock(scope: !268, file: !269, line: 54, column: 9)
!382 = !DILocation(line: 54, column: 16, scope: !381)
!383 = !DILocation(line: 54, column: 9, scope: !268)
!384 = !DILocation(line: 54, column: 29, scope: !381)
!385 = !DILocation(line: 54, column: 52, scope: !381)
!386 = !DILocation(line: 54, column: 46, scope: !381)
!387 = !DILocation(line: 54, column: 69, scope: !381)
!388 = !DILocation(line: 54, column: 23, scope: !381)
!389 = !DILocation(line: 72, column: 12, scope: !268)
!390 = !DILocation(line: 72, column: 5, scope: !268)
!391 = !DILocation(line: 73, column: 1, scope: !268)
!392 = distinct !DISubprogram(name: "main", scope: !393, file: !393, line: 39, type: !394, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !272)
!393 = !DIFile(filename: "examples/simple_publisher.c", directory: "/home/ryan/git/MQTT-C")
!394 = !DISubroutineType(types: !395)
!395 = !{!7, !7, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!397 = !DILocalVariable(name: "argc", arg: 1, scope: !392, file: !393, line: 39, type: !7)
!398 = !DILocation(line: 39, column: 14, scope: !392)
!399 = !DILocalVariable(name: "argv", arg: 2, scope: !392, file: !393, line: 39, type: !396)
!400 = !DILocation(line: 39, column: 32, scope: !392)
!401 = !DILocalVariable(name: "addr", scope: !392, file: !393, line: 41, type: !124)
!402 = !DILocation(line: 41, column: 17, scope: !392)
!403 = !DILocalVariable(name: "port", scope: !392, file: !393, line: 42, type: !124)
!404 = !DILocation(line: 42, column: 17, scope: !392)
!405 = !DILocalVariable(name: "topic", scope: !392, file: !393, line: 43, type: !124)
!406 = !DILocation(line: 43, column: 17, scope: !392)
!407 = !DILocation(line: 46, column: 9, scope: !408)
!408 = distinct !DILexicalBlock(scope: !392, file: !393, line: 46, column: 9)
!409 = !DILocation(line: 46, column: 14, scope: !408)
!410 = !DILocation(line: 46, column: 9, scope: !392)
!411 = !DILocation(line: 47, column: 16, scope: !412)
!412 = distinct !DILexicalBlock(scope: !408, file: !393, line: 46, column: 19)
!413 = !DILocation(line: 47, column: 14, scope: !412)
!414 = !DILocation(line: 48, column: 5, scope: !412)
!415 = !DILocation(line: 49, column: 14, scope: !416)
!416 = distinct !DILexicalBlock(scope: !408, file: !393, line: 48, column: 12)
!417 = !DILocation(line: 53, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !392, file: !393, line: 53, column: 9)
!419 = !DILocation(line: 53, column: 14, scope: !418)
!420 = !DILocation(line: 53, column: 9, scope: !392)
!421 = !DILocation(line: 54, column: 16, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !393, line: 53, column: 19)
!423 = !DILocation(line: 54, column: 14, scope: !422)
!424 = !DILocation(line: 55, column: 5, scope: !422)
!425 = !DILocation(line: 56, column: 14, scope: !426)
!426 = distinct !DILexicalBlock(scope: !418, file: !393, line: 55, column: 12)
!427 = !DILocation(line: 60, column: 9, scope: !428)
!428 = distinct !DILexicalBlock(scope: !392, file: !393, line: 60, column: 9)
!429 = !DILocation(line: 60, column: 14, scope: !428)
!430 = !DILocation(line: 60, column: 9, scope: !392)
!431 = !DILocation(line: 61, column: 17, scope: !432)
!432 = distinct !DILexicalBlock(scope: !428, file: !393, line: 60, column: 19)
!433 = !DILocation(line: 61, column: 15, scope: !432)
!434 = !DILocation(line: 62, column: 5, scope: !432)
!435 = !DILocation(line: 63, column: 15, scope: !436)
!436 = distinct !DILexicalBlock(scope: !428, file: !393, line: 62, column: 12)
!437 = !DILocalVariable(name: "sockfd", scope: !392, file: !393, line: 67, type: !7)
!438 = !DILocation(line: 67, column: 9, scope: !392)
!439 = !DILocation(line: 67, column: 33, scope: !392)
!440 = !DILocation(line: 67, column: 39, scope: !392)
!441 = !DILocation(line: 67, column: 18, scope: !392)
!442 = !DILocation(line: 69, column: 9, scope: !443)
!443 = distinct !DILexicalBlock(scope: !392, file: !393, line: 69, column: 9)
!444 = !DILocation(line: 69, column: 16, scope: !443)
!445 = !DILocation(line: 69, column: 9, scope: !392)
!446 = !DILocation(line: 70, column: 9, scope: !447)
!447 = distinct !DILexicalBlock(scope: !443, file: !393, line: 69, column: 23)
!448 = !DILocation(line: 71, column: 36, scope: !447)
!449 = !DILocation(line: 71, column: 9, scope: !447)
!450 = !DILocation(line: 72, column: 5, scope: !447)
!451 = !DILocalVariable(name: "client", scope: !392, file: !393, line: 75, type: !165)
!452 = !DILocation(line: 75, column: 24, scope: !392)
!453 = !DILocalVariable(name: "sendbuf", scope: !392, file: !393, line: 76, type: !454)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 16384, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 2048)
!457 = !DILocation(line: 76, column: 13, scope: !392)
!458 = !DILocalVariable(name: "recvbuf", scope: !392, file: !393, line: 77, type: !459)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 8192, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 1024)
!462 = !DILocation(line: 77, column: 13, scope: !392)
!463 = !DILocation(line: 78, column: 24, scope: !392)
!464 = !DILocation(line: 78, column: 32, scope: !392)
!465 = !DILocation(line: 78, column: 58, scope: !392)
!466 = !DILocation(line: 78, column: 5, scope: !392)
!467 = !DILocalVariable(name: "client_id", scope: !392, file: !393, line: 80, type: !124)
!468 = !DILocation(line: 80, column: 17, scope: !392)
!469 = !DILocalVariable(name: "connect_flags", scope: !392, file: !393, line: 82, type: !101)
!470 = !DILocation(line: 82, column: 13, scope: !392)
!471 = !DILocation(line: 84, column: 27, scope: !392)
!472 = !DILocation(line: 84, column: 65, scope: !392)
!473 = !DILocation(line: 84, column: 5, scope: !392)
!474 = !DILocation(line: 87, column: 16, scope: !475)
!475 = distinct !DILexicalBlock(scope: !392, file: !393, line: 87, column: 9)
!476 = !DILocation(line: 87, column: 22, scope: !475)
!477 = !DILocation(line: 87, column: 9, scope: !392)
!478 = !DILocation(line: 88, column: 17, scope: !479)
!479 = distinct !DILexicalBlock(scope: !475, file: !393, line: 87, column: 34)
!480 = !DILocation(line: 88, column: 62, scope: !479)
!481 = !DILocation(line: 88, column: 40, scope: !479)
!482 = !DILocation(line: 88, column: 9, scope: !479)
!483 = !DILocation(line: 89, column: 36, scope: !479)
!484 = !DILocation(line: 89, column: 9, scope: !479)
!485 = !DILocation(line: 90, column: 5, scope: !479)
!486 = !DILocalVariable(name: "client_daemon", scope: !392, file: !393, line: 93, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !215, line: 27, baseType: !109)
!488 = !DILocation(line: 93, column: 15, scope: !392)
!489 = !DILocation(line: 94, column: 63, scope: !490)
!490 = distinct !DILexicalBlock(scope: !392, file: !393, line: 94, column: 8)
!491 = !DILocation(line: 94, column: 8, scope: !490)
!492 = !DILocation(line: 94, column: 8, scope: !392)
!493 = !DILocation(line: 95, column: 17, scope: !494)
!494 = distinct !DILexicalBlock(scope: !490, file: !393, line: 94, column: 73)
!495 = !DILocation(line: 95, column: 9, scope: !494)
!496 = !DILocation(line: 96, column: 36, scope: !494)
!497 = !DILocation(line: 96, column: 9, scope: !494)
!498 = !DILocation(line: 98, column: 5, scope: !494)
!499 = !DILocation(line: 101, column: 59, scope: !392)
!500 = !DILocation(line: 101, column: 5, scope: !392)
!501 = !DILocation(line: 102, column: 5, scope: !392)
!502 = !DILocation(line: 103, column: 5, scope: !392)
!503 = !DILocation(line: 104, column: 5, scope: !392)
!504 = !DILocation(line: 104, column: 17, scope: !392)
!505 = !DILocation(line: 104, column: 11, scope: !392)
!506 = !DILocation(line: 104, column: 24, scope: !392)
!507 = !DILocalVariable(name: "timer", scope: !508, file: !393, line: 106, type: !114)
!508 = distinct !DILexicalBlock(scope: !392, file: !393, line: 104, column: 33)
!509 = !DILocation(line: 106, column: 16, scope: !508)
!510 = !DILocation(line: 107, column: 9, scope: !508)
!511 = !DILocalVariable(name: "tm_info", scope: !508, file: !393, line: 108, type: !512)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !514, line: 7, size: 448, elements: !515)
!514 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!515 = !{!516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !513, file: !514, line: 9, baseType: !7, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !513, file: !514, line: 10, baseType: !7, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !513, file: !514, line: 11, baseType: !7, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !513, file: !514, line: 12, baseType: !7, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !513, file: !514, line: 13, baseType: !7, size: 32, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !513, file: !514, line: 14, baseType: !7, size: 32, offset: 160)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !513, file: !514, line: 15, baseType: !7, size: 32, offset: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !513, file: !514, line: 16, baseType: !7, size: 32, offset: 224)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !513, file: !514, line: 17, baseType: !7, size: 32, offset: 256)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !513, file: !514, line: 20, baseType: !117, size: 64, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !513, file: !514, line: 21, baseType: !124, size: 64, offset: 384)
!527 = !DILocation(line: 108, column: 20, scope: !508)
!528 = !DILocation(line: 108, column: 30, scope: !508)
!529 = !DILocalVariable(name: "timebuf", scope: !508, file: !393, line: 109, type: !530)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 208, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 26)
!533 = !DILocation(line: 109, column: 14, scope: !508)
!534 = !DILocation(line: 110, column: 18, scope: !508)
!535 = !DILocation(line: 110, column: 52, scope: !508)
!536 = !DILocation(line: 110, column: 9, scope: !508)
!537 = !DILocalVariable(name: "application_message", scope: !508, file: !393, line: 113, type: !538)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 2048, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 256)
!541 = !DILocation(line: 113, column: 14, scope: !508)
!542 = !DILocation(line: 114, column: 18, scope: !508)
!543 = !DILocation(line: 114, column: 86, scope: !508)
!544 = !DILocation(line: 114, column: 9, scope: !508)
!545 = !DILocation(line: 115, column: 41, scope: !508)
!546 = !DILocation(line: 115, column: 50, scope: !508)
!547 = !DILocation(line: 115, column: 9, scope: !508)
!548 = !DILocation(line: 118, column: 31, scope: !508)
!549 = !DILocation(line: 118, column: 38, scope: !508)
!550 = !DILocation(line: 118, column: 66, scope: !508)
!551 = !DILocation(line: 118, column: 59, scope: !508)
!552 = !DILocation(line: 118, column: 87, scope: !508)
!553 = !DILocation(line: 118, column: 9, scope: !508)
!554 = !DILocation(line: 121, column: 20, scope: !555)
!555 = distinct !DILexicalBlock(scope: !508, file: !393, line: 121, column: 13)
!556 = !DILocation(line: 121, column: 26, scope: !555)
!557 = !DILocation(line: 121, column: 13, scope: !508)
!558 = !DILocation(line: 122, column: 21, scope: !559)
!559 = distinct !DILexicalBlock(scope: !555, file: !393, line: 121, column: 38)
!560 = !DILocation(line: 122, column: 66, scope: !559)
!561 = !DILocation(line: 122, column: 44, scope: !559)
!562 = !DILocation(line: 122, column: 13, scope: !559)
!563 = !DILocation(line: 123, column: 40, scope: !559)
!564 = !DILocation(line: 123, column: 13, scope: !559)
!565 = !DILocation(line: 124, column: 9, scope: !559)
!566 = distinct !{!566, !503, !567, !377}
!567 = !DILocation(line: 125, column: 5, scope: !392)
!568 = !DILocation(line: 128, column: 44, scope: !392)
!569 = !DILocation(line: 128, column: 53, scope: !392)
!570 = !DILocation(line: 128, column: 5, scope: !392)
!571 = !DILocation(line: 129, column: 5, scope: !392)
!572 = !DILocation(line: 132, column: 32, scope: !392)
!573 = !DILocation(line: 132, column: 5, scope: !392)
!574 = !DILocation(line: 133, column: 1, scope: !392)
!575 = distinct !DISubprogram(name: "exit_example", scope: !393, file: !393, line: 135, type: !576, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !272)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !7, !7, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!579 = !DILocalVariable(name: "status", arg: 1, scope: !575, file: !393, line: 135, type: !7)
!580 = !DILocation(line: 135, column: 23, scope: !575)
!581 = !DILocalVariable(name: "sockfd", arg: 2, scope: !575, file: !393, line: 135, type: !7)
!582 = !DILocation(line: 135, column: 35, scope: !575)
!583 = !DILocalVariable(name: "client_daemon", arg: 3, scope: !575, file: !393, line: 135, type: !578)
!584 = !DILocation(line: 135, column: 54, scope: !575)
!585 = !DILocation(line: 137, column: 9, scope: !586)
!586 = distinct !DILexicalBlock(scope: !575, file: !393, line: 137, column: 9)
!587 = !DILocation(line: 137, column: 16, scope: !586)
!588 = !DILocation(line: 137, column: 9, scope: !575)
!589 = !DILocation(line: 137, column: 29, scope: !586)
!590 = !DILocation(line: 137, column: 23, scope: !586)
!591 = !DILocation(line: 138, column: 9, scope: !592)
!592 = distinct !DILexicalBlock(scope: !575, file: !393, line: 138, column: 9)
!593 = !DILocation(line: 138, column: 23, scope: !592)
!594 = !DILocation(line: 138, column: 9, scope: !575)
!595 = !DILocation(line: 138, column: 48, scope: !592)
!596 = !DILocation(line: 138, column: 47, scope: !592)
!597 = !DILocation(line: 138, column: 32, scope: !592)
!598 = !DILocation(line: 139, column: 10, scope: !575)
!599 = !DILocation(line: 139, column: 5, scope: !575)
!600 = distinct !DISubprogram(name: "publish_callback", scope: !393, file: !393, line: 144, type: !179, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !272)
!601 = !DILocalVariable(name: "unused", arg: 1, scope: !600, file: !393, line: 144, type: !181)
!602 = !DILocation(line: 144, column: 30, scope: !600)
!603 = !DILocalVariable(name: "published", arg: 2, scope: !600, file: !393, line: 144, type: !182)
!604 = !DILocation(line: 144, column: 68, scope: !600)
!605 = !DILocation(line: 147, column: 1, scope: !600)
!606 = distinct !DISubprogram(name: "client_refresher", scope: !393, file: !393, line: 149, type: !607, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !272)
!607 = !DISubroutineType(types: !608)
!608 = !{!95, !95}
!609 = !DILocalVariable(name: "client", arg: 1, scope: !606, file: !393, line: 149, type: !95)
!610 = !DILocation(line: 149, column: 30, scope: !606)
!611 = !DILocation(line: 151, column: 5, scope: !606)
!612 = !DILocation(line: 153, column: 41, scope: !613)
!613 = distinct !DILexicalBlock(scope: !606, file: !393, line: 152, column: 5)
!614 = !DILocation(line: 153, column: 19, scope: !613)
!615 = !DILocation(line: 153, column: 9, scope: !613)
!616 = !DILocation(line: 154, column: 9, scope: !613)
!617 = distinct !{!617, !611, !618}
!618 = !DILocation(line: 155, column: 5, scope: !606)
!619 = distinct !DISubprogram(name: "mqtt_sync", scope: !135, file: !135, line: 35, type: !620, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !272)
!620 = !DISubroutineType(types: !621)
!621 = !{!5, !622}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_client", file: !6, line: 1093, size: 1664, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !650, !651, !653, !657, !658, !665, !689}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "socketfd", scope: !623, file: !6, line: 1095, baseType: !123, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "pid_lfsr", scope: !623, file: !6, line: 1098, baseType: !120, size: 16, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !623, file: !6, line: 1101, baseType: !120, size: 16, offset: 48)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_keep_alives", scope: !623, file: !6, line: 1107, baseType: !7, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "send_offset", scope: !623, file: !6, line: 1114, baseType: !107, size: 64, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "time_of_last_send", scope: !623, file: !6, line: 1123, baseType: !112, size: 64, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !623, file: !6, line: 1133, baseType: !5, size: 32, offset: 256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !623, file: !6, line: 1143, baseType: !7, size: 32, offset: 288)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_timeouts", scope: !623, file: !6, line: 1146, baseType: !7, size: 32, offset: 320)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "typical_response_time", scope: !623, file: !6, line: 1154, baseType: !128, size: 64, offset: 384)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "publish_response_callback", scope: !623, file: !6, line: 1167, baseType: !636, size: 64, offset: 448)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !181, !639}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_publish", file: !6, line: 341, size: 320, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "dup_flag", scope: !640, file: !6, line: 346, baseType: !101, size: 8)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "qos_level", scope: !640, file: !6, line: 355, baseType: !101, size: 8, offset: 8)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "retain_flag", scope: !640, file: !6, line: 358, baseType: !101, size: 8, offset: 16)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "topic_name_size", scope: !640, file: !6, line: 361, baseType: !120, size: 16, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "topic_name", scope: !640, file: !6, line: 368, baseType: !190, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !640, file: !6, line: 371, baseType: !120, size: 16, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "application_message", scope: !640, file: !6, line: 374, baseType: !190, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "application_message_size", scope: !640, file: !6, line: 377, baseType: !107, size: 64, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "publish_response_callback_state", scope: !623, file: !6, line: 1175, baseType: !95, size: 64, offset: 512)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "inspector_callback", scope: !623, file: !6, line: 1192, baseType: !652, size: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_callback", scope: !623, file: !6, line: 1201, baseType: !654, size: 64, offset: 640)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !622, !181}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_state", scope: !623, file: !6, line: 1207, baseType: !95, size: 64, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !623, file: !6, line: 1224, baseType: !659, size: 256, offset: 768)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !623, file: !6, line: 1212, size: 256, elements: !660)
!660 = !{!661, !662, !663, !664}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !659, file: !6, line: 1214, baseType: !100, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !659, file: !6, line: 1217, baseType: !107, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !659, file: !6, line: 1220, baseType: !100, size: 64, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "curr_sz", scope: !659, file: !6, line: 1223, baseType: !107, size: 64, offset: 192)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !623, file: !6, line: 1232, baseType: !666, size: 320, offset: 1024)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "mqtt_pal_mutex_t", file: !113, line: 86, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !215, line: 72, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !215, line: 67, size: 320, elements: !669)
!669 = !{!670, !687, !688}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !668, file: !215, line: 69, baseType: !671, size: 320)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !220, line: 22, size: 320, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !671, file: !220, line: 24, baseType: !7, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !671, file: !220, line: 25, baseType: !40, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !671, file: !220, line: 26, baseType: !7, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !671, file: !220, line: 28, baseType: !40, size: 32, offset: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !671, file: !220, line: 32, baseType: !7, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !671, file: !220, line: 34, baseType: !228, size: 16, offset: 160)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !671, file: !220, line: 35, baseType: !228, size: 16, offset: 176)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !671, file: !220, line: 36, baseType: !681, size: 128, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !232, line: 53, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !232, line: 49, size: 128, elements: !683)
!683 = !{!684, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !682, file: !232, line: 51, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !682, file: !232, line: 52, baseType: !685, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !668, file: !215, line: 70, baseType: !239, size: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !668, file: !215, line: 71, baseType: !117, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "mq", scope: !623, file: !6, line: 1235, baseType: !690, size: 320, offset: 1344)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_message_queue", file: !6, line: 969, size: 320, elements: !691)
!691 = !{!692, !693, !694, !695, !696}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !690, file: !6, line: 975, baseType: !95, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !690, file: !6, line: 978, baseType: !95, size: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !690, file: !6, line: 986, baseType: !100, size: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "curr_sz", scope: !690, file: !6, line: 996, baseType: !107, size: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "queue_tail", scope: !690, file: !6, line: 1003, baseType: !96, size: 64, offset: 256)
!697 = !DILocalVariable(name: "client", arg: 1, scope: !619, file: !135, line: 35, type: !622)
!698 = !DILocation(line: 35, column: 47, scope: !619)
!699 = !DILocalVariable(name: "err", scope: !619, file: !135, line: 37, type: !5)
!700 = !DILocation(line: 37, column: 21, scope: !619)
!701 = !DILocalVariable(name: "reconnecting", scope: !619, file: !135, line: 38, type: !7)
!702 = !DILocation(line: 38, column: 9, scope: !619)
!703 = !DILocation(line: 39, column: 5, scope: !619)
!704 = !DILocation(line: 40, column: 9, scope: !705)
!705 = distinct !DILexicalBlock(scope: !619, file: !135, line: 40, column: 9)
!706 = !DILocation(line: 40, column: 17, scope: !705)
!707 = !DILocation(line: 40, column: 23, scope: !705)
!708 = !DILocation(line: 40, column: 50, scope: !705)
!709 = !DILocation(line: 40, column: 53, scope: !705)
!710 = !DILocation(line: 40, column: 61, scope: !705)
!711 = !DILocation(line: 40, column: 67, scope: !705)
!712 = !DILocation(line: 40, column: 78, scope: !705)
!713 = !DILocation(line: 40, column: 81, scope: !705)
!714 = !DILocation(line: 40, column: 89, scope: !705)
!715 = !DILocation(line: 40, column: 108, scope: !705)
!716 = !DILocation(line: 40, column: 9, scope: !619)
!717 = !DILocation(line: 41, column: 9, scope: !718)
!718 = distinct !DILexicalBlock(scope: !705, file: !135, line: 40, column: 117)
!719 = !DILocation(line: 41, column: 17, scope: !718)
!720 = !DILocation(line: 41, column: 36, scope: !718)
!721 = !DILocation(line: 41, column: 45, scope: !718)
!722 = !DILocation(line: 41, column: 53, scope: !718)
!723 = !DILocation(line: 43, column: 5, scope: !718)
!724 = !DILocation(line: 45, column: 13, scope: !725)
!725 = distinct !DILexicalBlock(scope: !726, file: !135, line: 45, column: 13)
!726 = distinct !DILexicalBlock(scope: !705, file: !135, line: 43, column: 12)
!727 = !DILocation(line: 45, column: 21, scope: !725)
!728 = !DILocation(line: 45, column: 27, scope: !725)
!729 = !DILocation(line: 45, column: 13, scope: !726)
!730 = !DILocation(line: 46, column: 26, scope: !731)
!731 = distinct !DILexicalBlock(scope: !725, file: !135, line: 45, column: 55)
!732 = !DILocation(line: 47, column: 13, scope: !731)
!733 = !DILocation(line: 47, column: 21, scope: !731)
!734 = !DILocation(line: 47, column: 27, scope: !731)
!735 = !DILocation(line: 48, column: 9, scope: !731)
!736 = !DILocation(line: 49, column: 9, scope: !726)
!737 = !DILocation(line: 54, column: 9, scope: !738)
!738 = distinct !DILexicalBlock(scope: !619, file: !135, line: 54, column: 9)
!739 = !DILocation(line: 54, column: 17, scope: !738)
!740 = !DILocation(line: 54, column: 36, scope: !738)
!741 = !DILocation(line: 54, column: 9, scope: !619)
!742 = !DILocation(line: 55, column: 9, scope: !743)
!743 = distinct !DILexicalBlock(scope: !738, file: !135, line: 54, column: 45)
!744 = !DILocation(line: 56, column: 15, scope: !743)
!745 = !DILocation(line: 56, column: 23, scope: !743)
!746 = !DILocation(line: 56, column: 42, scope: !743)
!747 = !DILocation(line: 56, column: 13, scope: !743)
!748 = !DILocation(line: 57, column: 9, scope: !743)
!749 = !DILocation(line: 58, column: 13, scope: !750)
!750 = distinct !DILexicalBlock(scope: !743, file: !135, line: 58, column: 13)
!751 = !DILocation(line: 58, column: 17, scope: !750)
!752 = !DILocation(line: 58, column: 13, scope: !743)
!753 = !DILocation(line: 58, column: 36, scope: !750)
!754 = !DILocation(line: 58, column: 29, scope: !750)
!755 = !DILocation(line: 59, column: 5, scope: !743)
!756 = !DILocation(line: 62, column: 23, scope: !619)
!757 = !DILocation(line: 62, column: 11, scope: !619)
!758 = !DILocation(line: 62, column: 9, scope: !619)
!759 = !DILocation(line: 63, column: 9, scope: !760)
!760 = distinct !DILexicalBlock(scope: !619, file: !135, line: 63, column: 9)
!761 = !DILocation(line: 63, column: 13, scope: !760)
!762 = !DILocation(line: 63, column: 9, scope: !619)
!763 = !DILocation(line: 63, column: 32, scope: !760)
!764 = !DILocation(line: 63, column: 25, scope: !760)
!765 = !DILocation(line: 66, column: 23, scope: !619)
!766 = !DILocation(line: 66, column: 11, scope: !619)
!767 = !DILocation(line: 66, column: 9, scope: !619)
!768 = !DILocation(line: 69, column: 9, scope: !769)
!769 = distinct !DILexicalBlock(scope: !619, file: !135, line: 69, column: 9)
!770 = !DILocation(line: 69, column: 22, scope: !769)
!771 = !DILocation(line: 69, column: 25, scope: !769)
!772 = !DILocation(line: 69, column: 33, scope: !769)
!773 = !DILocation(line: 69, column: 52, scope: !769)
!774 = !DILocation(line: 69, column: 9, scope: !619)
!775 = !DILocation(line: 70, column: 9, scope: !776)
!776 = distinct !DILexicalBlock(scope: !769, file: !135, line: 69, column: 61)
!777 = !DILocation(line: 71, column: 9, scope: !776)
!778 = !DILocation(line: 71, column: 17, scope: !776)
!779 = !DILocation(line: 71, column: 36, scope: !776)
!780 = !DILocation(line: 71, column: 45, scope: !776)
!781 = !DILocation(line: 71, column: 53, scope: !776)
!782 = !DILocation(line: 72, column: 5, scope: !776)
!783 = !DILocation(line: 74, column: 12, scope: !619)
!784 = !DILocation(line: 74, column: 5, scope: !619)
!785 = !DILocation(line: 75, column: 1, scope: !619)
!786 = distinct !DISubprogram(name: "__mqtt_recv", scope: !135, file: !135, line: 640, type: !787, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !272)
!787 = !DISubroutineType(types: !788)
!788 = !{!789, !622}
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !790, line: 108, baseType: !791)
!790 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !104, line: 194, baseType: !117)
!792 = !DILocalVariable(name: "client", arg: 1, scope: !786, file: !135, line: 640, type: !622)
!793 = !DILocation(line: 640, column: 41, scope: !786)
!794 = !DILocalVariable(name: "response", scope: !786, file: !135, line: 642, type: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response", file: !6, line: 505, size: 448, elements: !796)
!796 = !{!797, !803}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_header", scope: !795, file: !6, line: 507, baseType: !798, size: 96)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_fixed_header", file: !6, line: 156, size: 96, elements: !799)
!799 = !{!800, !801, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !798, file: !6, line: 158, baseType: !45, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "control_flags", scope: !798, file: !6, line: 161, baseType: !130, size: 4, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_length", scope: !798, file: !6, line: 164, baseType: !130, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "decoded", scope: !795, file: !6, line: 527, baseType: !804, size: 320, offset: 128)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !795, file: !6, line: 517, size: 320, elements: !805)
!805 = !{!806, !811, !812, !816, !820, !824, !828, !835, !839}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "connack", scope: !804, file: !6, line: 518, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_connack", file: !6, line: 315, size: 64, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "session_present_flag", scope: !807, file: !6, line: 320, baseType: !101, size: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "return_code", scope: !807, file: !6, line: 327, baseType: !69, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "publish", scope: !804, file: !6, line: 519, baseType: !640, size: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "puback", scope: !804, file: !6, line: 520, baseType: !813, size: 16)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_puback", file: !6, line: 389, size: 16, elements: !814)
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !813, file: !6, line: 391, baseType: !120, size: 16)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pubrec", scope: !804, file: !6, line: 521, baseType: !817, size: 16)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_pubrec", file: !6, line: 403, size: 16, elements: !818)
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !817, file: !6, line: 405, baseType: !120, size: 16)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pubrel", scope: !804, file: !6, line: 522, baseType: !821, size: 16)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_pubrel", file: !6, line: 417, size: 16, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !821, file: !6, line: 419, baseType: !120, size: 16)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pubcomp", scope: !804, file: !6, line: 523, baseType: !825, size: 16)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_pubcomp", file: !6, line: 431, size: 16, elements: !826)
!826 = !{!827}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !825, file: !6, line: 433, baseType: !120, size: 16)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "suback", scope: !804, file: !6, line: 524, baseType: !829, size: 192)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_suback", file: !6, line: 459, size: 192, elements: !830)
!830 = !{!831, !832, !834}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !829, file: !6, line: 461, baseType: !120, size: 16)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "return_codes", scope: !829, file: !6, line: 468, baseType: !833, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "num_return_codes", scope: !829, file: !6, line: 471, baseType: !107, size: 64, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "unsuback", scope: !804, file: !6, line: 525, baseType: !836, size: 16)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_unsuback", file: !6, line: 482, size: 16, elements: !837)
!837 = !{!838}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !836, file: !6, line: 484, baseType: !120, size: 16)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pingresp", scope: !804, file: !6, line: 526, baseType: !840, size: 32)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_pingresp", file: !6, line: 497, size: 32, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !840, file: !6, line: 498, baseType: !7, size: 32)
!843 = !DILocation(line: 642, column: 26, scope: !786)
!844 = !DILocalVariable(name: "mqtt_recv_ret", scope: !786, file: !135, line: 643, type: !789)
!845 = !DILocation(line: 643, column: 13, scope: !786)
!846 = !DILocation(line: 644, column: 5, scope: !786)
!847 = !DILocation(line: 647, column: 5, scope: !786)
!848 = !DILocation(line: 647, column: 11, scope: !786)
!849 = !DILocation(line: 647, column: 25, scope: !786)
!850 = !DILocalVariable(name: "rv", scope: !851, file: !135, line: 649, type: !789)
!851 = distinct !DILexicalBlock(scope: !786, file: !135, line: 647, column: 37)
!852 = !DILocation(line: 649, column: 17, scope: !851)
!853 = !DILocalVariable(name: "consumed", scope: !851, file: !135, line: 649, type: !789)
!854 = !DILocation(line: 649, column: 21, scope: !851)
!855 = !DILocalVariable(name: "msg", scope: !851, file: !135, line: 650, type: !96)
!856 = !DILocation(line: 650, column: 37, scope: !851)
!857 = !DILocation(line: 652, column: 31, scope: !851)
!858 = !DILocation(line: 652, column: 39, scope: !851)
!859 = !DILocation(line: 652, column: 49, scope: !851)
!860 = !DILocation(line: 652, column: 57, scope: !851)
!861 = !DILocation(line: 652, column: 69, scope: !851)
!862 = !DILocation(line: 652, column: 75, scope: !851)
!863 = !DILocation(line: 652, column: 83, scope: !851)
!864 = !DILocation(line: 652, column: 95, scope: !851)
!865 = !DILocation(line: 652, column: 14, scope: !851)
!866 = !DILocation(line: 652, column: 12, scope: !851)
!867 = !DILocation(line: 653, column: 13, scope: !868)
!868 = distinct !DILexicalBlock(scope: !851, file: !135, line: 653, column: 13)
!869 = !DILocation(line: 653, column: 16, scope: !868)
!870 = !DILocation(line: 653, column: 13, scope: !851)
!871 = !DILocation(line: 655, column: 29, scope: !872)
!872 = distinct !DILexicalBlock(scope: !868, file: !135, line: 653, column: 21)
!873 = !DILocation(line: 655, column: 13, scope: !872)
!874 = !DILocation(line: 655, column: 21, scope: !872)
!875 = !DILocation(line: 655, column: 27, scope: !872)
!876 = !DILocation(line: 656, column: 13, scope: !872)
!877 = !DILocation(line: 657, column: 20, scope: !872)
!878 = !DILocation(line: 657, column: 13, scope: !872)
!879 = !DILocation(line: 659, column: 41, scope: !880)
!880 = distinct !DILexicalBlock(scope: !868, file: !135, line: 658, column: 16)
!881 = !DILocation(line: 659, column: 13, scope: !880)
!882 = !DILocation(line: 659, column: 21, scope: !880)
!883 = !DILocation(line: 659, column: 33, scope: !880)
!884 = !DILocation(line: 659, column: 38, scope: !880)
!885 = !DILocation(line: 660, column: 44, scope: !880)
!886 = !DILocation(line: 660, column: 13, scope: !880)
!887 = !DILocation(line: 660, column: 21, scope: !880)
!888 = !DILocation(line: 660, column: 33, scope: !880)
!889 = !DILocation(line: 660, column: 41, scope: !880)
!890 = !DILocation(line: 664, column: 52, scope: !851)
!891 = !DILocation(line: 664, column: 60, scope: !851)
!892 = !DILocation(line: 664, column: 72, scope: !851)
!893 = !DILocation(line: 664, column: 83, scope: !851)
!894 = !DILocation(line: 664, column: 91, scope: !851)
!895 = !DILocation(line: 664, column: 103, scope: !851)
!896 = !DILocation(line: 664, column: 110, scope: !851)
!897 = !DILocation(line: 664, column: 118, scope: !851)
!898 = !DILocation(line: 664, column: 130, scope: !851)
!899 = !DILocation(line: 664, column: 108, scope: !851)
!900 = !DILocation(line: 664, column: 20, scope: !851)
!901 = !DILocation(line: 664, column: 18, scope: !851)
!902 = !DILocation(line: 666, column: 13, scope: !903)
!903 = distinct !DILexicalBlock(scope: !851, file: !135, line: 666, column: 13)
!904 = !DILocation(line: 666, column: 22, scope: !903)
!905 = !DILocation(line: 666, column: 13, scope: !851)
!906 = !DILocation(line: 667, column: 29, scope: !907)
!907 = distinct !DILexicalBlock(scope: !903, file: !135, line: 666, column: 27)
!908 = !DILocation(line: 667, column: 13, scope: !907)
!909 = !DILocation(line: 667, column: 21, scope: !907)
!910 = !DILocation(line: 667, column: 27, scope: !907)
!911 = !DILocation(line: 668, column: 13, scope: !907)
!912 = !DILocation(line: 669, column: 20, scope: !907)
!913 = !DILocation(line: 669, column: 13, scope: !907)
!914 = !DILocation(line: 670, column: 20, scope: !915)
!915 = distinct !DILexicalBlock(scope: !903, file: !135, line: 670, column: 20)
!916 = !DILocation(line: 670, column: 29, scope: !915)
!917 = !DILocation(line: 670, column: 20, scope: !903)
!918 = !DILocation(line: 672, column: 17, scope: !919)
!919 = distinct !DILexicalBlock(scope: !920, file: !135, line: 672, column: 17)
!920 = distinct !DILexicalBlock(scope: !915, file: !135, line: 670, column: 35)
!921 = !DILocation(line: 672, column: 25, scope: !919)
!922 = !DILocation(line: 672, column: 37, scope: !919)
!923 = !DILocation(line: 672, column: 45, scope: !919)
!924 = !DILocation(line: 672, column: 17, scope: !920)
!925 = !DILocation(line: 673, column: 17, scope: !926)
!926 = distinct !DILexicalBlock(scope: !919, file: !135, line: 672, column: 51)
!927 = !DILocation(line: 673, column: 25, scope: !926)
!928 = !DILocation(line: 673, column: 31, scope: !926)
!929 = !DILocation(line: 674, column: 17, scope: !926)
!930 = !DILocation(line: 675, column: 17, scope: !926)
!931 = !DILocation(line: 679, column: 13, scope: !920)
!932 = !DILocation(line: 680, column: 13, scope: !920)
!933 = !DILocation(line: 713, column: 26, scope: !851)
!934 = !DILocation(line: 713, column: 39, scope: !851)
!935 = !DILocation(line: 713, column: 9, scope: !851)
!936 = !DILocation(line: 716, column: 37, scope: !937)
!937 = distinct !DILexicalBlock(scope: !851, file: !135, line: 713, column: 53)
!938 = !DILocation(line: 716, column: 45, scope: !937)
!939 = !DILocation(line: 716, column: 23, scope: !937)
!940 = !DILocation(line: 716, column: 21, scope: !937)
!941 = !DILocation(line: 717, column: 21, scope: !942)
!942 = distinct !DILexicalBlock(scope: !937, file: !135, line: 717, column: 21)
!943 = !DILocation(line: 717, column: 25, scope: !942)
!944 = !DILocation(line: 717, column: 21, scope: !937)
!945 = !DILocation(line: 718, column: 21, scope: !946)
!946 = distinct !DILexicalBlock(scope: !942, file: !135, line: 717, column: 34)
!947 = !DILocation(line: 718, column: 29, scope: !946)
!948 = !DILocation(line: 718, column: 35, scope: !946)
!949 = !DILocation(line: 719, column: 35, scope: !946)
!950 = !DILocation(line: 720, column: 21, scope: !946)
!951 = !DILocation(line: 722, column: 17, scope: !937)
!952 = !DILocation(line: 722, column: 22, scope: !937)
!953 = !DILocation(line: 722, column: 28, scope: !937)
!954 = !DILocation(line: 724, column: 59, scope: !937)
!955 = !DILocation(line: 724, column: 77, scope: !937)
!956 = !DILocation(line: 724, column: 82, scope: !937)
!957 = !DILocation(line: 724, column: 75, scope: !937)
!958 = !DILocation(line: 724, column: 49, scope: !937)
!959 = !DILocation(line: 724, column: 17, scope: !937)
!960 = !DILocation(line: 724, column: 25, scope: !937)
!961 = !DILocation(line: 724, column: 47, scope: !937)
!962 = !DILocation(line: 726, column: 30, scope: !963)
!963 = distinct !DILexicalBlock(scope: !937, file: !135, line: 726, column: 21)
!964 = !DILocation(line: 726, column: 38, scope: !963)
!965 = !DILocation(line: 726, column: 46, scope: !963)
!966 = !DILocation(line: 726, column: 58, scope: !963)
!967 = !DILocation(line: 726, column: 21, scope: !937)
!968 = !DILocation(line: 727, column: 34, scope: !969)
!969 = distinct !DILexicalBlock(scope: !970, file: !135, line: 727, column: 25)
!970 = distinct !DILexicalBlock(scope: !963, file: !135, line: 726, column: 84)
!971 = !DILocation(line: 727, column: 42, scope: !969)
!972 = !DILocation(line: 727, column: 50, scope: !969)
!973 = !DILocation(line: 727, column: 62, scope: !969)
!974 = !DILocation(line: 727, column: 25, scope: !970)
!975 = !DILocation(line: 728, column: 25, scope: !976)
!976 = distinct !DILexicalBlock(scope: !969, file: !135, line: 727, column: 107)
!977 = !DILocation(line: 728, column: 33, scope: !976)
!978 = !DILocation(line: 728, column: 39, scope: !976)
!979 = !DILocation(line: 729, column: 39, scope: !976)
!980 = !DILocation(line: 730, column: 21, scope: !976)
!981 = !DILocation(line: 731, column: 25, scope: !982)
!982 = distinct !DILexicalBlock(scope: !969, file: !135, line: 730, column: 28)
!983 = !DILocation(line: 731, column: 33, scope: !982)
!984 = !DILocation(line: 731, column: 39, scope: !982)
!985 = !DILocation(line: 732, column: 39, scope: !982)
!986 = !DILocation(line: 734, column: 21, scope: !970)
!987 = !DILocation(line: 736, column: 17, scope: !937)
!988 = !DILocation(line: 739, column: 30, scope: !989)
!989 = distinct !DILexicalBlock(scope: !937, file: !135, line: 739, column: 21)
!990 = !DILocation(line: 739, column: 38, scope: !989)
!991 = !DILocation(line: 739, column: 46, scope: !989)
!992 = !DILocation(line: 739, column: 21, scope: !989)
!993 = !DILocation(line: 739, column: 56, scope: !989)
!994 = !DILocation(line: 739, column: 21, scope: !937)
!995 = !DILocation(line: 740, column: 40, scope: !996)
!996 = distinct !DILexicalBlock(scope: !989, file: !135, line: 739, column: 62)
!997 = !DILocation(line: 740, column: 57, scope: !996)
!998 = !DILocation(line: 740, column: 65, scope: !996)
!999 = !DILocation(line: 740, column: 73, scope: !996)
!1000 = !DILocation(line: 740, column: 26, scope: !996)
!1001 = !DILocation(line: 740, column: 24, scope: !996)
!1002 = !DILocation(line: 741, column: 25, scope: !1003)
!1003 = distinct !DILexicalBlock(scope: !996, file: !135, line: 741, column: 25)
!1004 = !DILocation(line: 741, column: 28, scope: !1003)
!1005 = !DILocation(line: 741, column: 25, scope: !996)
!1006 = !DILocation(line: 742, column: 41, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1003, file: !135, line: 741, column: 40)
!1008 = !DILocation(line: 742, column: 25, scope: !1007)
!1009 = !DILocation(line: 742, column: 33, scope: !1007)
!1010 = !DILocation(line: 742, column: 39, scope: !1007)
!1011 = !DILocation(line: 743, column: 41, scope: !1007)
!1012 = !DILocation(line: 743, column: 39, scope: !1007)
!1013 = !DILocation(line: 744, column: 25, scope: !1007)
!1014 = !DILocation(line: 746, column: 17, scope: !996)
!1015 = !DILocation(line: 746, column: 37, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !989, file: !135, line: 746, column: 28)
!1017 = !DILocation(line: 746, column: 45, scope: !1016)
!1018 = !DILocation(line: 746, column: 53, scope: !1016)
!1019 = !DILocation(line: 746, column: 28, scope: !1016)
!1020 = !DILocation(line: 746, column: 63, scope: !1016)
!1021 = !DILocation(line: 746, column: 28, scope: !989)
!1022 = !DILocation(line: 748, column: 39, scope: !1023)
!1023 = distinct !DILexicalBlock(scope: !1024, file: !135, line: 748, column: 25)
!1024 = distinct !DILexicalBlock(scope: !1016, file: !135, line: 746, column: 69)
!1025 = !DILocation(line: 748, column: 47, scope: !1023)
!1026 = !DILocation(line: 748, column: 82, scope: !1023)
!1027 = !DILocation(line: 748, column: 90, scope: !1023)
!1028 = !DILocation(line: 748, column: 98, scope: !1023)
!1029 = !DILocation(line: 748, column: 25, scope: !1023)
!1030 = !DILocation(line: 748, column: 109, scope: !1023)
!1031 = !DILocation(line: 748, column: 25, scope: !1024)
!1032 = !DILocation(line: 749, column: 25, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1023, file: !135, line: 748, column: 118)
!1034 = !DILocation(line: 752, column: 40, scope: !1024)
!1035 = !DILocation(line: 752, column: 57, scope: !1024)
!1036 = !DILocation(line: 752, column: 65, scope: !1024)
!1037 = !DILocation(line: 752, column: 73, scope: !1024)
!1038 = !DILocation(line: 752, column: 26, scope: !1024)
!1039 = !DILocation(line: 752, column: 24, scope: !1024)
!1040 = !DILocation(line: 753, column: 25, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1024, file: !135, line: 753, column: 25)
!1042 = !DILocation(line: 753, column: 28, scope: !1041)
!1043 = !DILocation(line: 753, column: 25, scope: !1024)
!1044 = !DILocation(line: 754, column: 41, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1041, file: !135, line: 753, column: 40)
!1046 = !DILocation(line: 754, column: 25, scope: !1045)
!1047 = !DILocation(line: 754, column: 33, scope: !1045)
!1048 = !DILocation(line: 754, column: 39, scope: !1045)
!1049 = !DILocation(line: 755, column: 41, scope: !1045)
!1050 = !DILocation(line: 755, column: 39, scope: !1045)
!1051 = !DILocation(line: 756, column: 25, scope: !1045)
!1052 = !DILocation(line: 758, column: 17, scope: !1024)
!1053 = !DILocation(line: 760, column: 17, scope: !937)
!1054 = !DILocation(line: 760, column: 25, scope: !937)
!1055 = !DILocation(line: 760, column: 52, scope: !937)
!1056 = !DILocation(line: 760, column: 60, scope: !937)
!1057 = !DILocation(line: 760, column: 103, scope: !937)
!1058 = !DILocation(line: 760, column: 111, scope: !937)
!1059 = !DILocation(line: 761, column: 17, scope: !937)
!1060 = !DILocation(line: 764, column: 37, scope: !937)
!1061 = !DILocation(line: 764, column: 45, scope: !937)
!1062 = !DILocation(line: 764, column: 81, scope: !937)
!1063 = !DILocation(line: 764, column: 89, scope: !937)
!1064 = !DILocation(line: 764, column: 96, scope: !937)
!1065 = !DILocation(line: 764, column: 23, scope: !937)
!1066 = !DILocation(line: 764, column: 21, scope: !937)
!1067 = !DILocation(line: 765, column: 21, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !937, file: !135, line: 765, column: 21)
!1069 = !DILocation(line: 765, column: 25, scope: !1068)
!1070 = !DILocation(line: 765, column: 21, scope: !937)
!1071 = !DILocation(line: 766, column: 21, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1068, file: !135, line: 765, column: 34)
!1073 = !DILocation(line: 766, column: 29, scope: !1072)
!1074 = !DILocation(line: 766, column: 35, scope: !1072)
!1075 = !DILocation(line: 767, column: 35, scope: !1072)
!1076 = !DILocation(line: 768, column: 21, scope: !1072)
!1077 = !DILocation(line: 770, column: 17, scope: !937)
!1078 = !DILocation(line: 770, column: 22, scope: !937)
!1079 = !DILocation(line: 770, column: 28, scope: !937)
!1080 = !DILocation(line: 772, column: 58, scope: !937)
!1081 = !DILocation(line: 772, column: 66, scope: !937)
!1082 = !DILocation(line: 772, column: 55, scope: !937)
!1083 = !DILocation(line: 772, column: 109, scope: !937)
!1084 = !DILocation(line: 772, column: 127, scope: !937)
!1085 = !DILocation(line: 772, column: 132, scope: !937)
!1086 = !DILocation(line: 772, column: 125, scope: !937)
!1087 = !DILocation(line: 772, column: 99, scope: !937)
!1088 = !DILocation(line: 772, column: 97, scope: !937)
!1089 = !DILocation(line: 772, column: 89, scope: !937)
!1090 = !DILocation(line: 772, column: 17, scope: !937)
!1091 = !DILocation(line: 772, column: 25, scope: !937)
!1092 = !DILocation(line: 772, column: 47, scope: !937)
!1093 = !DILocation(line: 773, column: 17, scope: !937)
!1094 = !DILocation(line: 776, column: 35, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !937, file: !135, line: 776, column: 21)
!1096 = !DILocation(line: 776, column: 43, scope: !1095)
!1097 = !DILocation(line: 776, column: 78, scope: !1095)
!1098 = !DILocation(line: 776, column: 86, scope: !1095)
!1099 = !DILocation(line: 776, column: 93, scope: !1095)
!1100 = !DILocation(line: 776, column: 21, scope: !1095)
!1101 = !DILocation(line: 776, column: 104, scope: !1095)
!1102 = !DILocation(line: 776, column: 21, scope: !937)
!1103 = !DILocation(line: 777, column: 21, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1095, file: !135, line: 776, column: 113)
!1105 = !DILocation(line: 780, column: 37, scope: !937)
!1106 = !DILocation(line: 780, column: 45, scope: !937)
!1107 = !DILocation(line: 780, column: 81, scope: !937)
!1108 = !DILocation(line: 780, column: 89, scope: !937)
!1109 = !DILocation(line: 780, column: 96, scope: !937)
!1110 = !DILocation(line: 780, column: 23, scope: !937)
!1111 = !DILocation(line: 780, column: 21, scope: !937)
!1112 = !DILocation(line: 781, column: 21, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !937, file: !135, line: 781, column: 21)
!1114 = !DILocation(line: 781, column: 25, scope: !1113)
!1115 = !DILocation(line: 781, column: 21, scope: !937)
!1116 = !DILocation(line: 782, column: 21, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1113, file: !135, line: 781, column: 34)
!1118 = !DILocation(line: 782, column: 29, scope: !1117)
!1119 = !DILocation(line: 782, column: 35, scope: !1117)
!1120 = !DILocation(line: 783, column: 35, scope: !1117)
!1121 = !DILocation(line: 784, column: 21, scope: !1117)
!1122 = !DILocation(line: 786, column: 17, scope: !937)
!1123 = !DILocation(line: 786, column: 22, scope: !937)
!1124 = !DILocation(line: 786, column: 28, scope: !937)
!1125 = !DILocation(line: 788, column: 58, scope: !937)
!1126 = !DILocation(line: 788, column: 66, scope: !937)
!1127 = !DILocation(line: 788, column: 55, scope: !937)
!1128 = !DILocation(line: 788, column: 109, scope: !937)
!1129 = !DILocation(line: 788, column: 127, scope: !937)
!1130 = !DILocation(line: 788, column: 132, scope: !937)
!1131 = !DILocation(line: 788, column: 125, scope: !937)
!1132 = !DILocation(line: 788, column: 99, scope: !937)
!1133 = !DILocation(line: 788, column: 97, scope: !937)
!1134 = !DILocation(line: 788, column: 89, scope: !937)
!1135 = !DILocation(line: 788, column: 17, scope: !937)
!1136 = !DILocation(line: 788, column: 25, scope: !937)
!1137 = !DILocation(line: 788, column: 47, scope: !937)
!1138 = !DILocation(line: 790, column: 36, scope: !937)
!1139 = !DILocation(line: 790, column: 53, scope: !937)
!1140 = !DILocation(line: 790, column: 61, scope: !937)
!1141 = !DILocation(line: 790, column: 68, scope: !937)
!1142 = !DILocation(line: 790, column: 22, scope: !937)
!1143 = !DILocation(line: 790, column: 20, scope: !937)
!1144 = !DILocation(line: 791, column: 21, scope: !1145)
!1145 = distinct !DILexicalBlock(scope: !937, file: !135, line: 791, column: 21)
!1146 = !DILocation(line: 791, column: 24, scope: !1145)
!1147 = !DILocation(line: 791, column: 21, scope: !937)
!1148 = !DILocation(line: 792, column: 37, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1145, file: !135, line: 791, column: 36)
!1150 = !DILocation(line: 792, column: 21, scope: !1149)
!1151 = !DILocation(line: 792, column: 29, scope: !1149)
!1152 = !DILocation(line: 792, column: 35, scope: !1149)
!1153 = !DILocation(line: 793, column: 37, scope: !1149)
!1154 = !DILocation(line: 793, column: 35, scope: !1149)
!1155 = !DILocation(line: 794, column: 21, scope: !1149)
!1156 = !DILocation(line: 796, column: 17, scope: !937)
!1157 = !DILocation(line: 799, column: 37, scope: !937)
!1158 = !DILocation(line: 799, column: 45, scope: !937)
!1159 = !DILocation(line: 799, column: 80, scope: !937)
!1160 = !DILocation(line: 799, column: 88, scope: !937)
!1161 = !DILocation(line: 799, column: 95, scope: !937)
!1162 = !DILocation(line: 799, column: 23, scope: !937)
!1163 = !DILocation(line: 799, column: 21, scope: !937)
!1164 = !DILocation(line: 800, column: 21, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !937, file: !135, line: 800, column: 21)
!1166 = !DILocation(line: 800, column: 25, scope: !1165)
!1167 = !DILocation(line: 800, column: 21, scope: !937)
!1168 = !DILocation(line: 801, column: 21, scope: !1169)
!1169 = distinct !DILexicalBlock(scope: !1165, file: !135, line: 800, column: 34)
!1170 = !DILocation(line: 801, column: 29, scope: !1169)
!1171 = !DILocation(line: 801, column: 35, scope: !1169)
!1172 = !DILocation(line: 802, column: 35, scope: !1169)
!1173 = !DILocation(line: 803, column: 21, scope: !1169)
!1174 = !DILocation(line: 805, column: 17, scope: !937)
!1175 = !DILocation(line: 805, column: 22, scope: !937)
!1176 = !DILocation(line: 805, column: 28, scope: !937)
!1177 = !DILocation(line: 807, column: 58, scope: !937)
!1178 = !DILocation(line: 807, column: 66, scope: !937)
!1179 = !DILocation(line: 807, column: 55, scope: !937)
!1180 = !DILocation(line: 807, column: 109, scope: !937)
!1181 = !DILocation(line: 807, column: 127, scope: !937)
!1182 = !DILocation(line: 807, column: 132, scope: !937)
!1183 = !DILocation(line: 807, column: 125, scope: !937)
!1184 = !DILocation(line: 807, column: 99, scope: !937)
!1185 = !DILocation(line: 807, column: 97, scope: !937)
!1186 = !DILocation(line: 807, column: 89, scope: !937)
!1187 = !DILocation(line: 807, column: 17, scope: !937)
!1188 = !DILocation(line: 807, column: 25, scope: !937)
!1189 = !DILocation(line: 807, column: 47, scope: !937)
!1190 = !DILocation(line: 809, column: 37, scope: !937)
!1191 = !DILocation(line: 809, column: 54, scope: !937)
!1192 = !DILocation(line: 809, column: 62, scope: !937)
!1193 = !DILocation(line: 809, column: 69, scope: !937)
!1194 = !DILocation(line: 809, column: 22, scope: !937)
!1195 = !DILocation(line: 809, column: 20, scope: !937)
!1196 = !DILocation(line: 810, column: 21, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !937, file: !135, line: 810, column: 21)
!1198 = !DILocation(line: 810, column: 24, scope: !1197)
!1199 = !DILocation(line: 810, column: 21, scope: !937)
!1200 = !DILocation(line: 811, column: 37, scope: !1201)
!1201 = distinct !DILexicalBlock(scope: !1197, file: !135, line: 810, column: 36)
!1202 = !DILocation(line: 811, column: 21, scope: !1201)
!1203 = !DILocation(line: 811, column: 29, scope: !1201)
!1204 = !DILocation(line: 811, column: 35, scope: !1201)
!1205 = !DILocation(line: 812, column: 37, scope: !1201)
!1206 = !DILocation(line: 812, column: 35, scope: !1201)
!1207 = !DILocation(line: 813, column: 21, scope: !1201)
!1208 = !DILocation(line: 815, column: 17, scope: !937)
!1209 = !DILocation(line: 818, column: 37, scope: !937)
!1210 = !DILocation(line: 818, column: 45, scope: !937)
!1211 = !DILocation(line: 818, column: 80, scope: !937)
!1212 = !DILocation(line: 818, column: 88, scope: !937)
!1213 = !DILocation(line: 818, column: 96, scope: !937)
!1214 = !DILocation(line: 818, column: 23, scope: !937)
!1215 = !DILocation(line: 818, column: 21, scope: !937)
!1216 = !DILocation(line: 819, column: 21, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !937, file: !135, line: 819, column: 21)
!1218 = !DILocation(line: 819, column: 25, scope: !1217)
!1219 = !DILocation(line: 819, column: 21, scope: !937)
!1220 = !DILocation(line: 820, column: 21, scope: !1221)
!1221 = distinct !DILexicalBlock(scope: !1217, file: !135, line: 819, column: 34)
!1222 = !DILocation(line: 820, column: 29, scope: !1221)
!1223 = !DILocation(line: 820, column: 35, scope: !1221)
!1224 = !DILocation(line: 821, column: 35, scope: !1221)
!1225 = !DILocation(line: 822, column: 21, scope: !1221)
!1226 = !DILocation(line: 824, column: 17, scope: !937)
!1227 = !DILocation(line: 824, column: 22, scope: !937)
!1228 = !DILocation(line: 824, column: 28, scope: !937)
!1229 = !DILocation(line: 826, column: 58, scope: !937)
!1230 = !DILocation(line: 826, column: 66, scope: !937)
!1231 = !DILocation(line: 826, column: 55, scope: !937)
!1232 = !DILocation(line: 826, column: 109, scope: !937)
!1233 = !DILocation(line: 826, column: 127, scope: !937)
!1234 = !DILocation(line: 826, column: 132, scope: !937)
!1235 = !DILocation(line: 826, column: 125, scope: !937)
!1236 = !DILocation(line: 826, column: 99, scope: !937)
!1237 = !DILocation(line: 826, column: 97, scope: !937)
!1238 = !DILocation(line: 826, column: 89, scope: !937)
!1239 = !DILocation(line: 826, column: 17, scope: !937)
!1240 = !DILocation(line: 826, column: 25, scope: !937)
!1241 = !DILocation(line: 826, column: 47, scope: !937)
!1242 = !DILocation(line: 827, column: 17, scope: !937)
!1243 = !DILocation(line: 830, column: 37, scope: !937)
!1244 = !DILocation(line: 830, column: 45, scope: !937)
!1245 = !DILocation(line: 830, column: 83, scope: !937)
!1246 = !DILocation(line: 830, column: 91, scope: !937)
!1247 = !DILocation(line: 830, column: 98, scope: !937)
!1248 = !DILocation(line: 830, column: 23, scope: !937)
!1249 = !DILocation(line: 830, column: 21, scope: !937)
!1250 = !DILocation(line: 831, column: 21, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !937, file: !135, line: 831, column: 21)
!1252 = !DILocation(line: 831, column: 25, scope: !1251)
!1253 = !DILocation(line: 831, column: 21, scope: !937)
!1254 = !DILocation(line: 832, column: 21, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1251, file: !135, line: 831, column: 34)
!1256 = !DILocation(line: 832, column: 29, scope: !1255)
!1257 = !DILocation(line: 832, column: 35, scope: !1255)
!1258 = !DILocation(line: 833, column: 35, scope: !1255)
!1259 = !DILocation(line: 834, column: 21, scope: !1255)
!1260 = !DILocation(line: 836, column: 17, scope: !937)
!1261 = !DILocation(line: 836, column: 22, scope: !937)
!1262 = !DILocation(line: 836, column: 28, scope: !937)
!1263 = !DILocation(line: 838, column: 58, scope: !937)
!1264 = !DILocation(line: 838, column: 66, scope: !937)
!1265 = !DILocation(line: 838, column: 55, scope: !937)
!1266 = !DILocation(line: 838, column: 109, scope: !937)
!1267 = !DILocation(line: 838, column: 127, scope: !937)
!1268 = !DILocation(line: 838, column: 132, scope: !937)
!1269 = !DILocation(line: 838, column: 125, scope: !937)
!1270 = !DILocation(line: 838, column: 99, scope: !937)
!1271 = !DILocation(line: 838, column: 97, scope: !937)
!1272 = !DILocation(line: 838, column: 89, scope: !937)
!1273 = !DILocation(line: 838, column: 17, scope: !937)
!1274 = !DILocation(line: 838, column: 25, scope: !937)
!1275 = !DILocation(line: 838, column: 47, scope: !937)
!1276 = !DILocation(line: 840, column: 30, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !937, file: !135, line: 840, column: 21)
!1278 = !DILocation(line: 840, column: 38, scope: !1277)
!1279 = !DILocation(line: 840, column: 45, scope: !1277)
!1280 = !DILocation(line: 840, column: 21, scope: !1277)
!1281 = !DILocation(line: 840, column: 61, scope: !1277)
!1282 = !DILocation(line: 840, column: 21, scope: !937)
!1283 = !DILocation(line: 841, column: 21, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1277, file: !135, line: 840, column: 85)
!1285 = !DILocation(line: 841, column: 29, scope: !1284)
!1286 = !DILocation(line: 841, column: 35, scope: !1284)
!1287 = !DILocation(line: 842, column: 35, scope: !1284)
!1288 = !DILocation(line: 843, column: 21, scope: !1284)
!1289 = !DILocation(line: 845, column: 17, scope: !937)
!1290 = !DILocation(line: 848, column: 37, scope: !937)
!1291 = !DILocation(line: 848, column: 45, scope: !937)
!1292 = !DILocation(line: 848, column: 85, scope: !937)
!1293 = !DILocation(line: 848, column: 93, scope: !937)
!1294 = !DILocation(line: 848, column: 102, scope: !937)
!1295 = !DILocation(line: 848, column: 23, scope: !937)
!1296 = !DILocation(line: 848, column: 21, scope: !937)
!1297 = !DILocation(line: 849, column: 21, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !937, file: !135, line: 849, column: 21)
!1299 = !DILocation(line: 849, column: 25, scope: !1298)
!1300 = !DILocation(line: 849, column: 21, scope: !937)
!1301 = !DILocation(line: 850, column: 21, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1298, file: !135, line: 849, column: 34)
!1303 = !DILocation(line: 850, column: 29, scope: !1302)
!1304 = !DILocation(line: 850, column: 35, scope: !1302)
!1305 = !DILocation(line: 851, column: 35, scope: !1302)
!1306 = !DILocation(line: 852, column: 21, scope: !1302)
!1307 = !DILocation(line: 854, column: 17, scope: !937)
!1308 = !DILocation(line: 854, column: 22, scope: !937)
!1309 = !DILocation(line: 854, column: 28, scope: !937)
!1310 = !DILocation(line: 856, column: 58, scope: !937)
!1311 = !DILocation(line: 856, column: 66, scope: !937)
!1312 = !DILocation(line: 856, column: 55, scope: !937)
!1313 = !DILocation(line: 856, column: 109, scope: !937)
!1314 = !DILocation(line: 856, column: 127, scope: !937)
!1315 = !DILocation(line: 856, column: 132, scope: !937)
!1316 = !DILocation(line: 856, column: 125, scope: !937)
!1317 = !DILocation(line: 856, column: 99, scope: !937)
!1318 = !DILocation(line: 856, column: 97, scope: !937)
!1319 = !DILocation(line: 856, column: 89, scope: !937)
!1320 = !DILocation(line: 856, column: 17, scope: !937)
!1321 = !DILocation(line: 856, column: 25, scope: !937)
!1322 = !DILocation(line: 856, column: 47, scope: !937)
!1323 = !DILocation(line: 857, column: 17, scope: !937)
!1324 = !DILocation(line: 860, column: 37, scope: !937)
!1325 = !DILocation(line: 860, column: 45, scope: !937)
!1326 = !DILocation(line: 860, column: 23, scope: !937)
!1327 = !DILocation(line: 860, column: 21, scope: !937)
!1328 = !DILocation(line: 861, column: 21, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !937, file: !135, line: 861, column: 21)
!1330 = !DILocation(line: 861, column: 25, scope: !1329)
!1331 = !DILocation(line: 861, column: 21, scope: !937)
!1332 = !DILocation(line: 862, column: 21, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1329, file: !135, line: 861, column: 34)
!1334 = !DILocation(line: 862, column: 29, scope: !1333)
!1335 = !DILocation(line: 862, column: 35, scope: !1333)
!1336 = !DILocation(line: 863, column: 35, scope: !1333)
!1337 = !DILocation(line: 864, column: 21, scope: !1333)
!1338 = !DILocation(line: 866, column: 17, scope: !937)
!1339 = !DILocation(line: 866, column: 22, scope: !937)
!1340 = !DILocation(line: 866, column: 28, scope: !937)
!1341 = !DILocation(line: 868, column: 58, scope: !937)
!1342 = !DILocation(line: 868, column: 66, scope: !937)
!1343 = !DILocation(line: 868, column: 55, scope: !937)
!1344 = !DILocation(line: 868, column: 109, scope: !937)
!1345 = !DILocation(line: 868, column: 127, scope: !937)
!1346 = !DILocation(line: 868, column: 132, scope: !937)
!1347 = !DILocation(line: 868, column: 125, scope: !937)
!1348 = !DILocation(line: 868, column: 99, scope: !937)
!1349 = !DILocation(line: 868, column: 97, scope: !937)
!1350 = !DILocation(line: 868, column: 89, scope: !937)
!1351 = !DILocation(line: 868, column: 17, scope: !937)
!1352 = !DILocation(line: 868, column: 25, scope: !937)
!1353 = !DILocation(line: 868, column: 47, scope: !937)
!1354 = !DILocation(line: 869, column: 17, scope: !937)
!1355 = !DILocation(line: 871, column: 17, scope: !937)
!1356 = !DILocation(line: 871, column: 25, scope: !937)
!1357 = !DILocation(line: 871, column: 31, scope: !937)
!1358 = !DILocation(line: 872, column: 31, scope: !937)
!1359 = !DILocation(line: 873, column: 17, scope: !937)
!1360 = !DILocalVariable(name: "dest", scope: !1361, file: !135, line: 877, type: !95)
!1361 = distinct !DILexicalBlock(scope: !851, file: !135, line: 875, column: 9)
!1362 = !DILocation(line: 877, column: 17, scope: !1361)
!1363 = !DILocation(line: 877, column: 40, scope: !1361)
!1364 = !DILocation(line: 877, column: 48, scope: !1361)
!1365 = !DILocation(line: 877, column: 60, scope: !1361)
!1366 = !DILocalVariable(name: "src", scope: !1361, file: !135, line: 878, type: !95)
!1367 = !DILocation(line: 878, column: 17, scope: !1361)
!1368 = !DILocation(line: 878, column: 40, scope: !1361)
!1369 = !DILocation(line: 878, column: 48, scope: !1361)
!1370 = !DILocation(line: 878, column: 60, scope: !1361)
!1371 = !DILocation(line: 878, column: 72, scope: !1361)
!1372 = !DILocation(line: 878, column: 70, scope: !1361)
!1373 = !DILocalVariable(name: "n", scope: !1361, file: !135, line: 879, type: !107)
!1374 = !DILocation(line: 879, column: 18, scope: !1361)
!1375 = !DILocation(line: 879, column: 22, scope: !1361)
!1376 = !DILocation(line: 879, column: 30, scope: !1361)
!1377 = !DILocation(line: 879, column: 42, scope: !1361)
!1378 = !DILocation(line: 879, column: 49, scope: !1361)
!1379 = !DILocation(line: 879, column: 57, scope: !1361)
!1380 = !DILocation(line: 879, column: 69, scope: !1361)
!1381 = !DILocation(line: 879, column: 47, scope: !1361)
!1382 = !DILocation(line: 879, column: 81, scope: !1361)
!1383 = !DILocation(line: 879, column: 79, scope: !1361)
!1384 = !DILocation(line: 880, column: 19, scope: !1361)
!1385 = !DILocation(line: 880, column: 25, scope: !1361)
!1386 = !DILocation(line: 880, column: 30, scope: !1361)
!1387 = !DILocation(line: 880, column: 11, scope: !1361)
!1388 = !DILocation(line: 881, column: 39, scope: !1361)
!1389 = !DILocation(line: 881, column: 11, scope: !1361)
!1390 = !DILocation(line: 881, column: 19, scope: !1361)
!1391 = !DILocation(line: 881, column: 31, scope: !1361)
!1392 = !DILocation(line: 881, column: 36, scope: !1361)
!1393 = !DILocation(line: 882, column: 42, scope: !1361)
!1394 = !DILocation(line: 882, column: 11, scope: !1361)
!1395 = !DILocation(line: 882, column: 19, scope: !1361)
!1396 = !DILocation(line: 882, column: 31, scope: !1361)
!1397 = !DILocation(line: 882, column: 39, scope: !1361)
!1398 = distinct !{!1398, !847, !1399, !377}
!1399 = !DILocation(line: 884, column: 5, scope: !786)
!1400 = !DILocation(line: 887, column: 5, scope: !786)
!1401 = !DILocation(line: 888, column: 12, scope: !786)
!1402 = !DILocation(line: 888, column: 5, scope: !786)
!1403 = !DILocation(line: 889, column: 1, scope: !786)
!1404 = distinct !DISubprogram(name: "__mqtt_send", scope: !135, file: !135, line: 498, type: !787, scopeLine: 499, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !272)
!1405 = !DILocalVariable(name: "client", arg: 1, scope: !1404, file: !135, line: 498, type: !622)
!1406 = !DILocation(line: 498, column: 41, scope: !1404)
