; ModuleID = 'simple_subscriber.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.Aloja_container = type { i8*, i16, i32 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.anon.0 = type { [16 x i8], [16 x i8], [16 x i8] }
%struct.addrinfo = type { i32, i32, i32, i32, i32, %struct.sockaddr*, i8*, %struct.addrinfo* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.mqtt_client = type { i32, i16, i16, i32, i64, i64, i32, i32, i32, double, void (i8**, %struct.mqtt_response_publish*)*, i8*, i32 (%struct.mqtt_client*)*, void (%struct.mqtt_client*, i8**)*, i8*, %struct.anon, %union.pthread_mutex_t, %struct.mqtt_message_queue }
%struct.mqtt_response_publish = type { i8, i8, i8, i16, i8*, i16, i8*, i64 }
%struct.anon = type { i8*, i64, i8*, i64 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }

!35 = !DIEnumerator(name: "MQTT_ERROR_INVALID_REMAINING_LENGTH", value: -2147483622)
!36 = !DIEnumerator(name: "MQTT_ERROR_CLEAN_SESSION_IS_REQUIRED", value: -2147483621)
!37 = !DIEnumerator(name: "MQTT_ERROR_RECONNECTING", value: -2147483620)
!38 = !DIEnumerator(name: "MQTT_OK", value: 1)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTQueuedMessageState", file: !6, line: 919, baseType: !40, size: 32, elements: !41)
!40 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!41 = !{!42, !43, !44}
!42 = !DIEnumerator(name: "MQTT_QUEUED_UNSENT", value: 0, isUnsigned: true)
!43 = !DIEnumerator(name: "MQTT_QUEUED_AWAITING_ACK", value: 1, isUnsigned: true)
!44 = !DIEnumerator(name: "MQTT_QUEUED_COMPLETE", value: 2, isUnsigned: true)
!45 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTControlPacketType", file: !6, line: 131, baseType: !40, size: 32, elements: !46)
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60}
!47 = !DIEnumerator(name: "MQTT_CONTROL_CONNECT", value: 1, isUnsigned: true)
!48 = !DIEnumerator(name: "MQTT_CONTROL_CONNACK", value: 2, isUnsigned: true)
!49 = !DIEnumerator(name: "MQTT_CONTROL_PUBLISH", value: 3, isUnsigned: true)
!50 = !DIEnumerator(name: "MQTT_CONTROL_PUBACK", value: 4, isUnsigned: true)
!51 = !DIEnumerator(name: "MQTT_CONTROL_PUBREC", value: 5, isUnsigned: true)
!52 = !DIEnumerator(name: "MQTT_CONTROL_PUBREL", value: 6, isUnsigned: true)
!53 = !DIEnumerator(name: "MQTT_CONTROL_PUBCOMP", value: 7, isUnsigned: true)
!54 = !DIEnumerator(name: "MQTT_CONTROL_SUBSCRIBE", value: 8, isUnsigned: true)
!55 = !DIEnumerator(name: "MQTT_CONTROL_SUBACK", value: 9, isUnsigned: true)
!56 = !DIEnumerator(name: "MQTT_CONTROL_UNSUBSCRIBE", value: 10, isUnsigned: true)
!57 = !DIEnumerator(name: "MQTT_CONTROL_UNSUBACK", value: 11, isUnsigned: true)
!58 = !DIEnumerator(name: "MQTT_CONTROL_PINGREQ", value: 12, isUnsigned: true)
!59 = !DIEnumerator(name: "MQTT_CONTROL_PINGRESP", value: 13, isUnsigned: true)
!60 = !DIEnumerator(name: "MQTT_CONTROL_DISCONNECT", value: 14, isUnsigned: true)
!61 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTPublishFlags", file: !6, line: 742, baseType: !40, size: 32, elements: !62)
!62 = !{!63, !64, !65, !66, !67, !68}
!63 = !DIEnumerator(name: "MQTT_PUBLISH_DUP", value: 8, isUnsigned: true)
!64 = !DIEnumerator(name: "MQTT_PUBLISH_QOS_0", value: 0, isUnsigned: true)
!65 = !DIEnumerator(name: "MQTT_PUBLISH_QOS_1", value: 2, isUnsigned: true)
!66 = !DIEnumerator(name: "MQTT_PUBLISH_QOS_2", value: 4, isUnsigned: true)
!67 = !DIEnumerator(name: "MQTT_PUBLISH_QOS_MASK", value: 6, isUnsigned: true)
!68 = !DIEnumerator(name: "MQTT_PUBLISH_RETAIN", value: 1, isUnsigned: true)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTConnackReturnCode", file: !6, line: 298, baseType: !40, size: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !75, !76}
!71 = !DIEnumerator(name: "MQTT_CONNACK_ACCEPTED", value: 0, isUnsigned: true)
!72 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_PROTOCOL_VERSION", value: 1, isUnsigned: true)
!73 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_IDENTIFIER_REJECTED", value: 2, isUnsigned: true)
!74 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_SERVER_UNAVAILABLE", value: 3, isUnsigned: true)
!75 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_BAD_USER_NAME_OR_PASSWORD", value: 4, isUnsigned: true)
!76 = !DIEnumerator(name: "MQTT_CONNACK_REFUSED_NOT_AUTHORIZED", value: 5, isUnsigned: true)
!77 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTSubackReturnCodes", file: !6, line: 444, baseType: !40, size: 32, elements: !78)
!78 = !{!79, !80, !81, !82}
!79 = !DIEnumerator(name: "MQTT_SUBACK_SUCCESS_MAX_QOS_0", value: 0, isUnsigned: true)
!80 = !DIEnumerator(name: "MQTT_SUBACK_SUCCESS_MAX_QOS_1", value: 1, isUnsigned: true)
!81 = !DIEnumerator(name: "MQTT_SUBACK_SUCCESS_MAX_QOS_2", value: 2, isUnsigned: true)
!82 = !DIEnumerator(name: "MQTT_SUBACK_FAILURE", value: 128, isUnsigned: true)
!83 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MQTTConnectFlags", file: !6, line: 674, baseType: !40, size: 32, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93}
!85 = !DIEnumerator(name: "MQTT_CONNECT_RESERVED", value: 1, isUnsigned: true)
!86 = !DIEnumerator(name: "MQTT_CONNECT_CLEAN_SESSION", value: 2, isUnsigned: true)
!87 = !DIEnumerator(name: "MQTT_CONNECT_WILL_FLAG", value: 4, isUnsigned: true)
!88 = !DIEnumerator(name: "MQTT_CONNECT_WILL_QOS_0", value: 0, isUnsigned: true)
!89 = !DIEnumerator(name: "MQTT_CONNECT_WILL_QOS_1", value: 8, isUnsigned: true)
!90 = !DIEnumerator(name: "MQTT_CONNECT_WILL_QOS_2", value: 16, isUnsigned: true)
!91 = !DIEnumerator(name: "MQTT_CONNECT_WILL_RETAIN", value: 32, isUnsigned: true)
!92 = !DIEnumerator(name: "MQTT_CONNECT_PASSWORD", value: 64, isUnsigned: true)
!93 = !DIEnumerator(name: "MQTT_CONNECT_USER_NAME", value: 128, isUnsigned: true)
!94 = !{!95, !96, !123, !124, !112, !127, !128, !129, !101, !120, !69, !130, !107, !100}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_queued_message", file: !6, line: 929, size: 320, elements: !98)
!98 = !{!99, !106, !110, !111, !118, !119}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !97, file: !6, line: 931, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !102, line: 24, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !104, line: 38, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !97, file: !6, line: 934, baseType: !107, size: 64, offset: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.0/include/stddef.h", directory: "")
!109 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !97, file: !6, line: 938, baseType: !39, size: 32, offset: 128)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "time_sent", scope: !97, file: !6, line: 946, baseType: !112, size: 64, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "mqtt_pal_time_t", file: !113, line: 85, baseType: !114)
!113 = !DIFile(filename: "include/mqtt_pal.h", directory: "/home/ryan/git/MQTT-C")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !115, line: 7, baseType: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !104, line: 160, baseType: !117)
!117 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !97, file: !6, line: 951, baseType: !45, size: 32, offset: 256)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !97, file: !6, line: 959, baseType: !120, size: 16, offset: 288)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !102, line: 25, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !104, line: 40, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "mqtt_pal_socket_handle", file: !113, line: 118, baseType: !7)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!127 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!128 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !102, line: 26, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !104, line: 42, baseType: !40)
!132 = !{!0, !133}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "MQTT_ERRORS_STR", scope: !2, file: !135, line: 1765, type: !136, isLocal: true, isDefinition: true)
!135 = !DIFile(filename: "src/mqtt.c", directory: "/home/ryan/git/MQTT-C")
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1856, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 29)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !135, line: 895, size: 384, elements: !140)
!140 = !{!141, !146, !147}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "control_type_is_valid", scope: !139, file: !135, line: 896, baseType: !142, size: 128)
!142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !143, size: 128, elements: !144)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!144 = !{!145}
!145 = !DISubrange(count: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "required_flags", scope: !139, file: !135, line: 897, baseType: !142, size: 128, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "mask_required_flags", scope: !139, file: !135, line: 898, baseType: !142, size: 128, offset: 256)
!148 = distinct !DICompileUnit(language: DW_LANG_C99, file: !149, producer: "Ubuntu clang version 12.0.0-3ubuntu1~21.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !150, retainedTypes: !163, splitDebugInlining: false, nameTableKind: None)
!149 = !DIFile(filename: "/home/ryan/git/MQTT-C/examples/simple_subscriber.c", directory: "/home/ryan/git/MQTT-C/build")
!150 = !{!151, !5, !39, !45, !83}
!151 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !152, line: 24, baseType: !40, size: 32, elements: !153)
!152 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "")
!153 = !{!154, !155, !156, !157, !158, !159, !160, !161, !162}
!154 = !DIEnumerator(name: "SOCK_STREAM", value: 1, isUnsigned: true)
!155 = !DIEnumerator(name: "SOCK_DGRAM", value: 2, isUnsigned: true)
!156 = !DIEnumerator(name: "SOCK_RAW", value: 3, isUnsigned: true)
!157 = !DIEnumerator(name: "SOCK_RDM", value: 4, isUnsigned: true)
!158 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5, isUnsigned: true)
!159 = !DIEnumerator(name: "SOCK_DCCP", value: 6, isUnsigned: true)
!160 = !DIEnumerator(name: "SOCK_PACKET", value: 10, isUnsigned: true)
!161 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288, isUnsigned: true)
!162 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048, isUnsigned: true)
!163 = !{!95, !164, !124, !165}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_client", file: !6, line: 1093, size: 1664, elements: !167)
!167 = !{!168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !196, !197, !201, !205, !206, !213, !244}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "socketfd", scope: !166, file: !6, line: 1095, baseType: !123, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "pid_lfsr", scope: !166, file: !6, line: 1098, baseType: !120, size: 16, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !166, file: !6, line: 1101, baseType: !120, size: 16, offset: 48)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_keep_alives", scope: !166, file: !6, line: 1107, baseType: !7, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "send_offset", scope: !166, file: !6, line: 1114, baseType: !107, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "time_of_last_send", scope: !166, file: !6, line: 1123, baseType: !112, size: 64, offset: 192)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !166, file: !6, line: 1133, baseType: !5, size: 32, offset: 256)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !166, file: !6, line: 1143, baseType: !7, size: 32, offset: 288)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_timeouts", scope: !166, file: !6, line: 1146, baseType: !7, size: 32, offset: 320)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "typical_response_time", scope: !166, file: !6, line: 1154, baseType: !128, size: 64, offset: 384)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "publish_response_callback", scope: !166, file: !6, line: 1167, baseType: !179, size: 64, offset: 448)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{null, !182, !183}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_publish", file: !6, line: 341, size: 320, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !193, !194, !195}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dup_flag", scope: !184, file: !6, line: 346, baseType: !101, size: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "qos_level", scope: !184, file: !6, line: 355, baseType: !101, size: 8, offset: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "retain_flag", scope: !184, file: !6, line: 358, baseType: !101, size: 8, offset: 16)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "topic_name_size", scope: !184, file: !6, line: 361, baseType: !120, size: 16, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "topic_name", scope: !184, file: !6, line: 368, baseType: !191, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !184, file: !6, line: 371, baseType: !120, size: 16, offset: 128)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "application_message", scope: !184, file: !6, line: 374, baseType: !191, size: 64, offset: 192)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "application_message_size", scope: !184, file: !6, line: 377, baseType: !107, size: 64, offset: 256)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "publish_response_callback_state", scope: !166, file: !6, line: 1175, baseType: !95, size: 64, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "inspector_callback", scope: !166, file: !6, line: 1192, baseType: !198, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{!5, !165}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_callback", scope: !166, file: !6, line: 1201, baseType: !202, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !165, !182}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_state", scope: !166, file: !6, line: 1207, baseType: !95, size: 64, offset: 704)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !166, file: !6, line: 1224, baseType: !207, size: 256, offset: 768)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !6, line: 1212, size: 256, elements: !208)
!208 = !{!209, !210, !211, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !207, file: !6, line: 1214, baseType: !100, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !207, file: !6, line: 1217, baseType: !107, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !207, file: !6, line: 1220, baseType: !100, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "curr_sz", scope: !207, file: !6, line: 1223, baseType: !107, size: 64, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !166, file: !6, line: 1232, baseType: !214, size: 320, offset: 1024)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "mqtt_pal_mutex_t", file: !113, line: 86, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !216, line: 72, baseType: !217)
!216 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "")
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !216, line: 67, size: 320, elements: !218)
!218 = !{!219, !239, !243}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !217, file: !216, line: 69, baseType: !220, size: 320)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !221, line: 22, size: 320, elements: !222)
!221 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_mutex.h", directory: "")
!222 = !{!223, !224, !225, !226, !227, !228, !230, !231}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !220, file: !221, line: 24, baseType: !7, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !220, file: !221, line: 25, baseType: !40, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !220, file: !221, line: 26, baseType: !7, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !220, file: !221, line: 28, baseType: !40, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !220, file: !221, line: 32, baseType: !7, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !220, file: !221, line: 34, baseType: !229, size: 16, offset: 160)
!229 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !220, file: !221, line: 35, baseType: !229, size: 16, offset: 176)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !220, file: !221, line: 36, baseType: !232, size: 128, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !233, line: 53, baseType: !234)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h", directory: "")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !233, line: 49, size: 128, elements: !235)
!235 = !{!236, !238}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !234, file: !233, line: 51, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !234, file: !233, line: 52, baseType: !237, size: 64, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !217, file: !216, line: 70, baseType: !240, size: 320)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 320, elements: !241)
!241 = !{!242}
!242 = !DISubrange(count: 40)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !217, file: !216, line: 71, baseType: !117, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "mq", scope: !166, file: !6, line: 1235, baseType: !245, size: 320, offset: 1344)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_message_queue", file: !6, line: 969, size: 320, elements: !246)
!246 = !{!247, !248, !249, !250, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !245, file: !6, line: 975, baseType: !95, size: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !245, file: !6, line: 978, baseType: !95, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !245, file: !6, line: 986, baseType: !100, size: 64, offset: 128)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "curr_sz", scope: !245, file: !6, line: 996, baseType: !107, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "queue_tail", scope: !245, file: !6, line: 1003, baseType: !252, size: 64, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_queued_message", file: !6, line: 929, size: 320, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !253, file: !6, line: 931, baseType: !100, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !253, file: !6, line: 934, baseType: !107, size: 64, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !253, file: !6, line: 938, baseType: !39, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "time_sent", scope: !253, file: !6, line: 946, baseType: !112, size: 64, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !253, file: !6, line: 951, baseType: !45, size: 32, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !253, file: !6, line: 959, baseType: !120, size: 16, offset: 288)
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "Ubuntu clang version 12.0.0-3ubuntu1~21.04.1", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !263, retainedTypes: !264, splitDebugInlining: false, nameTableKind: None)
!262 = !DIFile(filename: "/home/ryan/git/MQTT-C/src/mqtt_pal.c", directory: "/home/ryan/git/MQTT-C/build")
!263 = !{!5}
!264 = !{!107}
!265 = !{!"Ubuntu clang version 12.0.0-3ubuntu1~21.04.1"}
!266 = !{i32 7, !"Dwarf Version", i32 4}
!267 = !{i32 2, !"Debug Info Version", i32 3}
!268 = !{i32 1, !"wchar_size", i32 4}
!269 = distinct !DISubprogram(name: "open_nb_socket", scope: !270, file: !270, line: 18, type: !271, scopeLine: 18, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !273)
!270 = !DIFile(filename: "examples/templates/posix_sockets.h", directory: "/home/ryan/git/MQTT-C")
!271 = !DISubroutineType(types: !272)
!272 = !{!7, !124, !124}
!273 = !{}
!274 = !DILocalVariable(name: "addr", arg: 1, scope: !269, file: !270, line: 18, type: !124)
!275 = !DILocation(line: 18, column: 32, scope: !269)
!276 = !DILocalVariable(name: "port", arg: 2, scope: !269, file: !270, line: 18, type: !124)
!277 = !DILocation(line: 18, column: 50, scope: !269)
!278 = !DILocalVariable(name: "hints", scope: !269, file: !270, line: 19, type: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !280, line: 565, size: 384, elements: !281)
!280 = !DIFile(filename: "/usr/include/netdb.h", directory: "")
!281 = !{!282, !283, !284, !285, !286, !290, !302, !303}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !279, file: !280, line: 567, baseType: !7, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !279, file: !280, line: 568, baseType: !7, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !279, file: !280, line: 569, baseType: !7, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !279, file: !280, line: 570, baseType: !7, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !279, file: !280, line: 571, baseType: !287, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !288, line: 274, baseType: !289)
!288 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !104, line: 210, baseType: !40)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !279, file: !280, line: 572, baseType: !291, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !293, line: 178, size: 128, elements: !294)
!293 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "")
!294 = !{!295, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !292, file: !293, line: 180, baseType: !296, size: 16)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !297, line: 28, baseType: !122)
!297 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "")
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !292, file: !293, line: 181, baseType: !299, size: 112, offset: 16)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 112, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 14)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !279, file: !280, line: 573, baseType: !164, size: 64, offset: 256)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !279, file: !280, line: 574, baseType: !304, size: 64, offset: 320)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!305 = !DILocation(line: 19, column: 21, scope: !269)
!306 = !DILocation(line: 21, column: 11, scope: !269)
!307 = !DILocation(line: 21, column: 21, scope: !269)
!308 = !DILocation(line: 22, column: 11, scope: !269)
!309 = !DILocation(line: 22, column: 23, scope: !269)
!310 = !DILocalVariable(name: "sockfd", scope: !269, file: !270, line: 23, type: !7)
!311 = !DILocation(line: 23, column: 9, scope: !269)
!312 = !DILocalVariable(name: "rv", scope: !269, file: !270, line: 24, type: !7)
!313 = !DILocation(line: 24, column: 9, scope: !269)
!314 = !DILocalVariable(name: "p", scope: !269, file: !270, line: 25, type: !304)
!315 = !DILocation(line: 25, column: 22, scope: !269)
!316 = !DILocalVariable(name: "servinfo", scope: !269, file: !270, line: 25, type: !304)
!317 = !DILocation(line: 25, column: 26, scope: !269)
!318 = !DILocation(line: 28, column: 22, scope: !269)
!319 = !DILocation(line: 28, column: 28, scope: !269)
!320 = !DILocation(line: 28, column: 10, scope: !269)
!321 = !DILocation(line: 28, column: 8, scope: !269)
!322 = !DILocation(line: 29, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !269, file: !270, line: 29, column: 8)
!324 = !DILocation(line: 29, column: 11, scope: !323)
!325 = !DILocation(line: 29, column: 8, scope: !269)
!326 = !DILocation(line: 30, column: 17, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !270, line: 29, column: 17)
!328 = !DILocation(line: 30, column: 83, scope: !327)
!329 = !DILocation(line: 30, column: 70, scope: !327)
!330 = !DILocation(line: 30, column: 9, scope: !327)
!331 = !DILocation(line: 31, column: 9, scope: !327)
!332 = !DILocation(line: 35, column: 13, scope: !333)
!333 = distinct !DILexicalBlock(scope: !269, file: !270, line: 35, column: 5)
!334 = !DILocation(line: 35, column: 11, scope: !333)
!335 = !DILocation(line: 35, column: 9, scope: !333)
!336 = !DILocation(line: 35, column: 23, scope: !337)
!337 = distinct !DILexicalBlock(scope: !333, file: !270, line: 35, column: 5)
!338 = !DILocation(line: 35, column: 25, scope: !337)
!339 = !DILocation(line: 35, column: 5, scope: !333)
!340 = !DILocation(line: 36, column: 25, scope: !341)
!341 = distinct !DILexicalBlock(scope: !337, file: !270, line: 35, column: 50)
!342 = !DILocation(line: 36, column: 28, scope: !341)
!343 = !DILocation(line: 36, column: 39, scope: !341)
!344 = !DILocation(line: 36, column: 42, scope: !341)
!345 = !DILocation(line: 36, column: 55, scope: !341)
!346 = !DILocation(line: 36, column: 58, scope: !341)
!347 = !DILocation(line: 36, column: 18, scope: !341)
!348 = !DILocation(line: 36, column: 16, scope: !341)
!349 = !DILocation(line: 37, column: 13, scope: !350)
!350 = distinct !DILexicalBlock(scope: !341, file: !270, line: 37, column: 13)
!351 = !DILocation(line: 37, column: 20, scope: !350)
!352 = !DILocation(line: 37, column: 13, scope: !341)
!353 = !DILocation(line: 37, column: 27, scope: !350)
!354 = !DILocation(line: 40, column: 22, scope: !341)
!355 = !DILocation(line: 40, column: 30, scope: !341)
!356 = !DILocation(line: 40, column: 33, scope: !341)
!357 = !DILocation(line: 40, column: 42, scope: !341)
!358 = !DILocation(line: 40, column: 45, scope: !341)
!359 = !DILocation(line: 40, column: 14, scope: !341)
!360 = !DILocation(line: 40, column: 12, scope: !341)
!361 = !DILocation(line: 41, column: 12, scope: !362)
!362 = distinct !DILexicalBlock(scope: !341, file: !270, line: 41, column: 12)
!363 = !DILocation(line: 41, column: 15, scope: !362)
!364 = !DILocation(line: 41, column: 12, scope: !341)
!365 = !DILocation(line: 42, column: 17, scope: !366)
!366 = distinct !DILexicalBlock(scope: !362, file: !270, line: 41, column: 22)
!367 = !DILocation(line: 42, column: 11, scope: !366)
!368 = !DILocation(line: 43, column: 18, scope: !366)
!369 = !DILocation(line: 44, column: 11, scope: !366)
!370 = !DILocation(line: 46, column: 9, scope: !341)
!371 = !DILocation(line: 35, column: 38, scope: !337)
!372 = !DILocation(line: 35, column: 41, scope: !337)
!373 = !DILocation(line: 35, column: 36, scope: !337)
!374 = !DILocation(line: 35, column: 5, scope: !337)
!375 = distinct !{!375, !339, !376, !377}
!376 = !DILocation(line: 47, column: 5, scope: !333)
!377 = !{!"llvm.loop.mustprogress"}
!378 = !DILocation(line: 50, column: 18, scope: !269)
!379 = !DILocation(line: 50, column: 5, scope: !269)
!380 = !DILocation(line: 54, column: 9, scope: !381)
!381 = distinct !DILexicalBlock(scope: !269, file: !270, line: 54, column: 9)
!382 = !DILocation(line: 54, column: 16, scope: !381)
!383 = !DILocation(line: 54, column: 9, scope: !269)
!384 = !DILocation(line: 54, column: 29, scope: !381)
!385 = !DILocation(line: 54, column: 52, scope: !381)
!386 = !DILocation(line: 54, column: 46, scope: !381)
!387 = !DILocation(line: 54, column: 69, scope: !381)
!388 = !DILocation(line: 54, column: 23, scope: !381)
!389 = !DILocation(line: 72, column: 12, scope: !269)
!390 = !DILocation(line: 72, column: 5, scope: !269)
!391 = !DILocation(line: 73, column: 1, scope: !269)
!392 = distinct !DISubprogram(name: "main", scope: !393, file: !393, line: 34, type: !394, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !273)
!393 = !DIFile(filename: "examples/simple_subscriber.c", directory: "/home/ryan/git/MQTT-C")
!394 = !DISubroutineType(types: !395)
!395 = !{!7, !7, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!397 = !DILocalVariable(name: "argc", arg: 1, scope: !392, file: !393, line: 34, type: !7)
!398 = !DILocation(line: 34, column: 14, scope: !392)
!399 = !DILocalVariable(name: "argv", arg: 2, scope: !392, file: !393, line: 34, type: !396)
!400 = !DILocation(line: 34, column: 32, scope: !392)
!401 = !DILocalVariable(name: "addr", scope: !392, file: !393, line: 36, type: !124)
!402 = !DILocation(line: 36, column: 17, scope: !392)
!403 = !DILocalVariable(name: "port", scope: !392, file: !393, line: 37, type: !124)
!404 = !DILocation(line: 37, column: 17, scope: !392)
!405 = !DILocalVariable(name: "topic", scope: !392, file: !393, line: 38, type: !124)
!406 = !DILocation(line: 38, column: 17, scope: !392)
!407 = !DILocation(line: 41, column: 9, scope: !408)
!408 = distinct !DILexicalBlock(scope: !392, file: !393, line: 41, column: 9)
!409 = !DILocation(line: 41, column: 14, scope: !408)
!410 = !DILocation(line: 41, column: 9, scope: !392)
!411 = !DILocation(line: 42, column: 16, scope: !412)
!412 = distinct !DILexicalBlock(scope: !408, file: !393, line: 41, column: 19)
!413 = !DILocation(line: 42, column: 14, scope: !412)
!414 = !DILocation(line: 43, column: 5, scope: !412)
!415 = !DILocation(line: 44, column: 14, scope: !416)
!416 = distinct !DILexicalBlock(scope: !408, file: !393, line: 43, column: 12)
!417 = !DILocation(line: 48, column: 9, scope: !418)
!418 = distinct !DILexicalBlock(scope: !392, file: !393, line: 48, column: 9)
!419 = !DILocation(line: 48, column: 14, scope: !418)
!420 = !DILocation(line: 48, column: 9, scope: !392)
!421 = !DILocation(line: 49, column: 16, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !393, line: 48, column: 19)
!423 = !DILocation(line: 49, column: 14, scope: !422)
!424 = !DILocation(line: 50, column: 5, scope: !422)
!425 = !DILocation(line: 51, column: 14, scope: !426)
!426 = distinct !DILexicalBlock(scope: !418, file: !393, line: 50, column: 12)
!427 = !DILocation(line: 55, column: 9, scope: !428)
!428 = distinct !DILexicalBlock(scope: !392, file: !393, line: 55, column: 9)
!429 = !DILocation(line: 55, column: 14, scope: !428)
!430 = !DILocation(line: 55, column: 9, scope: !392)
!431 = !DILocation(line: 56, column: 17, scope: !432)
!432 = distinct !DILexicalBlock(scope: !428, file: !393, line: 55, column: 19)
!433 = !DILocation(line: 56, column: 15, scope: !432)
!434 = !DILocation(line: 57, column: 5, scope: !432)
!435 = !DILocation(line: 58, column: 15, scope: !436)
!436 = distinct !DILexicalBlock(scope: !428, file: !393, line: 57, column: 12)
!437 = !DILocalVariable(name: "sockfd", scope: !392, file: !393, line: 62, type: !7)
!438 = !DILocation(line: 62, column: 9, scope: !392)
!439 = !DILocation(line: 62, column: 33, scope: !392)
!440 = !DILocation(line: 62, column: 39, scope: !392)
!441 = !DILocation(line: 62, column: 18, scope: !392)
!442 = !DILocation(line: 64, column: 9, scope: !443)
!443 = distinct !DILexicalBlock(scope: !392, file: !393, line: 64, column: 9)
!444 = !DILocation(line: 64, column: 16, scope: !443)
!445 = !DILocation(line: 64, column: 9, scope: !392)
!446 = !DILocation(line: 65, column: 9, scope: !447)
!447 = distinct !DILexicalBlock(scope: !443, file: !393, line: 64, column: 23)
!448 = !DILocation(line: 66, column: 36, scope: !447)
!449 = !DILocation(line: 66, column: 9, scope: !447)
!450 = !DILocation(line: 67, column: 5, scope: !447)
!451 = !DILocalVariable(name: "client", scope: !392, file: !393, line: 70, type: !166)
!452 = !DILocation(line: 70, column: 24, scope: !392)
!453 = !DILocalVariable(name: "sendbuf", scope: !392, file: !393, line: 71, type: !454)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 16384, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 2048)
!457 = !DILocation(line: 71, column: 13, scope: !392)
!458 = !DILocalVariable(name: "recvbuf", scope: !392, file: !393, line: 72, type: !459)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 8192, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 1024)
!462 = !DILocation(line: 72, column: 13, scope: !392)
!463 = !DILocation(line: 73, column: 24, scope: !392)
!464 = !DILocation(line: 73, column: 32, scope: !392)
!465 = !DILocation(line: 73, column: 58, scope: !392)
!466 = !DILocation(line: 73, column: 5, scope: !392)
!467 = !DILocalVariable(name: "client_id", scope: !392, file: !393, line: 75, type: !124)
!468 = !DILocation(line: 75, column: 17, scope: !392)
!469 = !DILocalVariable(name: "connect_flags", scope: !392, file: !393, line: 77, type: !101)
!470 = !DILocation(line: 77, column: 13, scope: !392)
!471 = !DILocation(line: 79, column: 27, scope: !392)
!472 = !DILocation(line: 79, column: 65, scope: !392)
!473 = !DILocation(line: 79, column: 5, scope: !392)
!474 = !DILocation(line: 82, column: 16, scope: !475)
!475 = distinct !DILexicalBlock(scope: !392, file: !393, line: 82, column: 9)
!476 = !DILocation(line: 82, column: 22, scope: !475)
!477 = !DILocation(line: 82, column: 9, scope: !392)
!478 = !DILocation(line: 83, column: 17, scope: !479)
!479 = distinct !DILexicalBlock(scope: !475, file: !393, line: 82, column: 34)
!480 = !DILocation(line: 83, column: 62, scope: !479)
!481 = !DILocation(line: 83, column: 40, scope: !479)
!482 = !DILocation(line: 83, column: 9, scope: !479)
!483 = !DILocation(line: 84, column: 36, scope: !479)
!484 = !DILocation(line: 84, column: 9, scope: !479)
!485 = !DILocation(line: 85, column: 5, scope: !479)
!486 = !DILocalVariable(name: "client_daemon", scope: !392, file: !393, line: 88, type: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !216, line: 27, baseType: !109)
!488 = !DILocation(line: 88, column: 15, scope: !392)
!489 = !DILocation(line: 89, column: 63, scope: !490)
!490 = distinct !DILexicalBlock(scope: !392, file: !393, line: 89, column: 8)
!491 = !DILocation(line: 89, column: 8, scope: !490)
!492 = !DILocation(line: 89, column: 8, scope: !392)
!493 = !DILocation(line: 90, column: 17, scope: !494)
!494 = distinct !DILexicalBlock(scope: !490, file: !393, line: 89, column: 73)
!495 = !DILocation(line: 90, column: 9, scope: !494)
!496 = !DILocation(line: 91, column: 36, scope: !494)
!497 = !DILocation(line: 91, column: 9, scope: !494)
!498 = !DILocation(line: 93, column: 5, scope: !494)
!499 = !DILocation(line: 96, column: 29, scope: !392)
!500 = !DILocation(line: 96, column: 5, scope: !392)
!501 = !DILocation(line: 99, column: 49, scope: !392)
!502 = !DILocation(line: 99, column: 58, scope: !392)
!503 = !DILocation(line: 99, column: 5, scope: !392)
!504 = !DILocation(line: 100, column: 5, scope: !392)
!505 = !DILocation(line: 103, column: 5, scope: !392)
!506 = !DILocation(line: 103, column: 17, scope: !392)
!507 = !DILocation(line: 103, column: 11, scope: !392)
!508 = !DILocation(line: 103, column: 24, scope: !392)
!509 = distinct !{!509, !505, !510, !377}
!510 = !DILocation(line: 103, column: 31, scope: !392)
!511 = !DILocation(line: 106, column: 44, scope: !392)
!512 = !DILocation(line: 106, column: 53, scope: !392)
!513 = !DILocation(line: 106, column: 5, scope: !392)
!514 = !DILocation(line: 107, column: 5, scope: !392)
!515 = !DILocation(line: 110, column: 32, scope: !392)
!516 = !DILocation(line: 110, column: 5, scope: !392)
!517 = !DILocation(line: 111, column: 1, scope: !392)
!518 = distinct !DISubprogram(name: "exit_example", scope: !393, file: !393, line: 113, type: !519, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !273)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !7, !7, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!522 = !DILocalVariable(name: "status", arg: 1, scope: !518, file: !393, line: 113, type: !7)
!523 = !DILocation(line: 113, column: 23, scope: !518)
!524 = !DILocalVariable(name: "sockfd", arg: 2, scope: !518, file: !393, line: 113, type: !7)
!525 = !DILocation(line: 113, column: 35, scope: !518)
!526 = !DILocalVariable(name: "client_daemon", arg: 3, scope: !518, file: !393, line: 113, type: !521)
!527 = !DILocation(line: 113, column: 54, scope: !518)
!528 = !DILocation(line: 115, column: 9, scope: !529)
!529 = distinct !DILexicalBlock(scope: !518, file: !393, line: 115, column: 9)
!530 = !DILocation(line: 115, column: 16, scope: !529)
!531 = !DILocation(line: 115, column: 9, scope: !518)
!532 = !DILocation(line: 115, column: 29, scope: !529)
!533 = !DILocation(line: 115, column: 23, scope: !529)
!534 = !DILocation(line: 116, column: 9, scope: !535)
!535 = distinct !DILexicalBlock(scope: !518, file: !393, line: 116, column: 9)
!536 = !DILocation(line: 116, column: 23, scope: !535)
!537 = !DILocation(line: 116, column: 9, scope: !518)
!538 = !DILocation(line: 116, column: 48, scope: !535)
!539 = !DILocation(line: 116, column: 47, scope: !535)
!540 = !DILocation(line: 116, column: 32, scope: !535)
!541 = !DILocation(line: 117, column: 10, scope: !518)
!542 = !DILocation(line: 117, column: 5, scope: !518)
!543 = distinct !DISubprogram(name: "publish_callback", scope: !393, file: !393, line: 122, type: !180, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !273)
!544 = !DILocalVariable(name: "unused", arg: 1, scope: !543, file: !393, line: 122, type: !182)
!545 = !DILocation(line: 122, column: 30, scope: !543)
!546 = !DILocalVariable(name: "published", arg: 2, scope: !543, file: !393, line: 122, type: !183)
!547 = !DILocation(line: 122, column: 68, scope: !543)
!548 = !DILocalVariable(name: "topic_name", scope: !543, file: !393, line: 125, type: !164)
!549 = !DILocation(line: 125, column: 11, scope: !543)
!550 = !DILocation(line: 125, column: 39, scope: !543)
!551 = !DILocation(line: 125, column: 50, scope: !543)
!552 = !DILocation(line: 125, column: 66, scope: !543)
!553 = !DILocation(line: 125, column: 32, scope: !543)
!554 = !DILocation(line: 126, column: 12, scope: !543)
!555 = !DILocation(line: 126, column: 24, scope: !543)
!556 = !DILocation(line: 126, column: 35, scope: !543)
!557 = !DILocation(line: 126, column: 47, scope: !543)
!558 = !DILocation(line: 126, column: 58, scope: !543)
!559 = !DILocation(line: 126, column: 5, scope: !543)
!560 = !DILocation(line: 127, column: 5, scope: !543)
!561 = !DILocation(line: 127, column: 16, scope: !543)
!562 = !DILocation(line: 127, column: 27, scope: !543)
!563 = !DILocation(line: 127, column: 44, scope: !543)
!564 = !DILocation(line: 129, column: 44, scope: !543)
!565 = !DILocation(line: 129, column: 70, scope: !543)
!566 = !DILocation(line: 129, column: 81, scope: !543)
!567 = !DILocation(line: 129, column: 5, scope: !543)
!568 = !DILocation(line: 131, column: 10, scope: !543)
!569 = !DILocation(line: 131, column: 5, scope: !543)
!570 = !DILocation(line: 132, column: 1, scope: !543)
!571 = distinct !DISubprogram(name: "client_refresher", scope: !393, file: !393, line: 134, type: !572, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !148, retainedNodes: !273)
!572 = !DISubroutineType(types: !573)
!573 = !{!95, !95}
!574 = !DILocalVariable(name: "client", arg: 1, scope: !571, file: !393, line: 134, type: !95)
!575 = !DILocation(line: 134, column: 30, scope: !571)
!576 = !DILocation(line: 136, column: 5, scope: !571)
!577 = !DILocation(line: 138, column: 41, scope: !578)
!578 = distinct !DILexicalBlock(scope: !571, file: !393, line: 137, column: 5)
!579 = !DILocation(line: 138, column: 19, scope: !578)
!580 = !DILocation(line: 138, column: 9, scope: !578)
!581 = !DILocation(line: 139, column: 9, scope: !578)
!582 = distinct !{!582, !576, !583}
!583 = !DILocation(line: 140, column: 5, scope: !571)
!584 = distinct !DISubprogram(name: "mqtt_sync", scope: !135, file: !135, line: 35, type: !585, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !273)
!585 = !DISubroutineType(types: !586)
!586 = !{!5, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_client", file: !6, line: 1093, size: 1664, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !615, !616, !618, !622, !623, !630, !654}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "socketfd", scope: !588, file: !6, line: 1095, baseType: !123, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pid_lfsr", scope: !588, file: !6, line: 1098, baseType: !120, size: 16, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "keep_alive", scope: !588, file: !6, line: 1101, baseType: !120, size: 16, offset: 48)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_keep_alives", scope: !588, file: !6, line: 1107, baseType: !7, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "send_offset", scope: !588, file: !6, line: 1114, baseType: !107, size: 64, offset: 128)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "time_of_last_send", scope: !588, file: !6, line: 1123, baseType: !112, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !588, file: !6, line: 1133, baseType: !5, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "response_timeout", scope: !588, file: !6, line: 1143, baseType: !7, size: 32, offset: 288)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "number_of_timeouts", scope: !588, file: !6, line: 1146, baseType: !7, size: 32, offset: 320)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "typical_response_time", scope: !588, file: !6, line: 1154, baseType: !128, size: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "publish_response_callback", scope: !588, file: !6, line: 1167, baseType: !601, size: 64, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DISubroutineType(types: !603)
!603 = !{null, !182, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_publish", file: !6, line: 341, size: 320, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612, !613, !614}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dup_flag", scope: !605, file: !6, line: 346, baseType: !101, size: 8)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "qos_level", scope: !605, file: !6, line: 355, baseType: !101, size: 8, offset: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "retain_flag", scope: !605, file: !6, line: 358, baseType: !101, size: 8, offset: 16)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "topic_name_size", scope: !605, file: !6, line: 361, baseType: !120, size: 16, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "topic_name", scope: !605, file: !6, line: 368, baseType: !191, size: 64, offset: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !605, file: !6, line: 371, baseType: !120, size: 16, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "application_message", scope: !605, file: !6, line: 374, baseType: !191, size: 64, offset: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "application_message_size", scope: !605, file: !6, line: 377, baseType: !107, size: 64, offset: 256)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "publish_response_callback_state", scope: !588, file: !6, line: 1175, baseType: !95, size: 64, offset: 512)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "inspector_callback", scope: !588, file: !6, line: 1192, baseType: !617, size: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_callback", scope: !588, file: !6, line: 1201, baseType: !619, size: 64, offset: 640)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{null, !587, !182}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "reconnect_state", scope: !588, file: !6, line: 1207, baseType: !95, size: 64, offset: 704)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "recv_buffer", scope: !588, file: !6, line: 1224, baseType: !624, size: 256, offset: 768)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !6, line: 1212, size: 256, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !624, file: !6, line: 1214, baseType: !100, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "mem_size", scope: !624, file: !6, line: 1217, baseType: !107, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !624, file: !6, line: 1220, baseType: !100, size: 64, offset: 128)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "curr_sz", scope: !624, file: !6, line: 1223, baseType: !107, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !588, file: !6, line: 1232, baseType: !631, size: 320, offset: 1024)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "mqtt_pal_mutex_t", file: !113, line: 86, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !216, line: 72, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !216, line: 67, size: 320, elements: !634)
!634 = !{!635, !652, !653}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !633, file: !216, line: 69, baseType: !636, size: 320)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !221, line: 22, size: 320, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !636, file: !221, line: 24, baseType: !7, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !636, file: !221, line: 25, baseType: !40, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !636, file: !221, line: 26, baseType: !7, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !636, file: !221, line: 28, baseType: !40, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !636, file: !221, line: 32, baseType: !7, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !636, file: !221, line: 34, baseType: !229, size: 16, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !636, file: !221, line: 35, baseType: !229, size: 16, offset: 176)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !636, file: !221, line: 36, baseType: !646, size: 128, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !233, line: 53, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !233, line: 49, size: 128, elements: !648)
!648 = !{!649, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !647, file: !233, line: 51, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !647, file: !233, line: 52, baseType: !650, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !633, file: !216, line: 70, baseType: !240, size: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !633, file: !216, line: 71, baseType: !117, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "mq", scope: !588, file: !6, line: 1235, baseType: !655, size: 320, offset: 1344)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_message_queue", file: !6, line: 969, size: 320, elements: !656)
!656 = !{!657, !658, !659, !660, !661}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mem_start", scope: !655, file: !6, line: 975, baseType: !95, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mem_end", scope: !655, file: !6, line: 978, baseType: !95, size: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "curr", scope: !655, file: !6, line: 986, baseType: !100, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "curr_sz", scope: !655, file: !6, line: 996, baseType: !107, size: 64, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "queue_tail", scope: !655, file: !6, line: 1003, baseType: !96, size: 64, offset: 256)
!662 = !DILocalVariable(name: "client", arg: 1, scope: !584, file: !135, line: 35, type: !587)
!663 = !DILocation(line: 35, column: 47, scope: !584)
!664 = !DILocalVariable(name: "err", scope: !584, file: !135, line: 37, type: !5)
!665 = !DILocation(line: 37, column: 21, scope: !584)
!666 = !DILocalVariable(name: "reconnecting", scope: !584, file: !135, line: 38, type: !7)
!667 = !DILocation(line: 38, column: 9, scope: !584)
!668 = !DILocation(line: 39, column: 5, scope: !584)
!669 = !DILocation(line: 40, column: 9, scope: !670)
!670 = distinct !DILexicalBlock(scope: !584, file: !135, line: 40, column: 9)
!671 = !DILocation(line: 40, column: 17, scope: !670)
!672 = !DILocation(line: 40, column: 23, scope: !670)
!673 = !DILocation(line: 40, column: 50, scope: !670)
!674 = !DILocation(line: 40, column: 53, scope: !670)
!675 = !DILocation(line: 40, column: 61, scope: !670)
!676 = !DILocation(line: 40, column: 67, scope: !670)
!677 = !DILocation(line: 40, column: 78, scope: !670)
!678 = !DILocation(line: 40, column: 81, scope: !670)
!679 = !DILocation(line: 40, column: 89, scope: !670)
!680 = !DILocation(line: 40, column: 108, scope: !670)
!681 = !DILocation(line: 40, column: 9, scope: !584)
!682 = !DILocation(line: 41, column: 9, scope: !683)
!683 = distinct !DILexicalBlock(scope: !670, file: !135, line: 40, column: 117)
!684 = !DILocation(line: 41, column: 17, scope: !683)
!685 = !DILocation(line: 41, column: 36, scope: !683)
!686 = !DILocation(line: 41, column: 45, scope: !683)
!687 = !DILocation(line: 41, column: 53, scope: !683)
!688 = !DILocation(line: 43, column: 5, scope: !683)
!689 = !DILocation(line: 45, column: 13, scope: !690)
!690 = distinct !DILexicalBlock(scope: !691, file: !135, line: 45, column: 13)
!691 = distinct !DILexicalBlock(scope: !670, file: !135, line: 43, column: 12)
!692 = !DILocation(line: 45, column: 21, scope: !690)
!693 = !DILocation(line: 45, column: 27, scope: !690)
!694 = !DILocation(line: 45, column: 13, scope: !691)
!695 = !DILocation(line: 46, column: 26, scope: !696)
!696 = distinct !DILexicalBlock(scope: !690, file: !135, line: 45, column: 55)
!697 = !DILocation(line: 47, column: 13, scope: !696)
!698 = !DILocation(line: 47, column: 21, scope: !696)
!699 = !DILocation(line: 47, column: 27, scope: !696)
!700 = !DILocation(line: 48, column: 9, scope: !696)
!701 = !DILocation(line: 49, column: 9, scope: !691)
!702 = !DILocation(line: 54, column: 9, scope: !703)
!703 = distinct !DILexicalBlock(scope: !584, file: !135, line: 54, column: 9)
!704 = !DILocation(line: 54, column: 17, scope: !703)
!705 = !DILocation(line: 54, column: 36, scope: !703)
!706 = !DILocation(line: 54, column: 9, scope: !584)
!707 = !DILocation(line: 55, column: 9, scope: !708)
!708 = distinct !DILexicalBlock(scope: !703, file: !135, line: 54, column: 45)
!709 = !DILocation(line: 56, column: 15, scope: !708)
!710 = !DILocation(line: 56, column: 23, scope: !708)
!711 = !DILocation(line: 56, column: 42, scope: !708)
!712 = !DILocation(line: 56, column: 13, scope: !708)
!713 = !DILocation(line: 57, column: 9, scope: !708)
!714 = !DILocation(line: 58, column: 13, scope: !715)
!715 = distinct !DILexicalBlock(scope: !708, file: !135, line: 58, column: 13)
!716 = !DILocation(line: 58, column: 17, scope: !715)
!717 = !DILocation(line: 58, column: 13, scope: !708)
!718 = !DILocation(line: 58, column: 36, scope: !715)
!719 = !DILocation(line: 58, column: 29, scope: !715)
!720 = !DILocation(line: 59, column: 5, scope: !708)
!721 = !DILocation(line: 62, column: 23, scope: !584)
!722 = !DILocation(line: 62, column: 11, scope: !584)
!723 = !DILocation(line: 62, column: 9, scope: !584)
!724 = !DILocation(line: 63, column: 9, scope: !725)
!725 = distinct !DILexicalBlock(scope: !584, file: !135, line: 63, column: 9)
!726 = !DILocation(line: 63, column: 13, scope: !725)
!727 = !DILocation(line: 63, column: 9, scope: !584)
!728 = !DILocation(line: 63, column: 32, scope: !725)
!729 = !DILocation(line: 63, column: 25, scope: !725)
!730 = !DILocation(line: 66, column: 23, scope: !584)
!731 = !DILocation(line: 66, column: 11, scope: !584)
!732 = !DILocation(line: 66, column: 9, scope: !584)
!733 = !DILocation(line: 69, column: 9, scope: !734)
!734 = distinct !DILexicalBlock(scope: !584, file: !135, line: 69, column: 9)
!735 = !DILocation(line: 69, column: 22, scope: !734)
!736 = !DILocation(line: 69, column: 25, scope: !734)
!737 = !DILocation(line: 69, column: 33, scope: !734)
!738 = !DILocation(line: 69, column: 52, scope: !734)
!739 = !DILocation(line: 69, column: 9, scope: !584)
!740 = !DILocation(line: 70, column: 9, scope: !741)
!741 = distinct !DILexicalBlock(scope: !734, file: !135, line: 69, column: 61)
!742 = !DILocation(line: 71, column: 9, scope: !741)
!743 = !DILocation(line: 71, column: 17, scope: !741)
!744 = !DILocation(line: 71, column: 36, scope: !741)
!745 = !DILocation(line: 71, column: 45, scope: !741)
!746 = !DILocation(line: 71, column: 53, scope: !741)
!747 = !DILocation(line: 72, column: 5, scope: !741)
!748 = !DILocation(line: 74, column: 12, scope: !584)
!749 = !DILocation(line: 74, column: 5, scope: !584)
!750 = !DILocation(line: 75, column: 1, scope: !584)
!751 = distinct !DISubprogram(name: "__mqtt_recv", scope: !135, file: !135, line: 640, type: !752, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !273)
!752 = !DISubroutineType(types: !753)
!753 = !{!754, !587}
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !755, line: 108, baseType: !756)
!755 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !104, line: 194, baseType: !117)
!757 = !DILocalVariable(name: "client", arg: 1, scope: !751, file: !135, line: 640, type: !587)
!758 = !DILocation(line: 640, column: 41, scope: !751)
!759 = !DILocalVariable(name: "response", scope: !751, file: !135, line: 642, type: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response", file: !6, line: 505, size: 448, elements: !761)
!761 = !{!762, !768}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_header", scope: !760, file: !6, line: 507, baseType: !763, size: 96)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_fixed_header", file: !6, line: 156, size: 96, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "control_type", scope: !763, file: !6, line: 158, baseType: !45, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "control_flags", scope: !763, file: !6, line: 161, baseType: !130, size: 4, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_length", scope: !763, file: !6, line: 164, baseType: !130, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "decoded", scope: !760, file: !6, line: 527, baseType: !769, size: 320, offset: 128)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !760, file: !6, line: 517, size: 320, elements: !770)
!770 = !{!771, !776, !777, !781, !785, !789, !793, !800, !804}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "connack", scope: !769, file: !6, line: 518, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_connack", file: !6, line: 315, size: 64, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "session_present_flag", scope: !772, file: !6, line: 320, baseType: !101, size: 8)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "return_code", scope: !772, file: !6, line: 327, baseType: !69, size: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "publish", scope: !769, file: !6, line: 519, baseType: !605, size: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "puback", scope: !769, file: !6, line: 520, baseType: !778, size: 16)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_puback", file: !6, line: 389, size: 16, elements: !779)
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !778, file: !6, line: 391, baseType: !120, size: 16)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "pubrec", scope: !769, file: !6, line: 521, baseType: !782, size: 16)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_pubrec", file: !6, line: 403, size: 16, elements: !783)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !782, file: !6, line: 405, baseType: !120, size: 16)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pubrel", scope: !769, file: !6, line: 522, baseType: !786, size: 16)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_pubrel", file: !6, line: 417, size: 16, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !786, file: !6, line: 419, baseType: !120, size: 16)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pubcomp", scope: !769, file: !6, line: 523, baseType: !790, size: 16)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_pubcomp", file: !6, line: 431, size: 16, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !790, file: !6, line: 433, baseType: !120, size: 16)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "suback", scope: !769, file: !6, line: 524, baseType: !794, size: 192)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_suback", file: !6, line: 459, size: 192, elements: !795)
!795 = !{!796, !797, !799}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !794, file: !6, line: 461, baseType: !120, size: 16)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "return_codes", scope: !794, file: !6, line: 468, baseType: !798, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "num_return_codes", scope: !794, file: !6, line: 471, baseType: !107, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "unsuback", scope: !769, file: !6, line: 525, baseType: !801, size: 16)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_unsuback", file: !6, line: 482, size: 16, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "packet_id", scope: !801, file: !6, line: 484, baseType: !120, size: 16)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "pingresp", scope: !769, file: !6, line: 526, baseType: !805, size: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mqtt_response_pingresp", file: !6, line: 497, size: 32, elements: !806)
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !805, file: !6, line: 498, baseType: !7, size: 32)
!808 = !DILocation(line: 642, column: 26, scope: !751)
!809 = !DILocalVariable(name: "mqtt_recv_ret", scope: !751, file: !135, line: 643, type: !754)
!810 = !DILocation(line: 643, column: 13, scope: !751)
!811 = !DILocation(line: 644, column: 5, scope: !751)
!812 = !DILocation(line: 647, column: 5, scope: !751)
!813 = !DILocation(line: 647, column: 11, scope: !751)
!814 = !DILocation(line: 647, column: 25, scope: !751)
!815 = !DILocalVariable(name: "rv", scope: !816, file: !135, line: 649, type: !754)
!816 = distinct !DILexicalBlock(scope: !751, file: !135, line: 647, column: 37)
!817 = !DILocation(line: 649, column: 17, scope: !816)
!818 = !DILocalVariable(name: "consumed", scope: !816, file: !135, line: 649, type: !754)
!819 = !DILocation(line: 649, column: 21, scope: !816)
!820 = !DILocalVariable(name: "msg", scope: !816, file: !135, line: 650, type: !96)
!821 = !DILocation(line: 650, column: 37, scope: !816)
!822 = !DILocation(line: 652, column: 31, scope: !816)
!823 = !DILocation(line: 652, column: 39, scope: !816)
!824 = !DILocation(line: 652, column: 49, scope: !816)
!825 = !DILocation(line: 652, column: 57, scope: !816)
!826 = !DILocation(line: 652, column: 69, scope: !816)
!827 = !DILocation(line: 652, column: 75, scope: !816)
!828 = !DILocation(line: 652, column: 83, scope: !816)
!829 = !DILocation(line: 652, column: 95, scope: !816)
!830 = !DILocation(line: 652, column: 14, scope: !816)
!831 = !DILocation(line: 652, column: 12, scope: !816)
!832 = !DILocation(line: 653, column: 13, scope: !833)
!833 = distinct !DILexicalBlock(scope: !816, file: !135, line: 653, column: 13)
!834 = !DILocation(line: 653, column: 16, scope: !833)
!835 = !DILocation(line: 653, column: 13, scope: !816)
!836 = !DILocation(line: 655, column: 29, scope: !837)
!837 = distinct !DILexicalBlock(scope: !833, file: !135, line: 653, column: 21)
!838 = !DILocation(line: 655, column: 13, scope: !837)
!839 = !DILocation(line: 655, column: 21, scope: !837)
!840 = !DILocation(line: 655, column: 27, scope: !837)
!841 = !DILocation(line: 656, column: 13, scope: !837)
!842 = !DILocation(line: 657, column: 20, scope: !837)
!843 = !DILocation(line: 657, column: 13, scope: !837)
!844 = !DILocation(line: 659, column: 41, scope: !845)
!845 = distinct !DILexicalBlock(scope: !833, file: !135, line: 658, column: 16)
!846 = !DILocation(line: 659, column: 13, scope: !845)
!847 = !DILocation(line: 659, column: 21, scope: !845)
!848 = !DILocation(line: 659, column: 33, scope: !845)
!849 = !DILocation(line: 659, column: 38, scope: !845)
!850 = !DILocation(line: 660, column: 44, scope: !845)
!851 = !DILocation(line: 660, column: 13, scope: !845)
!852 = !DILocation(line: 660, column: 21, scope: !845)
!853 = !DILocation(line: 660, column: 33, scope: !845)
!854 = !DILocation(line: 660, column: 41, scope: !845)
!855 = !DILocation(line: 664, column: 52, scope: !816)
!856 = !DILocation(line: 664, column: 60, scope: !816)
!857 = !DILocation(line: 664, column: 72, scope: !816)
!858 = !DILocation(line: 664, column: 83, scope: !816)
!859 = !DILocation(line: 664, column: 91, scope: !816)
!860 = !DILocation(line: 664, column: 103, scope: !816)
!861 = !DILocation(line: 664, column: 110, scope: !816)
!862 = !DILocation(line: 664, column: 118, scope: !816)
!863 = !DILocation(line: 664, column: 130, scope: !816)
!864 = !DILocation(line: 664, column: 108, scope: !816)
!865 = !DILocation(line: 664, column: 20, scope: !816)
!866 = !DILocation(line: 664, column: 18, scope: !816)
!867 = !DILocation(line: 666, column: 13, scope: !868)
!868 = distinct !DILexicalBlock(scope: !816, file: !135, line: 666, column: 13)
!869 = !DILocation(line: 666, column: 22, scope: !868)
!870 = !DILocation(line: 666, column: 13, scope: !816)
!871 = !DILocation(line: 667, column: 29, scope: !872)
!872 = distinct !DILexicalBlock(scope: !868, file: !135, line: 666, column: 27)
!873 = !DILocation(line: 667, column: 13, scope: !872)
!874 = !DILocation(line: 667, column: 21, scope: !872)
!875 = !DILocation(line: 667, column: 27, scope: !872)
!876 = !DILocation(line: 668, column: 13, scope: !872)
!877 = !DILocation(line: 669, column: 20, scope: !872)
!878 = !DILocation(line: 669, column: 13, scope: !872)
!879 = !DILocation(line: 670, column: 20, scope: !880)
!880 = distinct !DILexicalBlock(scope: !868, file: !135, line: 670, column: 20)
!881 = !DILocation(line: 670, column: 29, scope: !880)
!882 = !DILocation(line: 670, column: 20, scope: !868)
!883 = !DILocation(line: 672, column: 17, scope: !884)
!884 = distinct !DILexicalBlock(scope: !885, file: !135, line: 672, column: 17)
!885 = distinct !DILexicalBlock(scope: !880, file: !135, line: 670, column: 35)
!886 = !DILocation(line: 672, column: 25, scope: !884)
!887 = !DILocation(line: 672, column: 37, scope: !884)
!888 = !DILocation(line: 672, column: 45, scope: !884)
!889 = !DILocation(line: 672, column: 17, scope: !885)
!890 = !DILocation(line: 673, column: 17, scope: !891)
!891 = distinct !DILexicalBlock(scope: !884, file: !135, line: 672, column: 51)
!892 = !DILocation(line: 673, column: 25, scope: !891)
!893 = !DILocation(line: 673, column: 31, scope: !891)
!894 = !DILocation(line: 674, column: 17, scope: !891)
!895 = !DILocation(line: 675, column: 17, scope: !891)
!896 = !DILocation(line: 679, column: 13, scope: !885)
!897 = !DILocation(line: 680, column: 13, scope: !885)
!898 = !DILocation(line: 713, column: 26, scope: !816)
!899 = !DILocation(line: 713, column: 39, scope: !816)
!900 = !DILocation(line: 713, column: 9, scope: !816)
!901 = !DILocation(line: 716, column: 37, scope: !902)
!902 = distinct !DILexicalBlock(scope: !816, file: !135, line: 713, column: 53)
!903 = !DILocation(line: 716, column: 45, scope: !902)
!904 = !DILocation(line: 716, column: 23, scope: !902)
!905 = !DILocation(line: 716, column: 21, scope: !902)
!906 = !DILocation(line: 717, column: 21, scope: !907)
!907 = distinct !DILexicalBlock(scope: !902, file: !135, line: 717, column: 21)
!908 = !DILocation(line: 717, column: 25, scope: !907)
!909 = !DILocation(line: 717, column: 21, scope: !902)
!910 = !DILocation(line: 718, column: 21, scope: !911)
!911 = distinct !DILexicalBlock(scope: !907, file: !135, line: 717, column: 34)
!912 = !DILocation(line: 718, column: 29, scope: !911)
!913 = !DILocation(line: 718, column: 35, scope: !911)
!914 = !DILocation(line: 719, column: 35, scope: !911)
!915 = !DILocation(line: 720, column: 21, scope: !911)
!916 = !DILocation(line: 722, column: 17, scope: !902)
!917 = !DILocation(line: 722, column: 22, scope: !902)
!918 = !DILocation(line: 722, column: 28, scope: !902)
!919 = !DILocation(line: 724, column: 59, scope: !902)
!920 = !DILocation(line: 724, column: 77, scope: !902)
!921 = !DILocation(line: 724, column: 82, scope: !902)
!922 = !DILocation(line: 724, column: 75, scope: !902)
!923 = !DILocation(line: 724, column: 49, scope: !902)
!924 = !DILocation(line: 724, column: 17, scope: !902)
!925 = !DILocation(line: 724, column: 25, scope: !902)
!926 = !DILocation(line: 724, column: 47, scope: !902)
!927 = !DILocation(line: 726, column: 30, scope: !928)
!928 = distinct !DILexicalBlock(scope: !902, file: !135, line: 726, column: 21)
!929 = !DILocation(line: 726, column: 38, scope: !928)
!930 = !DILocation(line: 726, column: 46, scope: !928)
!931 = !DILocation(line: 726, column: 58, scope: !928)
!932 = !DILocation(line: 726, column: 21, scope: !902)
!933 = !DILocation(line: 727, column: 34, scope: !934)
!934 = distinct !DILexicalBlock(scope: !935, file: !135, line: 727, column: 25)
!935 = distinct !DILexicalBlock(scope: !928, file: !135, line: 726, column: 84)
!936 = !DILocation(line: 727, column: 42, scope: !934)
!937 = !DILocation(line: 727, column: 50, scope: !934)
!938 = !DILocation(line: 727, column: 62, scope: !934)
!939 = !DILocation(line: 727, column: 25, scope: !935)
!940 = !DILocation(line: 728, column: 25, scope: !941)
!941 = distinct !DILexicalBlock(scope: !934, file: !135, line: 727, column: 107)
!942 = !DILocation(line: 728, column: 33, scope: !941)
!943 = !DILocation(line: 728, column: 39, scope: !941)
!944 = !DILocation(line: 729, column: 39, scope: !941)
!945 = !DILocation(line: 730, column: 21, scope: !941)
!946 = !DILocation(line: 731, column: 25, scope: !947)
!947 = distinct !DILexicalBlock(scope: !934, file: !135, line: 730, column: 28)
!948 = !DILocation(line: 731, column: 33, scope: !947)
!949 = !DILocation(line: 731, column: 39, scope: !947)
!950 = !DILocation(line: 732, column: 39, scope: !947)
!951 = !DILocation(line: 734, column: 21, scope: !935)
!952 = !DILocation(line: 736, column: 17, scope: !902)
!953 = !DILocation(line: 739, column: 30, scope: !954)
!954 = distinct !DILexicalBlock(scope: !902, file: !135, line: 739, column: 21)
!955 = !DILocation(line: 739, column: 38, scope: !954)
!956 = !DILocation(line: 739, column: 46, scope: !954)
!957 = !DILocation(line: 739, column: 21, scope: !954)
!958 = !DILocation(line: 739, column: 56, scope: !954)
!959 = !DILocation(line: 739, column: 21, scope: !902)
!960 = !DILocation(line: 740, column: 40, scope: !961)
!961 = distinct !DILexicalBlock(scope: !954, file: !135, line: 739, column: 62)
!962 = !DILocation(line: 740, column: 57, scope: !961)
!963 = !DILocation(line: 740, column: 65, scope: !961)
!964 = !DILocation(line: 740, column: 73, scope: !961)
!965 = !DILocation(line: 740, column: 26, scope: !961)
!966 = !DILocation(line: 740, column: 24, scope: !961)
!967 = !DILocation(line: 741, column: 25, scope: !968)
!968 = distinct !DILexicalBlock(scope: !961, file: !135, line: 741, column: 25)
!969 = !DILocation(line: 741, column: 28, scope: !968)
!970 = !DILocation(line: 741, column: 25, scope: !961)
!971 = !DILocation(line: 742, column: 41, scope: !972)
!972 = distinct !DILexicalBlock(scope: !968, file: !135, line: 741, column: 40)
!973 = !DILocation(line: 742, column: 25, scope: !972)
!974 = !DILocation(line: 742, column: 33, scope: !972)
!975 = !DILocation(line: 742, column: 39, scope: !972)
!976 = !DILocation(line: 743, column: 41, scope: !972)
!977 = !DILocation(line: 743, column: 39, scope: !972)
!978 = !DILocation(line: 744, column: 25, scope: !972)
!979 = !DILocation(line: 746, column: 17, scope: !961)
!980 = !DILocation(line: 746, column: 37, scope: !981)
!981 = distinct !DILexicalBlock(scope: !954, file: !135, line: 746, column: 28)
!982 = !DILocation(line: 746, column: 45, scope: !981)
!983 = !DILocation(line: 746, column: 53, scope: !981)
!984 = !DILocation(line: 746, column: 28, scope: !981)
!985 = !DILocation(line: 746, column: 63, scope: !981)
!986 = !DILocation(line: 746, column: 28, scope: !954)
!987 = !DILocation(line: 748, column: 39, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !135, line: 748, column: 25)
!989 = distinct !DILexicalBlock(scope: !981, file: !135, line: 746, column: 69)
!990 = !DILocation(line: 748, column: 47, scope: !988)
!991 = !DILocation(line: 748, column: 82, scope: !988)
!992 = !DILocation(line: 748, column: 90, scope: !988)
!993 = !DILocation(line: 748, column: 98, scope: !988)
!994 = !DILocation(line: 748, column: 25, scope: !988)
!995 = !DILocation(line: 748, column: 109, scope: !988)
!996 = !DILocation(line: 748, column: 25, scope: !989)
!997 = !DILocation(line: 749, column: 25, scope: !998)
!998 = distinct !DILexicalBlock(scope: !988, file: !135, line: 748, column: 118)
!999 = !DILocation(line: 752, column: 40, scope: !989)
!1000 = !DILocation(line: 752, column: 57, scope: !989)
!1001 = !DILocation(line: 752, column: 65, scope: !989)
!1002 = !DILocation(line: 752, column: 73, scope: !989)
!1003 = !DILocation(line: 752, column: 26, scope: !989)
!1004 = !DILocation(line: 752, column: 24, scope: !989)
!1005 = !DILocation(line: 753, column: 25, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !989, file: !135, line: 753, column: 25)
!1007 = !DILocation(line: 753, column: 28, scope: !1006)
!1008 = !DILocation(line: 753, column: 25, scope: !989)
!1009 = !DILocation(line: 754, column: 41, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1006, file: !135, line: 753, column: 40)
!1011 = !DILocation(line: 754, column: 25, scope: !1010)
!1012 = !DILocation(line: 754, column: 33, scope: !1010)
!1013 = !DILocation(line: 754, column: 39, scope: !1010)
!1014 = !DILocation(line: 755, column: 41, scope: !1010)
!1015 = !DILocation(line: 755, column: 39, scope: !1010)
!1016 = !DILocation(line: 756, column: 25, scope: !1010)
!1017 = !DILocation(line: 758, column: 17, scope: !989)
!1018 = !DILocation(line: 760, column: 17, scope: !902)
!1019 = !DILocation(line: 760, column: 25, scope: !902)
!1020 = !DILocation(line: 760, column: 52, scope: !902)
!1021 = !DILocation(line: 760, column: 60, scope: !902)
!1022 = !DILocation(line: 760, column: 103, scope: !902)
!1023 = !DILocation(line: 760, column: 111, scope: !902)
!1024 = !DILocation(line: 761, column: 17, scope: !902)
!1025 = !DILocation(line: 764, column: 37, scope: !902)
!1026 = !DILocation(line: 764, column: 45, scope: !902)
!1027 = !DILocation(line: 764, column: 81, scope: !902)
!1028 = !DILocation(line: 764, column: 89, scope: !902)
!1029 = !DILocation(line: 764, column: 96, scope: !902)
!1030 = !DILocation(line: 764, column: 23, scope: !902)
!1031 = !DILocation(line: 764, column: 21, scope: !902)
!1032 = !DILocation(line: 765, column: 21, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !902, file: !135, line: 765, column: 21)
!1034 = !DILocation(line: 765, column: 25, scope: !1033)
!1035 = !DILocation(line: 765, column: 21, scope: !902)
!1036 = !DILocation(line: 766, column: 21, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1033, file: !135, line: 765, column: 34)
!1038 = !DILocation(line: 766, column: 29, scope: !1037)
!1039 = !DILocation(line: 766, column: 35, scope: !1037)
!1040 = !DILocation(line: 767, column: 35, scope: !1037)
!1041 = !DILocation(line: 768, column: 21, scope: !1037)
!1042 = !DILocation(line: 770, column: 17, scope: !902)
!1043 = !DILocation(line: 770, column: 22, scope: !902)
!1044 = !DILocation(line: 770, column: 28, scope: !902)
!1045 = !DILocation(line: 772, column: 58, scope: !902)
!1046 = !DILocation(line: 772, column: 66, scope: !902)
!1047 = !DILocation(line: 772, column: 55, scope: !902)
!1048 = !DILocation(line: 772, column: 109, scope: !902)
!1049 = !DILocation(line: 772, column: 127, scope: !902)
!1050 = !DILocation(line: 772, column: 132, scope: !902)
!1051 = !DILocation(line: 772, column: 125, scope: !902)
!1052 = !DILocation(line: 772, column: 99, scope: !902)
!1053 = !DILocation(line: 772, column: 97, scope: !902)
!1054 = !DILocation(line: 772, column: 89, scope: !902)
!1055 = !DILocation(line: 772, column: 17, scope: !902)
!1056 = !DILocation(line: 772, column: 25, scope: !902)
!1057 = !DILocation(line: 772, column: 47, scope: !902)
!1058 = !DILocation(line: 773, column: 17, scope: !902)
!1059 = !DILocation(line: 776, column: 35, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !902, file: !135, line: 776, column: 21)
!1061 = !DILocation(line: 776, column: 43, scope: !1060)
!1062 = !DILocation(line: 776, column: 78, scope: !1060)
!1063 = !DILocation(line: 776, column: 86, scope: !1060)
!1064 = !DILocation(line: 776, column: 93, scope: !1060)
!1065 = !DILocation(line: 776, column: 21, scope: !1060)
!1066 = !DILocation(line: 776, column: 104, scope: !1060)
!1067 = !DILocation(line: 776, column: 21, scope: !902)
!1068 = !DILocation(line: 777, column: 21, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1060, file: !135, line: 776, column: 113)
!1070 = !DILocation(line: 780, column: 37, scope: !902)
!1071 = !DILocation(line: 780, column: 45, scope: !902)
!1072 = !DILocation(line: 780, column: 81, scope: !902)
!1073 = !DILocation(line: 780, column: 89, scope: !902)
!1074 = !DILocation(line: 780, column: 96, scope: !902)
!1075 = !DILocation(line: 780, column: 23, scope: !902)
!1076 = !DILocation(line: 780, column: 21, scope: !902)
!1077 = !DILocation(line: 781, column: 21, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !902, file: !135, line: 781, column: 21)
!1079 = !DILocation(line: 781, column: 25, scope: !1078)
!1080 = !DILocation(line: 781, column: 21, scope: !902)
!1081 = !DILocation(line: 782, column: 21, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !135, line: 781, column: 34)
!1083 = !DILocation(line: 782, column: 29, scope: !1082)
!1084 = !DILocation(line: 782, column: 35, scope: !1082)
!1085 = !DILocation(line: 783, column: 35, scope: !1082)
!1086 = !DILocation(line: 784, column: 21, scope: !1082)
!1087 = !DILocation(line: 786, column: 17, scope: !902)
!1088 = !DILocation(line: 786, column: 22, scope: !902)
!1089 = !DILocation(line: 786, column: 28, scope: !902)
!1090 = !DILocation(line: 788, column: 58, scope: !902)
!1091 = !DILocation(line: 788, column: 66, scope: !902)
!1092 = !DILocation(line: 788, column: 55, scope: !902)
!1093 = !DILocation(line: 788, column: 109, scope: !902)
!1094 = !DILocation(line: 788, column: 127, scope: !902)
!1095 = !DILocation(line: 788, column: 132, scope: !902)
!1096 = !DILocation(line: 788, column: 125, scope: !902)
!1097 = !DILocation(line: 788, column: 99, scope: !902)
!1098 = !DILocation(line: 788, column: 97, scope: !902)
!1099 = !DILocation(line: 788, column: 89, scope: !902)
!1100 = !DILocation(line: 788, column: 17, scope: !902)
!1101 = !DILocation(line: 788, column: 25, scope: !902)
!1102 = !DILocation(line: 788, column: 47, scope: !902)
!1103 = !DILocation(line: 790, column: 36, scope: !902)
!1104 = !DILocation(line: 790, column: 53, scope: !902)
!1105 = !DILocation(line: 790, column: 61, scope: !902)
!1106 = !DILocation(line: 790, column: 68, scope: !902)
!1107 = !DILocation(line: 790, column: 22, scope: !902)
!1108 = !DILocation(line: 790, column: 20, scope: !902)
!1109 = !DILocation(line: 791, column: 21, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !902, file: !135, line: 791, column: 21)
!1111 = !DILocation(line: 791, column: 24, scope: !1110)
!1112 = !DILocation(line: 791, column: 21, scope: !902)
!1113 = !DILocation(line: 792, column: 37, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !1110, file: !135, line: 791, column: 36)
!1115 = !DILocation(line: 792, column: 21, scope: !1114)
!1116 = !DILocation(line: 792, column: 29, scope: !1114)
!1117 = !DILocation(line: 792, column: 35, scope: !1114)
!1118 = !DILocation(line: 793, column: 37, scope: !1114)
!1119 = !DILocation(line: 793, column: 35, scope: !1114)
!1120 = !DILocation(line: 794, column: 21, scope: !1114)
!1121 = !DILocation(line: 796, column: 17, scope: !902)
!1122 = !DILocation(line: 799, column: 37, scope: !902)
!1123 = !DILocation(line: 799, column: 45, scope: !902)
!1124 = !DILocation(line: 799, column: 80, scope: !902)
!1125 = !DILocation(line: 799, column: 88, scope: !902)
!1126 = !DILocation(line: 799, column: 95, scope: !902)
!1127 = !DILocation(line: 799, column: 23, scope: !902)
!1128 = !DILocation(line: 799, column: 21, scope: !902)
!1129 = !DILocation(line: 800, column: 21, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !902, file: !135, line: 800, column: 21)
!1131 = !DILocation(line: 800, column: 25, scope: !1130)
!1132 = !DILocation(line: 800, column: 21, scope: !902)
!1133 = !DILocation(line: 801, column: 21, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1130, file: !135, line: 800, column: 34)
!1135 = !DILocation(line: 801, column: 29, scope: !1134)
!1136 = !DILocation(line: 801, column: 35, scope: !1134)
!1137 = !DILocation(line: 802, column: 35, scope: !1134)
!1138 = !DILocation(line: 803, column: 21, scope: !1134)
!1139 = !DILocation(line: 805, column: 17, scope: !902)
!1140 = !DILocation(line: 805, column: 22, scope: !902)
!1141 = !DILocation(line: 805, column: 28, scope: !902)
!1142 = !DILocation(line: 807, column: 58, scope: !902)
!1143 = !DILocation(line: 807, column: 66, scope: !902)
!1144 = !DILocation(line: 807, column: 55, scope: !902)
!1145 = !DILocation(line: 807, column: 109, scope: !902)
!1146 = !DILocation(line: 807, column: 127, scope: !902)
!1147 = !DILocation(line: 807, column: 132, scope: !902)
!1148 = !DILocation(line: 807, column: 125, scope: !902)
!1149 = !DILocation(line: 807, column: 99, scope: !902)
!1150 = !DILocation(line: 807, column: 97, scope: !902)
!1151 = !DILocation(line: 807, column: 89, scope: !902)
!1152 = !DILocation(line: 807, column: 17, scope: !902)
!1153 = !DILocation(line: 807, column: 25, scope: !902)
!1154 = !DILocation(line: 807, column: 47, scope: !902)
!1155 = !DILocation(line: 809, column: 37, scope: !902)
!1156 = !DILocation(line: 809, column: 54, scope: !902)
!1157 = !DILocation(line: 809, column: 62, scope: !902)
!1158 = !DILocation(line: 809, column: 69, scope: !902)
!1159 = !DILocation(line: 809, column: 22, scope: !902)
!1160 = !DILocation(line: 809, column: 20, scope: !902)
!1161 = !DILocation(line: 810, column: 21, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !902, file: !135, line: 810, column: 21)
!1163 = !DILocation(line: 810, column: 24, scope: !1162)
!1164 = !DILocation(line: 810, column: 21, scope: !902)
!1165 = !DILocation(line: 811, column: 37, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1162, file: !135, line: 810, column: 36)
!1167 = !DILocation(line: 811, column: 21, scope: !1166)
!1168 = !DILocation(line: 811, column: 29, scope: !1166)
!1169 = !DILocation(line: 811, column: 35, scope: !1166)
!1170 = !DILocation(line: 812, column: 37, scope: !1166)
!1171 = !DILocation(line: 812, column: 35, scope: !1166)
!1172 = !DILocation(line: 813, column: 21, scope: !1166)
!1173 = !DILocation(line: 815, column: 17, scope: !902)
!1174 = !DILocation(line: 818, column: 37, scope: !902)
!1175 = !DILocation(line: 818, column: 45, scope: !902)
!1176 = !DILocation(line: 818, column: 80, scope: !902)
!1177 = !DILocation(line: 818, column: 88, scope: !902)
!1178 = !DILocation(line: 818, column: 96, scope: !902)
!1179 = !DILocation(line: 818, column: 23, scope: !902)
!1180 = !DILocation(line: 818, column: 21, scope: !902)
!1181 = !DILocation(line: 819, column: 21, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !902, file: !135, line: 819, column: 21)
!1183 = !DILocation(line: 819, column: 25, scope: !1182)
!1184 = !DILocation(line: 819, column: 21, scope: !902)
!1185 = !DILocation(line: 820, column: 21, scope: !1186)
!1186 = distinct !DILexicalBlock(scope: !1182, file: !135, line: 819, column: 34)
!1187 = !DILocation(line: 820, column: 29, scope: !1186)
!1188 = !DILocation(line: 820, column: 35, scope: !1186)
!1189 = !DILocation(line: 821, column: 35, scope: !1186)
!1190 = !DILocation(line: 822, column: 21, scope: !1186)
!1191 = !DILocation(line: 824, column: 17, scope: !902)
!1192 = !DILocation(line: 824, column: 22, scope: !902)
!1193 = !DILocation(line: 824, column: 28, scope: !902)
!1194 = !DILocation(line: 826, column: 58, scope: !902)
!1195 = !DILocation(line: 826, column: 66, scope: !902)
!1196 = !DILocation(line: 826, column: 55, scope: !902)
!1197 = !DILocation(line: 826, column: 109, scope: !902)
!1198 = !DILocation(line: 826, column: 127, scope: !902)
!1199 = !DILocation(line: 826, column: 132, scope: !902)
!1200 = !DILocation(line: 826, column: 125, scope: !902)
!1201 = !DILocation(line: 826, column: 99, scope: !902)
!1202 = !DILocation(line: 826, column: 97, scope: !902)
!1203 = !DILocation(line: 826, column: 89, scope: !902)
!1204 = !DILocation(line: 826, column: 17, scope: !902)
!1205 = !DILocation(line: 826, column: 25, scope: !902)
!1206 = !DILocation(line: 826, column: 47, scope: !902)
!1207 = !DILocation(line: 827, column: 17, scope: !902)
!1208 = !DILocation(line: 830, column: 37, scope: !902)
!1209 = !DILocation(line: 830, column: 45, scope: !902)
!1210 = !DILocation(line: 830, column: 83, scope: !902)
!1211 = !DILocation(line: 830, column: 91, scope: !902)
!1212 = !DILocation(line: 830, column: 98, scope: !902)
!1213 = !DILocation(line: 830, column: 23, scope: !902)
!1214 = !DILocation(line: 830, column: 21, scope: !902)
!1215 = !DILocation(line: 831, column: 21, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !902, file: !135, line: 831, column: 21)
!1217 = !DILocation(line: 831, column: 25, scope: !1216)
!1218 = !DILocation(line: 831, column: 21, scope: !902)
!1219 = !DILocation(line: 832, column: 21, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1216, file: !135, line: 831, column: 34)
!1221 = !DILocation(line: 832, column: 29, scope: !1220)
!1222 = !DILocation(line: 832, column: 35, scope: !1220)
!1223 = !DILocation(line: 833, column: 35, scope: !1220)
!1224 = !DILocation(line: 834, column: 21, scope: !1220)
!1225 = !DILocation(line: 836, column: 17, scope: !902)
!1226 = !DILocation(line: 836, column: 22, scope: !902)
!1227 = !DILocation(line: 836, column: 28, scope: !902)
!1228 = !DILocation(line: 838, column: 58, scope: !902)
!1229 = !DILocation(line: 838, column: 66, scope: !902)
!1230 = !DILocation(line: 838, column: 55, scope: !902)
!1231 = !DILocation(line: 838, column: 109, scope: !902)
!1232 = !DILocation(line: 838, column: 127, scope: !902)
!1233 = !DILocation(line: 838, column: 132, scope: !902)
!1234 = !DILocation(line: 838, column: 125, scope: !902)
!1235 = !DILocation(line: 838, column: 99, scope: !902)
!1236 = !DILocation(line: 838, column: 97, scope: !902)
!1237 = !DILocation(line: 838, column: 89, scope: !902)
!1238 = !DILocation(line: 838, column: 17, scope: !902)
!1239 = !DILocation(line: 838, column: 25, scope: !902)
!1240 = !DILocation(line: 838, column: 47, scope: !902)
!1241 = !DILocation(line: 840, column: 30, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !902, file: !135, line: 840, column: 21)
!1243 = !DILocation(line: 840, column: 38, scope: !1242)
!1244 = !DILocation(line: 840, column: 45, scope: !1242)
!1245 = !DILocation(line: 840, column: 21, scope: !1242)
!1246 = !DILocation(line: 840, column: 61, scope: !1242)
!1247 = !DILocation(line: 840, column: 21, scope: !902)
!1248 = !DILocation(line: 841, column: 21, scope: !1249)
!1249 = distinct !DILexicalBlock(scope: !1242, file: !135, line: 840, column: 85)
!1250 = !DILocation(line: 841, column: 29, scope: !1249)
!1251 = !DILocation(line: 841, column: 35, scope: !1249)
!1252 = !DILocation(line: 842, column: 35, scope: !1249)
!1253 = !DILocation(line: 843, column: 21, scope: !1249)
!1254 = !DILocation(line: 845, column: 17, scope: !902)
!1255 = !DILocation(line: 848, column: 37, scope: !902)
!1256 = !DILocation(line: 848, column: 45, scope: !902)
!1257 = !DILocation(line: 848, column: 85, scope: !902)
!1258 = !DILocation(line: 848, column: 93, scope: !902)
!1259 = !DILocation(line: 848, column: 102, scope: !902)
!1260 = !DILocation(line: 848, column: 23, scope: !902)
!1261 = !DILocation(line: 848, column: 21, scope: !902)
!1262 = !DILocation(line: 849, column: 21, scope: !1263)
!1263 = distinct !DILexicalBlock(scope: !902, file: !135, line: 849, column: 21)
!1264 = !DILocation(line: 849, column: 25, scope: !1263)
!1265 = !DILocation(line: 849, column: 21, scope: !902)
!1266 = !DILocation(line: 850, column: 21, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1263, file: !135, line: 849, column: 34)
!1268 = !DILocation(line: 850, column: 29, scope: !1267)
!1269 = !DILocation(line: 850, column: 35, scope: !1267)
!1270 = !DILocation(line: 851, column: 35, scope: !1267)
!1271 = !DILocation(line: 852, column: 21, scope: !1267)
!1272 = !DILocation(line: 854, column: 17, scope: !902)
!1273 = !DILocation(line: 854, column: 22, scope: !902)
!1274 = !DILocation(line: 854, column: 28, scope: !902)
!1275 = !DILocation(line: 856, column: 58, scope: !902)
!1276 = !DILocation(line: 856, column: 66, scope: !902)
!1277 = !DILocation(line: 856, column: 55, scope: !902)
!1278 = !DILocation(line: 856, column: 109, scope: !902)
!1279 = !DILocation(line: 856, column: 127, scope: !902)
!1280 = !DILocation(line: 856, column: 132, scope: !902)
!1281 = !DILocation(line: 856, column: 125, scope: !902)
!1282 = !DILocation(line: 856, column: 99, scope: !902)
!1283 = !DILocation(line: 856, column: 97, scope: !902)
!1284 = !DILocation(line: 856, column: 89, scope: !902)
!1285 = !DILocation(line: 856, column: 17, scope: !902)
!1286 = !DILocation(line: 856, column: 25, scope: !902)
!1287 = !DILocation(line: 856, column: 47, scope: !902)
!1288 = !DILocation(line: 857, column: 17, scope: !902)
!1289 = !DILocation(line: 860, column: 37, scope: !902)
!1290 = !DILocation(line: 860, column: 45, scope: !902)
!1291 = !DILocation(line: 860, column: 23, scope: !902)
!1292 = !DILocation(line: 860, column: 21, scope: !902)
!1293 = !DILocation(line: 861, column: 21, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !902, file: !135, line: 861, column: 21)
!1295 = !DILocation(line: 861, column: 25, scope: !1294)
!1296 = !DILocation(line: 861, column: 21, scope: !902)
!1297 = !DILocation(line: 862, column: 21, scope: !1298)
!1298 = distinct !DILexicalBlock(scope: !1294, file: !135, line: 861, column: 34)
!1299 = !DILocation(line: 862, column: 29, scope: !1298)
!1300 = !DILocation(line: 862, column: 35, scope: !1298)
!1301 = !DILocation(line: 863, column: 35, scope: !1298)
!1302 = !DILocation(line: 864, column: 21, scope: !1298)
!1303 = !DILocation(line: 866, column: 17, scope: !902)
!1304 = !DILocation(line: 866, column: 22, scope: !902)
!1305 = !DILocation(line: 866, column: 28, scope: !902)
!1306 = !DILocation(line: 868, column: 58, scope: !902)
!1307 = !DILocation(line: 868, column: 66, scope: !902)
!1308 = !DILocation(line: 868, column: 55, scope: !902)
!1309 = !DILocation(line: 868, column: 109, scope: !902)
!1310 = !DILocation(line: 868, column: 127, scope: !902)
!1311 = !DILocation(line: 868, column: 132, scope: !902)
!1312 = !DILocation(line: 868, column: 125, scope: !902)
!1313 = !DILocation(line: 868, column: 99, scope: !902)
!1314 = !DILocation(line: 868, column: 97, scope: !902)
!1315 = !DILocation(line: 868, column: 89, scope: !902)
!1316 = !DILocation(line: 868, column: 17, scope: !902)
!1317 = !DILocation(line: 868, column: 25, scope: !902)
!1318 = !DILocation(line: 868, column: 47, scope: !902)
!1319 = !DILocation(line: 869, column: 17, scope: !902)
!1320 = !DILocation(line: 871, column: 17, scope: !902)
!1321 = !DILocation(line: 871, column: 25, scope: !902)
!1322 = !DILocation(line: 871, column: 31, scope: !902)
!1323 = !DILocation(line: 872, column: 31, scope: !902)
!1324 = !DILocation(line: 873, column: 17, scope: !902)
!1325 = !DILocalVariable(name: "dest", scope: !1326, file: !135, line: 877, type: !95)
!1326 = distinct !DILexicalBlock(scope: !816, file: !135, line: 875, column: 9)
!1327 = !DILocation(line: 877, column: 17, scope: !1326)
!1328 = !DILocation(line: 877, column: 40, scope: !1326)
!1329 = !DILocation(line: 877, column: 48, scope: !1326)
!1330 = !DILocation(line: 877, column: 60, scope: !1326)
!1331 = !DILocalVariable(name: "src", scope: !1326, file: !135, line: 878, type: !95)
!1332 = !DILocation(line: 878, column: 17, scope: !1326)
!1333 = !DILocation(line: 878, column: 40, scope: !1326)
!1334 = !DILocation(line: 878, column: 48, scope: !1326)
!1335 = !DILocation(line: 878, column: 60, scope: !1326)
!1336 = !DILocation(line: 878, column: 72, scope: !1326)
!1337 = !DILocation(line: 878, column: 70, scope: !1326)
!1338 = !DILocalVariable(name: "n", scope: !1326, file: !135, line: 879, type: !107)
!1339 = !DILocation(line: 879, column: 18, scope: !1326)
!1340 = !DILocation(line: 879, column: 22, scope: !1326)
!1341 = !DILocation(line: 879, column: 30, scope: !1326)
!1342 = !DILocation(line: 879, column: 42, scope: !1326)
!1343 = !DILocation(line: 879, column: 49, scope: !1326)
!1344 = !DILocation(line: 879, column: 57, scope: !1326)
!1345 = !DILocation(line: 879, column: 69, scope: !1326)
!1346 = !DILocation(line: 879, column: 47, scope: !1326)
!1347 = !DILocation(line: 879, column: 81, scope: !1326)
!1348 = !DILocation(line: 879, column: 79, scope: !1326)
!1349 = !DILocation(line: 880, column: 19, scope: !1326)
!1350 = !DILocation(line: 880, column: 25, scope: !1326)
!1351 = !DILocation(line: 880, column: 30, scope: !1326)
!1352 = !DILocation(line: 880, column: 11, scope: !1326)
!1353 = !DILocation(line: 881, column: 39, scope: !1326)
!1354 = !DILocation(line: 881, column: 11, scope: !1326)
!1355 = !DILocation(line: 881, column: 19, scope: !1326)
!1356 = !DILocation(line: 881, column: 31, scope: !1326)
!1357 = !DILocation(line: 881, column: 36, scope: !1326)
!1358 = !DILocation(line: 882, column: 42, scope: !1326)
!1359 = !DILocation(line: 882, column: 11, scope: !1326)
!1360 = !DILocation(line: 882, column: 19, scope: !1326)
!1361 = !DILocation(line: 882, column: 31, scope: !1326)
!1362 = !DILocation(line: 882, column: 39, scope: !1326)
!1363 = distinct !{!1363, !812, !1364, !377}
!1364 = !DILocation(line: 884, column: 5, scope: !751)
!1365 = !DILocation(line: 887, column: 5, scope: !751)
!1366 = !DILocation(line: 888, column: 12, scope: !751)
!1367 = !DILocation(line: 888, column: 5, scope: !751)
!1368 = !DILocation(line: 889, column: 1, scope: !751)
!1369 = distinct !DISubprogram(name: "__mqtt_send", scope: !135, file: !135, line: 498, type: !752, scopeLine: 499, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !273)
!1370 = !DILocalVariable(name: "client", arg: 1, scope: !1369, file: !135, line: 498, type: !587)
!1371 = !DILocation(line: 498, column: 41, scope: !1369)
!1372 = !DILocalVariable(name: "inspected", scope: !1369, file: !135, line: 500, type: !101)
!1373 = !DILocation(line: 500, column: 13, scope: !1369)
!1374 = !DILocalVariable(name: "len", scope: !1369, file: !135, line: 501, type: !754)
!1375 = !DILocation(line: 501, column: 13, scope: !1369)
!1376 = !DILocalVariable(name: "inflight_qos2", scope: !1369, file: !135, line: 502, type: !7)
!1377 = !DILocation(line: 502, column: 9, scope: !1369)
!1378 = !DILocalVariable(name: "i", scope: !1369, file: !135, line: 503, type: !7)
!1379 = !DILocation(line: 503, column: 9, scope: !1369)
!1380 = !DILocation(line: 505, column: 5, scope: !1369)
!1381 = !DILocation(line: 507, column: 9, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !1369, file: !135, line: 507, column: 9)
!1383 = !DILocation(line: 507, column: 17, scope: !1382)
!1384 = !DILocation(line: 507, column: 23, scope: !1382)
!1385 = !DILocation(line: 507, column: 27, scope: !1382)
!1386 = !DILocation(line: 507, column: 30, scope: !1382)
!1387 = !DILocation(line: 507, column: 38, scope: !1382)
!1388 = !DILocation(line: 507, column: 44, scope: !1382)
!1389 = !DILocation(line: 507, column: 9, scope: !1369)
!1390 = !DILocation(line: 508, column: 9, scope: !1391)
!1391 = distinct !DILexicalBlock(scope: !1382, file: !135, line: 507, column: 79)
!1392 = !DILocation(line: 509, column: 16, scope: !1391)
!1393 = !DILocation(line: 509, column: 24, scope: !1391)
!1394 = !DILocation(line: 509, column: 9, scope: !1391)
!1395 = !DILocation(line: 513, column: 11, scope: !1369)
!1396 = !DILocation(line: 513, column: 9, scope: !1369)
!1397 = !DILocation(line: 514, column: 5, scope: !1369)
!1398 = !DILocation(line: 514, column: 11, scope: !1399)
!1399 = distinct !DILexicalBlock(scope: !1400, file: !135, line: 514, column: 5)
!1400 = distinct !DILexicalBlock(scope: !1369, file: !135, line: 514, column: 5)
!1401 = !DILocation(line: 514, column: 15, scope: !1399)
!1402 = !DILocation(line: 514, column: 13, scope: !1399)
!1403 = !DILocation(line: 514, column: 5, scope: !1400)
!1404 = !DILocalVariable(name: "msg", scope: !1405, file: !135, line: 515, type: !96)
!1405 = distinct !DILexicalBlock(scope: !1399, file: !135, line: 514, column: 25)
!1406 = !DILocation(line: 515, column: 37, scope: !1405)
!1407 = !DILocation(line: 515, column: 43, scope: !1405)
!1408 = !DILocalVariable(name: "resend", scope: !1405, file: !135, line: 516, type: !7)
!1409 = !DILocation(line: 516, column: 13, scope: !1405)
!1410 = !DILocation(line: 517, column: 13, scope: !1411)
!1411 = distinct !DILexicalBlock(scope: !1405, file: !135, line: 517, column: 13)
!1412 = !DILocation(line: 517, column: 18, scope: !1411)
!1413 = !DILocation(line: 517, column: 24, scope: !1411)
!1414 = !DILocation(line: 517, column: 13, scope: !1405)
!1415 = !DILocation(line: 519, column: 20, scope: !1416)
!1416 = distinct !DILexicalBlock(scope: !1411, file: !135, line: 517, column: 47)
!1417 = !DILocation(line: 520, column: 9, scope: !1416)
!1418 = !DILocation(line: 520, column: 20, scope: !1419)
!1419 = distinct !DILexicalBlock(scope: !1411, file: !135, line: 520, column: 20)
